{
  "status": "success",
  "source": "openalex",
  "query": "use theory meaning grounding",
  "results": [
    {
      "openalex_id": "W4246139359",
      "doi": "10.7551/mitpress/9629.001.0001",
      "title": "The Geometry of Meaning",
      "authors": [
        {
          "name": "Peter Gärdenfors",
          "openalex_id": "A5047434698",
          "orcid": "https://orcid.org/0000-0001-7423-828X"
        }
      ],
      "publication_year": 2014,
      "publication_date": "2014-01-17",
      "abstract": "A novel cognitive theory of semantics that proposes that the meanings of words can be described in terms of geometric structures. In The Geometry of Meaning, Peter Gärdenfors proposes a theory of semantics that bridges cognitive science and linguistics and shows how theories of cognitive processes, in particular concept formation, can be exploited in a general semantic model. He argues that our minds organize the information involved in communicative acts in a format that can be modeled in geometric or topological terms—in what he terms conceptual spaces, extending the theory he presented in an earlier book by that name. Many semantic theories consider the meanings of words as relatively stable and independent of the communicative context. Gärdenfors focuses instead on how various forms of communication establish a system of meanings that becomes shared between interlocutors. He argues that these “meetings of mind” depend on the underlying geometric structures, and that these structures facilitate language learning. Turning to lexical semantics, Gärdenfors argues that a unified theory of word meaning can be developed by using conceptual spaces. He shows that the meaning of different word classes can be given a cognitive grounding, and offers semantic analyses of nouns, adjectives, verbs, and prepositions. He also presents models of how the meanings of words are composed to form new meanings and of the basic semantic role of sentences. Finally, he considers the future implications of his theory for robot semantics and the Semantic Web.",
      "cited_by_count": 344,
      "type": "book",
      "source": {
        "name": "The MIT Press eBooks",
        "type": "ebook platform",
        "issn": null
      },
      "open_access": {
        "is_oa": false,
        "oa_status": "closed",
        "oa_url": null
      },
      "topics": [],
      "referenced_works_count": 0,
      "url": "https://openalex.org/W4246139359"
    },
    {
      "openalex_id": "W593257684",
      "doi": null,
      "title": "The Geometry of Meaning: Semantics Based on Conceptual Spaces",
      "authors": [
        {
          "name": "Peter Gärdenfors",
          "openalex_id": "A5047434698",
          "orcid": "https://orcid.org/0000-0001-7423-828X",
          "institutions": [
            "Institute for Cognitive Science Studies"
          ]
        }
      ],
      "publication_year": 2014,
      "publication_date": "2014-01-17",
      "abstract": "In The Geometry of Meaning, Peter Gärdenfors proposes a theory of semantics that bridges cognitive science and linguistics and shows how theories of cognitive processes, in particular concept formation, can be exploited in a general semantic model. He argues that our minds organize the information involved in communicative acts in a format that can be modeled in geometric or topological terms—in what he terms conceptual spaces, extending the theory he presented in an earlier book by that name. Many semantic theories consider the meanings of words as relatively stable and independent of the communicative context. Gärdenfors focuses instead on how various forms of communication establish a system of meanings that becomes shared between interlocutors. He argues that these “meetings of mind” depend on the underlying geometric structures, and that these structures facilitate language learning. Turning to lexical semantics, Gärdenfors argues that a unified theory of word meaning can be developed by using conceptual spaces. He shows that the meaning of different word classes can be given a cognitive grounding, and offers semantic analyses of nouns, adjectives, verbs, and prepositions. He also presents models of how the meanings of words are composed to form new meanings and of the basic semantic role of sentences. Finally, he considers the future implications of his theory for robot semantics and the Semantic Web.",
      "cited_by_count": 341,
      "type": "book",
      "source": null,
      "open_access": {
        "is_oa": true,
        "oa_status": "green",
        "oa_url": "http://ci.nii.ac.jp/ncid/BB1545254X"
      },
      "topics": [
        "Semantic Web and Ontologies"
      ],
      "referenced_works_count": 0,
      "url": "https://openalex.org/W593257684"
    },
    {
      "openalex_id": "W2026055402",
      "doi": "10.1080/0020174x.2014.907542",
      "title": "No Work for a Theory of Grounding",
      "authors": [
        {
          "name": "Jessica Wilson",
          "openalex_id": "A5101762657",
          "orcid": "https://orcid.org/0000-0003-0109-9682",
          "institutions": [
            "University of Toronto"
          ]
        }
      ],
      "publication_year": 2014,
      "publication_date": "2014-06-24",
      "abstract": "AbstractIt has recently been suggested that a distinctive metaphysical relation— 'Grounding'—is ultimately at issue in contexts in which some goings-on are said to hold 'in virtue of'', be (constitutively) 'metaphysically dependent on', or be 'nothing over and above' some others. Grounding is supposed to do good work (better than merely modal notions, in particular) in illuminating metaphysical dependence. I argue that Grounding is also unsuited to do this work. To start, Grounding alone cannot do this work, for bare claims of Grounding leave open such basic questions as whether Grounded goings-on exist, whether they are reducible to or rather distinct from Grounding goings-on, whether they are efficacious, and so on; but in the absence of answers to such basic questions, we are not in position to assess the associated claim or theses concerning metaphysical dependence. There is no avoiding appeal to the specific metaphysical relations typically at issue in investigations into dependence—for example, type or token identity, functional realization, classical mereological parthood, the set membership relation, the proper subset relation, the determinable/determinate relation, and so on—which are capable of answering these questions. But, I argue, once the specific relations are on the scene, there is no need for Grounding. AcknowledgementsThanks to Ralf Bader, Andrew Bailey (my commentator at the Arizona Metaphysics Conference), Mark Barber, Karen Bennett, Stephen Biggs, Shamik Dasgupta, Brian Embry, Kit Fine, Alex Jackson, David Kovacs (my commentator at Cornell), Kathrin Koslicki, Jon Litland, Adam Murray, Laurie Paul, Michael Raven, Jonathan Schaffer, Irem Kurtsal Steen, Mark Steen, Ted Sider, Kelly Trogdon, Robbie Williams, participants at the 2013 Arizona Ontology Conference, 2013 Princeton CARNP Workshop on Metaphysical Structure, and 2014 LSU Graduate Student Conference, members of the Bogazici, Cornell, OSU, Oslo, and Virginia Tech Departments of Philosophy, members of the Arché group at St Andrews, members of the LOGOS group at the University of Barcelona, and, most of all, Benj Hellie, for very helpful comments.Notes1 Notably, in Fine, 'Question of Realism'; Schaffer, 'On What Grounds What'; and Rosen, 'Metaphysical Dependence'. See also, for example: Sider, Writing the Book of the World; Raven, 'In Defence of Ground'; Trogdon, 'Introduction to Grounding'; Bennett, Making Things Up; and the contributions to Correia and Schneider, Metaphysical Grounding (see esp. Correia and Schneider, 'Grounding'; Audi, 'Clarification and Defense'; Fine, 'Guide to Ground'; Koslicki, 'Varieties of Ontological Dependence'; Schaffer, 'Grounding, Transitivity, and Contrastivity'). A good source for historical references on the topic of a general relation of ontological dependence going beyond the usual suspects (including Lowe, Possibility of Metaphysics; Witmer, Butchard, and Trogdon, 'Intrinsicality without Naturalness'; and Schneider, 'Certain Kind of Trinity') is Trogdon, 'Introduction to Grounding'.2 Fine allows that there are multiple Grounding relations, and maintains that 'we should understand the generic relation as some kind of \"disjunction\" of the special relations'; moreover, on his view each special relation 'comes in different 'flavors''. Fine, 'Guide to Ground', 4, 16.3 Proponents disagree about the relata of Grounding: for Schaffer these are entities of any category; for Fine these are propositions that are typically but need not be true (though he also refers to these as 'facts', and lately favors taking the relata to be sentences). Schaffer, 'On What Grounds What'; Fine, 'Question of Realism'. For Rosen these are facts, understood as 'structured entities built up from worldly items [along lines of] true Russellian propositions'. Rosen, 'Metaphysical Dependence', 4 (though see Section V.ii for discussion of how Rosen is led to depart from traditional Russellianism). Motivations for taking the relata to be representational reflect a conception of Grounding as entering into explanations, suited to be reasoned with (as in Fine's 'logic of ground'). My view is that in specifying the relata relevant to grounding explanations, metaphysicians should talk about the worldly goings-on directly; compare causation and causal explanation, where theorizing cuts to the metaphysical chase; Schaffer makes the same point. Schaffer, 'Grounding, Transitivity, and Contrastivity', 2. That said, given the worldly nature of Fine's and Rosen's propositional facts, and given that grounding relations between worldly entities bring facts/Russellian propositions in their wake, there are presumably translation strategies between these accounts; ibid..4 Schaffer, 'On What Grounds What', 379. See also Rosen, 'Metaphysical Dependence, 109.5 Fine, 'Question of Realism', 2001, 10. Note that Fine's focus on reductive means of characterizing metaphysical dependence need not be seen as exclusive—as, for example, non-reductive physicalists think.6 Fine, 'Essence and Modality'.7 Schaffer, 'On What Grounds What', 364.8 Rosen, 'Metaphysical Dependence', 113. See also Fine, 'Guide to Ground', 37.9 Fine, 'Guide to Ground', 38. See also Audi, whose 'argument for Grounding' proceeds from the premises (1) If one fact explains another, then the one plays some role in determining the other, and (2) There are explanations in which the explaining fact plays no causal role with respect to the explained fact, to the conclusion that (3) There is a non-causal relation of determination. Audi, 'Clarification and Defense'.10 Schaffer is explicit that by his lights, Grounding is hyperintensional; and though Fine and Rosen do not explicitly couch their posit in these terms, other of their commitments (e.g. Fine's supposition that metaphysically necessary connection is necessary, though not sufficient, for metaphysical dependence) suggest that they, too, take Grounding to be hyperintensional. My own view is that metaphysically necessary connection is not necessary for metaphysical dependence; see Wilson, 'Non-Reductive Realization'. For further discussion of this issue, see Trogdon, 'Introduction to Grounding'.11 Here too (see note 3) I understand talk of Grounding's being 'primitive' in metaphysical, not representational terms; indefinability of representations is not (idealism and the like aside) to the point.12 Schaffer, 'On What Grounds What', 364 (emphasis in original).13 Rosen, 'Metaphysical Dependence, 113–14 (emphasis in original).14 In Section II.i I provide specific case studies of how various of these relations are deployed in contexts relevant to formulating physicalism or naturalism, and to providing accounts of dispositions.15 If this claim is not obvious, then beyond the case studies I provide in Section II.i, I suggest searching under the aforementioned topics and relations in PhilPapers; there are thousands of confirming instances. The dialectical point I am making here, while prefatory to the main argumentative thrust of this paper, is important for a number of reasons, not least because the just-so story elides extensive swathes of significant literature on metaphysical dependence (and, relatedly, fundamentality).16 Schaffer, 'On What Grounds What', 351–2.17 Fine, 'Question of Realism', 13.18 Fine, 'Guide to Ground', 42. There are tricky interpretive questions about Fine's (in Fine, 'Question of Realism') use of 'realist' and 'anti-realist', as characterizing metaphysical views. On the standard understanding (see Miller, 'Realism'), if one is anti-realist about the Xs one (at least) denies the (real) existence of the Xs. This does not entirely comport with Fine's stated aim of making sense of metaphysical anti-realism, associated with conceptions of the real as the factual and the (ontologically) irreducible, respectively; for while non-factualist positions (expressivism, eliminativism) are anti-realist in the standard sense, reductionists are realists in the standard sense (the reducible being as real as that to which it is reduced). Fine admits that 'Many philosophers do not take reduction to have antirealist import' ('Question of Realism', 4, note 2), but since ontological reduction involves some or other identity claim (forcing the existence of the reducible) it is unclear, on the standard understanding, whether there are any anti-realist reductionists. On what appears to be Fine's alternative understanding, if one is anti-realist about the Xs, then one (at least) denies that the Xs are fundamental. Hence it is that, though Fine ultimately characterizes the real in primitive terms, nonetheless attention to Grounding ('nothing more than') claims can, Fine maintains, illuminate and help legislate realist/anti-realist disputes, in assisting in the determination of what is and is not fundamental. A 'non-fundamentalist' understanding of anti-realism makes (terminologically confusing and overly broad) room for reductive anti-realism, as the view that Xs exist, but are not fundamental (a claim also, confusingly, endorsed by non-reductivists, as in the physicalism debates); it also makes sense of non-factualist anti-realism, as the view that Xs are neither fundamental nor Grounded in the fundamental. One question about the target application of Fine's alternative conception reflects that reductionist ontological views are identity-based; hence if Grounding is to play a role in illuminating reductive anti-fundamentalism, then Grounding must be compatible with identity. I am fine with that, but proponents of Grounding typically are not; see Section V.ii for further discussion.19 Rosen, 'Metaphysical Dependence', 111.20 It is worth noting that the concerns raised in this and future sections do not hinge on any general complaints about general notions. As I periodically track along the way, a general relation of Causation (should anyone care to posit such a relation) is not subject to the difficulties facing Grounding.21 Rosen, 'Metaphysical Dependence', 111–12 (emphasis in original).22 See Schiffer, Remnants of Meaning; Kim, 'Supervenience'; Heil, Nature of True Minds; Horgan, 'From Supervenience to Superdupervenience'; Wilson, 'Supervenience-based Formulations'. The examples to follow are drawn from the latter paper.23 For example, Broad, Mind and its Place.24 I argue that robust emergentism is both coherent and naturalistically acceptable, when interpreted as involving the coming into play of a new fundamental interaction upon the occurrence or instantiation of certain complex states (this is one way of characterizing the traditional understanding of robust emergence as involving both dependence and fundamentality); and I argue that various philosophical or scientific commitments (e.g. a view on which properties are essentially individuated by certain systems of laws, or holism about fundamental interactions) would, if held, support taking robustly emergent goings-on to supervene with metaphysical necessity on physical goings-on. Wilson, 'Supervenience-based Formulations' (and elsewhere). This discussion (see also other citations in note 25) is relevant to assessing Bennett's claim that 'independence is a—the—central aspect of our notion of fundamentality'. Bennett, Making Things Up.25 See, for example, McLaughlin, 'Rise and Fall'; Wilson, 'Supervenience-based Formulations'; Barnes, 'Emergence and Fundamentality'.26 Sider (pers. comm.) suggested that a proponent of Grounding could make sense of dependent over and above goings-on by giving an account of the dependence in purely modal terms, then adding a claim of such dependence to the claim of (failure of) Grounding. But first (as is a common theme in this paper), one should not build controversial assumptions (e.g. that the notion of dependence at issue in robust emergence is to be understood in purely modal terms) into general resources for metaphysical theorizing. And, second, this 'supplementary' strategy undermines the motivation for Grounding according to which supervenience is too coarse-grained to characterize appropriately metaphysical dependence; for when supervenience is appropriately supplemented (e.g. by claims of conceptual entailment, as in Chalmers, Conscious Mind), it too can make finer-grained distinctions.27 Per usual, Fine's work anticipates this concern, in explicitly allowing for partial Grounding. I cannot enter into the more subtle details of Fine's investigations here; suffice to say that a relation of partial Grounding is not up to the task of making sense of the usual ('in virtue of'; 'nothing over and above') idioms of metaphysical dependence that proponents of Grounding take as implicitly defining their posit. It is especially unclear how a relation of partial Grounding is supposed to comport with Schaffer's and Rosen's supposition that Grounding is primitive. Is the basic primitive Partial Grounding, and if so, how does this comport with Complete Grounding? Note that one cannot define Complete Grounding in terms of Partial Grounding, along lines of defining parthood in terms of primitive proper parthood and identity. Rather, to handle the case of robust emergentism, primitivists about Grounding will require, it seems, at least two primitively related primitive relations.28 Supervenience, by way of contrast, is capable of tracking (at least existential) dependence on its own, so in this respect it does better than Grounding for purposes of characterizing metaphysical structure.29 Rosen, 'Metaphysical Dependence', 111 (emphasis added). It seems that we must here interpret 'genuine' in terms of existence: unlike Fine's use of 'real', Rosen's use of 'genuine' cannot mean 'fundamental', since then the quoted passage will not make sense. As such, Rosen's characterization of naturalism as compatible with the normative's being both Grounded in the natural ('for the naturalist, every normative fact and every intentional fact is grounded in … non-normative, non-intentional facts', 111) and not existing does not track any existing naturalist position. Alternatively, perhaps the idea is that eliminativism about the normative or intentional is compatible with vacuous satisfaction of the naturalist thesis ('Every fact tops a naturalistic tree', 112); but in that case, a Grounding formulation of naturalism does not realize the advertised virtue of allowing an 'exact' formulation of naturalism ('if we take the 'in virtue of' idiom for granted, we can [express the naturalist's position about the normative and the intentional] exactly', 111).30 Fine, 'Question of Realism, 15.31 Ibid., 21.32 Either interpretation of Fine's claim may seem at odds with his intended use of Grounding, as enabling us to 'determine the viability of a realist or anti-realist stand' on the goings-on at issue; we shall see how he resolves this in Section II.iii.33 One might wonder (as Karen Bennett and Jon Litland did; pers. comm.) how the holding of a Grounding relation can leave open the existence of the Grounded: does not the holding of a relation require that all the relata exist? It would seem so, whether worldly entities, facts, or Russellian propositions are at issue; but such factivity is hard to square with the explicit pronouncements of ontological neutrality. Since Fine's propositions are not explicitly Russellian (notwithstanding that he sometimes refers to them as 'facts') he is in a somewhat better position to maintain that the truth (or counterfactual truth) of a Grounded proposition leaves open the existence (counterfactual existence) of the worldly entities whose dependence is at issue in the proposition (which he presumably wants to do in order to make sense of standard anti-realist accounts). Alternatively (as Litland has suggested) one might preserve the stated neutrality by conceiving of Grounding in operator-based rather than relational terms. I cannot read between all the relevant lines here, but am just going to proceed by taking at face value the several explicit remarks about the ontological neutrality and relational nature of Grounding.34 I say 'almost never', since conditions of epistemic uncertainty or studied metaphysical neutrality might motivate sticking with a general grounding claim; here the exceptions prove the rule.35 See, for example: Place, 'Is Consciousness a Brain Process'; Smart, 'Sensations and Brain Processes'. For 'realizer functionalist' variations on the theme of type-identity, see: Lewis, 'Argument for the Identity Theory', 'Reduction of Mind'; Armstrong, Materialist Theory; Kim, 'Myth of Non-Reductive Materialism'.36 See, for example: Davidson, 'Mental Events'; Macdonald and Macdonald, 'How to Be'; Ehring, 'Part–Whole Physicalism'. In saying that normative states might be grounded in naturalistic states by way of type or token identity, I am assuming, contra some proponents of Grounding, that identity may be a grounding relation. In Section V, I argue that proponents of Grounding are wrong to deny this, and I address the question (familiar from the physicalism debates) of how to make sense of the intended direction of priority in cases in which nothing over and above-ness is understood in terms of identity. For now I make the following observation: insofar as proponents of Grounding typically link this posit to the standard ('metaphysically depends on', 'in virtue of', 'nothing over and above', and so on) idioms of dependence, as they enter into naturalist and physicalist theses in particular, and insofar as standard versions of these theses explicitly interpret the idioms in terms of identity, the default position would appear to be that grounding, and moreover Grounding, should be compatible with identity, whatever proponents of Grounding have maintained.37 See, for example: Putnam, 'Minds and Machines'; Shoemaker, 'Functionalism and Qualia'.38 See, for example: Yablo, 'Mental Causation'; Macdonald and Macdonald, 'How to Be'; Wilson, 'Determination, Realization', 'How Superduper'.39 See, for example: Clapp, 'Disjunctive Properties'; Shoemaker, 'Realization and Mental Causation'; Paul, 'Logical Parts'.40 See Wilson, 'How Superduper', 'Non-Reductive Realization'; Shoemaker, 'Realization and Mental Causation', Physical Realization.41 See, for example: Paul Churchland, 'Eliminative Materialism'; Patricia Churchland, Neurophilosophy.42 To be sure, proponents of a given specific relation will not always agree as regards all of its implications for the dependent relata. For example, the that token of the determinable/determinate relation are and I take determinable/determinate to be But in general there is on what the holding of a given relation has in contexts in which metaphysical dependence is at issue, and, in any case, insofar as the relation is there is that about its can Macdonald and Macdonald, 'How to Be'; Yablo, 'Mental Causation'; Wilson, 'How Superduper', 'Determination, For example, view that Rosen as the of Grounding: of a are always grounded in its and A is in virtue of the of the that make it perhaps with the of and Rosen, 'Metaphysical Dependence', Here proponents of such a view do not with a bare Grounding but rather on to specific accounts of the grounding relation at As different views about the relation between and their causal that have been in the literature views about the relation between properties and physical David a according to which any is with its causal Stephen a according to which any of a is with an of one of its causal with and a according to which a is a of some causal or … There are other views The point the confirming that is up to its in with metaphysical dependence) is that investigations into metaphysical dependence are with an to or assessing what specific grounding might be to hold in a given Rosen, 'Metaphysical Dependence', (see note if supervenience is supplemented (e.g. by claims of conceptual then it too can make finer-grained I say since in view the direction of dependence in these cases is not a the fact that is or is metaphysically to whatever fact when the is the fact that there will or will not be a is metaphysically though (as it might neither of the is whatever fact the to be said (or about the of so to in this for the direction of dependence of and if is If the relations at issue are understood as then making sense of the direction of dependence will require in which the direction of dependence further to what I the motivation for this motivation and that the does not an appeal to Grounding is the topic of Section The will have that both Grounding claims and of Grounding claims if the claims of certain proponents are at face compatible with anti-realist Fine, 'Question of Realism, It is here that Schaffer and Fine do not have the same notion of in if the at issue in Fine's claim involves since Schaffer's claim to Fine's to My own view is that we should not of existence this way, but in any case nothing on this issue for purposes of the general See Wilson, about Schaffer, 'On What Grounds What', (emphasis in Ibid., See also Audi, his general with both Fine's and 'On grounded and are and grounded are an of over and above the in which they are Audi, 'Clarification and See Wilson, Fine, 'Question of Realism', (emphasis in and to an for to the between Grounding and The here is related but different that to be in Section V, of whether Grounding is as a of the grounding Here it is not that is at issue, but rather the idea that an appeal to Grounding may be in specific investigations into metaphysical dependence. The strategies are in that the of Grounding for purposes of specific investigations will presumably hinge on the specific certain in common in are as motivation for some This would be the case, for example, if a given physicalist endorsed a view of properties as involving associated with along with the of of view of in Wilson, 'How and Shoemaker, 'Realization and Mental For of the of about and with see Wilson, 'Non-Reductive Realization'. might also the supervenience claim without the physicalist For discussion of this see Wilson, The basic idea here is that there may be to a claim of nothing over and for example, if the emergence of involves of to fundamental physical such to the of a fundamental then of an absence of such might in as a for taking the to be nothing over and above the the of an This is not to suggest that in such cases we need to appeal to a distinctive Grounding the grounding relation at issue is one holding between the of the dependent and See Wilson, has recently up an alternative way for a coarse-grained notion of Grounding to be as to in investigations into dependence, but rather as to in an account of what it is to be or have an of from entering into the details of discussion here; two in order to account to a notion of as the but as I argue in Section it is to characterize in terms. that a coarse-grained notion of Grounding as into this or that metaphysical account of some the question would what of interpretation the references to or the 'in virtue of' notion or relation in the account should As I read for example, the to 'in virtue of' is read as over specific grounding Bader, a See Schaffer, See also Trogdon, that supervene on but that in the other Trogdon, and Mark that there is a between about Grounding and the claim that the specific relations are not up to the task of the direction of if Grounding is like an from the specific relations (a position that Fine, seems to then it is unclear how the associated Grounding relation could this direction that the specific relations cannot do This seems in which case the motivation for Grounding should (and Fine's to this be seen as in support of a primitive relation of A may be as fundamental if the so to of the is to investigations into the dependence relations at for example, the entities by fundamental might as a fundamental for scientific if the physical entities are to some of In contexts in which general theses like physicalism are at issue, the entities are typically understood as being under certain for example, if the physical entities are the and relations by fundamental one of then the entities that are to be of the the reductive physicalist may appeal in their are of physical entities, relational of physical entities, or mereological of such entities or relational This is a common way to characterize the fundamental. Hence Schaffer notion of a fundamental … can be as … is fundamental nothing Schaffer, 'On What Grounds What', Bennett do not there is any question that is a—the—central aspect of our notion of Bennett, Making Things Note that the account or characterization of the fundamental at issue has to be in metaphysical terms if it is to motivate the posit of Grounding. appeal to as or characterizing a primitive fundamental the I will would not suffice to motivate Hence it would be to to motivate Grounding by appeal to the of account of the fundamental by Raven, according to which is fundamental if all of its Grounds are ultimately Grounded in such that, in the case in which is the is See note for with Raven, 'In Defence of",
      "cited_by_count": 739,
      "type": "article",
      "source": {
        "name": "Inquiry",
        "type": "journal",
        "issn": [
          "0020-174X",
          "1502-3923"
        ]
      },
      "open_access": {
        "is_oa": false,
        "oa_status": "closed",
        "oa_url": null
      },
      "topics": [
        "Epistemology, Ethics, and Metaphysics",
        "Philosophy and Theoretical Science",
        "Philosophy and History of Science"
      ],
      "referenced_works_count": 77,
      "url": "https://openalex.org/W2026055402"
    },
    {
      "openalex_id": "W1540174907",
      "doi": "10.4135/9781848607934",
      "title": "The Sage handbook of action research : participative inquiry and practice",
      "authors": [
        {
          "name": "Sarah Riley",
          "openalex_id": "A5086767090",
          "orcid": "https://orcid.org/0000-0002-4271-7144"
        },
        {
          "name": "Hilary Bradbury",
          "openalex_id": "A5046149111",
          "orcid": "https://orcid.org/0000-0002-5749-5150"
        }
      ],
      "publication_year": 2008,
      "publication_date": "2008-01-01",
      "abstract": "PART ONE: GROUNDINGS Introduction to Groundings - Peter Reason and Hilary Bradbury Living Inquiry - Patricia Gaya Wicks, Peter Reason and Hilary Bradbury Personal, Political and Philosophical Groundings of Action Research Practice Participatory Action Research as Practice - Marja Liisa Swantz Some Trends in the Praxis of Participatory Action Research - Md. Anisur Rahman Action Research and the Challenge of Scope - Bjorn Gustavsen, Agneta Hansson and Thoralf U Qvale Action Research at Work - Hilary Bradbury et al Creating the Future Following the Path from Lewin Continuing the Journey - Colleen Reid and Wendy Frisby Articulating the Dimensions of Feminist Participatory Research Towards Transformational Liberation - M Brinton Lykes and Amelia Mallona Participatory Action Research and Activist Praxis Critical Theory and Participatory Action Research - Stephen Kemmis Systems Thinking and Practice for Action Research - Ray Ison Social Construction and Research as Action - Kenneth J Gergen and Mary M Gergen Power and Knowledge - John Gaventa and Andrea Cornwall Appreciable Worlds and Inspired Inquiry - Danielle P Zandee and David L Cooperrider Ethics and Action Research - Mary Brydon Miller Deepening Our Commitment to Principles of Social Justice and Redefining Systems of Democratic Practice The Future of Universities - Morten Levin and Davydd Greenwood Action Research and the Transformation of Higher Education Action Research, Partnerships and Social Impacts - L David Brown and Rajesh Tandon The Institutional Collaboration of PRIA and IDR PART TWO: PRACTICES Introduction to Practices - Peter Reason and Hilary Bradbury Action Inquiry - William R Torbert and Steven S Taylor Interweaving Multiple Qualities of Attention for Timely Action Action Science - Victor J Friedman and Tim Rogers Linking Causal Theory and Meaning-Making in Action Research Clinical Inquiry/Research - Edgar H Schein The Practice of Appreciative Inquiry - James D Ludema and Ronald E Fry PRA, PLA and Pluralism - Robert Chambers Practice and Theory Action Learning - Mike Pedler and John Burgoyne The Jury Is Out - Tom Wakeford et al How Far Can Participatory Projects Go towards Reclaiming Democracy? Learning History - George Roth and Hilary Bradbury An Action Research Practice in Support of Actionable Learning Extending Epistemology within a Co-Operative Inquiry - John Heron and Peter Reason Action Research in Health Care - Ian Hughes Action Research on a Large Scale - Ann W Martin Issues and Practices Theorizing Audience, Products and Provocation - Michelle Fine and Maria Elena Torre Taking the Action Turn - Sonia Ospina et al Lessons from Bringing Participation to Qualitative Research PART THREE: EXEMPLARS Introduction to Exemplars - Hilary Bradbury and Peter Reason Varieties of Action Research Charismatic Inquiry in Concert - John Heron and Greg Lahood Action Research in the Realm of 'the between' Presentational Knowing - Jennifer Mullett Bridging Experience and Expression with Art, Poetry and Song Working with 'Not Knowing' amid Power Dynamics among Managers - Marianne Kristiansen and Jorgen Bloch-Poulsen From Fault-Finding and Exclusion towards Co-Learning and Inclusion Learning to Love Our Black Selves - Taj Johns Healing from Internalized Oppressions The Tapestry of Leadership - Lyle Yorks et al Lessons from Six Co-Operative Inquiry Groups of Social Justice Leaders The Workplace Stress and Aggression Project - Rita Kowalski, Lyle Yorks and Mariann Jelinek Ways of Knowing - Our Rosetta Stone for Practice Theatre in Participatory Action Research - Meghna Guhathakurta Experiences from Bangladesh Changing the Culture of Dependancy to Allow for Successful Outcomes in Participatory Research - Maria Teresa Castillo, Maria Dolores Viga de Alva and Federico Dickinson 14 Years of Experience in Yucatan, Mexico Health Promotion and Participatory Action Research - Lai Fong Chui The Significance of Participatory Praxis in Developing Participatory Health Intervention 'This Is so Democratic!!' Action Research and Policy Development in East Timor - Ernie Stringer 'No - You Don't Know How We Feel' - Gillian Chowns Collaborative Inquiry Using Children Facing the Life-Threatening Illness of a Parent IT and Action Sense-Making - Chris Dymek Making Sense of a New Technology PART FOUR: SKILLS Introduction to Skills - Peter Reason and Hilary Bradbury Negotiating the Challenges of Participatory Action Research - Jill Grant, Geoff Nelson and Terry Mitchell Relationships, Power, Participation, Change and Credibility Getting in, Getting on, Getting out - Kate Louise McArdle On Working with Second-Person Inquiry Groups Facilitation as Action Research in the Moment - Jenny Mackewn Muddling through - Geoff Mead Facing the Challenges of Managing a Large-Scale Action Research Project Insider Action Research - David Coghlan and A B (Rami) Shani The Dynamics of Developing New Capabilities Teaching Reflective Practice in the Action Science / Action Inquiry Tradition - Steven S Taylor, Jenny W Rudolph and Erica Gabrielle Foldy Key Stages, Concepts and Practices The Praxis of Educating Action Researchers - Morten Levin Finding Form in Writing for Action Research - Judi Marshall Concluding Reflections - Peter Reason and Hilary Bradbury Whither Action Research",
      "cited_by_count": 1221,
      "type": "book",
      "source": null,
      "open_access": {
        "is_oa": false,
        "oa_status": "closed",
        "oa_url": null
      },
      "topics": [
        "Appreciative Inquiry and Organizational Change"
      ],
      "referenced_works_count": 0,
      "url": "https://openalex.org/W1540174907"
    },
    {
      "openalex_id": "W2126715283",
      "doi": "10.1891/9780826159922",
      "title": "Middle Range Theory for Nursing",
      "authors": [
        {
          "name": "Mary Jane Smith",
          "openalex_id": "A5057584916",
          "orcid": "https://orcid.org/0000-0003-2950-9196"
        },
        {
          "name": "Patricia Liehr",
          "openalex_id": "A5055983413",
          "orcid": "https://orcid.org/0000-0001-8735-8846"
        },
        {
          "name": "Joyce J. Fitzpatrick",
          "openalex_id": ""
        },
        {
          "name": "Marlaine C. Smith",
          "openalex_id": ""
        },
        {
          "name": "Mary Jane Smith",
          "openalex_id": ""
        },
        {
          "name": "Patricia R. Liehr",
          "openalex_id": ""
        },
        {
          "name": "Marlaine C. Smith",
          "openalex_id": ""
        },
        {
          "name": "Margaret F. Clayton",
          "openalex_id": ""
        },
        {
          "name": "Marleah Dean",
          "openalex_id": ""
        },
        {
          "name": "Merle Mishel",
          "openalex_id": ""
        },
        {
          "name": "Teresa Daniel Ritchie",
          "openalex_id": ""
        },
        {
          "name": "Suzy Mascaro Walter",
          "openalex_id": ""
        },
        {
          "name": "Patricia Starck",
          "openalex_id": ""
        },
        {
          "name": "Marilyn A. Ray",
          "openalex_id": ""
        },
        {
          "name": "Pamela G. Reed",
          "openalex_id": ""
        },
        {
          "name": "Melinda S. Bender",
          "openalex_id": ""
        },
        {
          "name": "Susan L. Janson",
          "openalex_id": ""
        },
        {
          "name": "Linda S. Franck",
          "openalex_id": ""
        },
        {
          "name": "Kathryn Aldrich Lee",
          "openalex_id": ""
        },
        {
          "name": "Elizabeth R. Lenz",
          "openalex_id": ""
        },
        {
          "name": "Linda C. Pugh",
          "openalex_id": ""
        },
        {
          "name": "Barbara Resnick",
          "openalex_id": ""
        },
        {
          "name": "Patricia R. Liehr",
          "openalex_id": ""
        },
        {
          "name": "Mary Jane Smith",
          "openalex_id": ""
        },
        {
          "name": "Eun-Ok Im",
          "openalex_id": ""
        },
        {
          "name": "John Lowe",
          "openalex_id": ""
        },
        {
          "name": "Heeseung Choi",
          "openalex_id": ""
        },
        {
          "name": "Alvita K. Nathaniel",
          "openalex_id": ""
        },
        {
          "name": "Barbara Riegel",
          "openalex_id": ""
        },
        {
          "name": "Tiny Jaarsma",
          "openalex_id": ""
        },
        {
          "name": "Anna Stromberg",
          "openalex_id": ""
        },
        {
          "name": "Patricia R. Liehr",
          "openalex_id": ""
        },
        {
          "name": "Mary Jane Smith",
          "openalex_id": ""
        },
        {
          "name": "Misako Nagata",
          "openalex_id": ""
        },
        {
          "name": "Kimberly Ann Wallace",
          "openalex_id": ""
        },
        {
          "name": "April L. Shapiro",
          "openalex_id": ""
        },
        {
          "name": "Shelley J. Greif",
          "openalex_id": ""
        },
        {
          "name": "Patricia R. Liehr",
          "openalex_id": ""
        },
        {
          "name": "Mary Jane Smith",
          "openalex_id": ""
        },
        {
          "name": "Patricia R. Liehr",
          "openalex_id": ""
        },
        {
          "name": "Mary Jane Smith",
          "openalex_id": ""
        }
      ],
      "publication_year": 2018,
      "publication_date": "2018-02-01",
      "abstract": null,
      "cited_by_count": 414,
      "type": "book",
      "source": null,
      "open_access": {
        "is_oa": false,
        "oa_status": "closed",
        "oa_url": null
      },
      "topics": [
        "Ethics in medical practice"
      ],
      "referenced_works_count": 0,
      "url": "https://openalex.org/W2126715283"
    },
    {
      "openalex_id": "W2479047040",
      "doi": "10.1093/acprof:oso/9780199744763.001.0001",
      "title": "Cross-Cultural Technology DesignCreating Culture-Sensitive Technology for Local Users",
      "authors": [
        {
          "name": "Huatong Sun",
          "openalex_id": "A5055660110",
          "orcid": "https://orcid.org/0000-0002-9009-8691"
        }
      ],
      "publication_year": 2012,
      "publication_date": "2012-03-02",
      "abstract": "A demanding challenge in cross-cultural design is how to make a usable technology meaningful to local users. This book examines the disconnect of action and meaning in cross-cultural design and presents an innovative framework “Culturally Localized User Experience (CLUE)” to tackle the problem. Drawing from three strands of practice theories—activity theory, British cultural studies, and rhetorical genre theory, the CLUE approach regards local culture as the dynamic nexus of contextual interactions and integrates action and meaning through a dialogical, cyclical design process in order to design a technology that would engage local users within meaningful social practices. With five in-depth case studies of mobile text messaging use in American and Chinese contexts, this book demonstrates that a technology creating for a culturally localized user experience mediates both instrumental practices and social meanings. It calls for a change in cross-cultural design practices from simply applying cultural conventions in design to localizing for social affordances with rich understandings of use activities in context. Meanwhile, the vivid user stories at sites of technology-in-use show the power of “user localization” in connecting design and use, which the book believes essential for the success of an emerging technology like mobile messaging in an era of participatory culture. This book is divided into three parts: theoretical grounding for key concepts, case histories, and scholarly implications. It explores how to create culture-sensitive technology for local users in this increasingly globalized world with a rising participatory culture.",
      "cited_by_count": 264,
      "type": "book",
      "source": {
        "name": "Oxford University Press eBooks",
        "type": "ebook platform",
        "issn": null
      },
      "open_access": {
        "is_oa": false,
        "oa_status": "closed",
        "oa_url": null
      },
      "topics": [
        "Digital Communication and Language",
        "Cultural Industries and Urban Development"
      ],
      "referenced_works_count": 0,
      "url": "https://openalex.org/W2479047040"
    },
    {
      "openalex_id": "W1542566156",
      "doi": "10.5860/choice.36-4312",
      "title": "Approaches to the evolution of language: social and cognitive bases",
      "authors": [],
      "publication_year": 1999,
      "publication_date": "1999-04-01",
      "abstract": "Introduction Michael Studdert-Kennedy, Chris Knight, and James R. Hurford Part I. Grounding Language Function in Social Cognition: 1. Introduction: Grounding language function in social cognition Chris Knight 2. On discontinuing the continuity-discontinuity debate Jean Aitchison 3. The origin of language and cognition Ib Ulbaek 4. Mimesis and the executive suite: missing links in language evolution Merlin Donald 5. Ritual/speech co-evolution: a 'selfish gene' solution to the problem of deception Chris Knight 6. Theory of mind and the evolution of language Robin Dunbar 7. Old wives' tales: the gossip hypothesis and the reliability of cheap signals Camilla Power 8. Altruism, status, and the origin of relevance Jean-Louis Dessalles 9. The evolution of language from social intelligence Robert Worden Part II. The Emergence of Phonology: 10. Introduction: the emergence of phonology Michael Studdert-Kennedy 11. Long call structure in apes as a possible precursor for language Maria Ujhelyi 12. Social sound-making as a precursor to spoken language John F. Locke 13. The particulate origins of language generativity: from syllable to gesture Michael Studdert-Kennedy 14. Evolution of the mechanisms of language output: comparative neurobiology of vocal and manual communication Peter MacNeilage 15. Systemic constraints and adaptive change in the formation of sound structure Bjoern Lindblom 16. The development of sound systems in human language Klaus J. Kohler 17. Synonymy avoidance, phonology and the origin of syntax Andrew Carstairs-McCarthy Part III. The Emergence of Syntax: 18. Introduction: the emergence of syntax James R. Hurford 19. On the supposed 'counterfunctionality' of universal grammar: some evolutionary implications Frederick J. Newmeyer 20. Language evolution and the minimalist program: the origins of syntax Robert C. Berwick 21. Catastrophic evolution: the case for a single step from protolanguage to full human language Derek Bickerton 22. Fitness and the selective adaptation of language Simon Kirby 23. Synthesizing the origins of language and meaning using co-evolution, self-organization and level formation Luc Steels 24. Computational simulations of the emergence of grammar John Batali.",
      "cited_by_count": 463,
      "type": "article",
      "source": {
        "name": "Choice Reviews Online",
        "type": "journal",
        "issn": [
          "0009-4978",
          "1523-8253",
          "1943-5975"
        ]
      },
      "open_access": {
        "is_oa": false,
        "oa_status": "closed",
        "oa_url": null
      },
      "topics": [
        "Language and cultural evolution"
      ],
      "referenced_works_count": 0,
      "url": "https://openalex.org/W1542566156"
    },
    {
      "openalex_id": "W1979636821",
      "doi": "10.1108/jpbm-06-2013-0339",
      "title": "Brand authenticity: model development and empirical testing",
      "authors": [
        {
          "name": "Mike Schallehn",
          "openalex_id": "A5001627714",
          "institutions": [
            "Cologne Business School"
          ]
        },
        {
          "name": "Christoph Burmann",
          "openalex_id": "A5086545582",
          "orcid": "https://orcid.org/0000-0001-9536-420X",
          "institutions": [
            "University of Bremen"
          ]
        },
        {
          "name": "Nicola Riley",
          "openalex_id": "A5009360594",
          "orcid": "https://orcid.org/0000-0002-7367-9099",
          "institutions": [
            "University of Bremen"
          ]
        }
      ],
      "publication_year": 2014,
      "publication_date": "2014-05-13",
      "abstract": "Purpose – The purpose of this paper is to develop a model of brand authenticity and analyze the antecedents and effects of the construct. Although there is no doubt about the relevance of authenticity in personal relationships, published research has yet not thoroughly explored the concept’s meaning in reference to brands. Design/methodology/approach – Based on socio-psychological attribution theories and grounding on the identity-based brand management approach, a causal model of brand authenticity is developed. The hypothesized relationships are analyzed using the partial-least-squares approach. The primary data are based on an online survey conducted in Germany ( n = 600). The respondents were asked about fast-food and beer brands. Findings – The data show that brand authenticity positively impacts on brand trust. Furthermore, the key antecedents in the model (consistency, continuity and individuality of a brand) drive the perception of brand authenticity as hypothesized. Research limitations/implications – The model should be tested in further product categories and moderators should be integrated. Originality/value – The findings suggest that authenticity is perceived when a brand is consistent, continuous and individual in its behavior. Nevertheless, the empirical results indicate that the factor individuality has the lowest influence on perceived brand authenticity. This is an interesting finding, as being “unique” is commonly regarded as an important success factor in branding. Although the study’s findings confirm its relevancy, they relativize its importance: being consistent, meaning that a brand fulfills its brand promise at every brand-touch point, and being continuous, meaning that the brand promise reflects the essential core of the brand, are of major importance.",
      "cited_by_count": 269,
      "type": "article",
      "source": {
        "name": "Journal of Product & Brand Management",
        "type": "journal",
        "issn": [
          "1061-0421",
          "2054-1643"
        ]
      },
      "open_access": {
        "is_oa": false,
        "oa_status": "closed",
        "oa_url": null
      },
      "topics": [
        "Consumer Behavior in Brand Consumption and Identification",
        "Corporate Identity and Reputation",
        "Wine Industry and Tourism"
      ],
      "referenced_works_count": 40,
      "url": "https://openalex.org/W1979636821"
    },
    {
      "openalex_id": "W2754799758",
      "doi": "10.1007/s11135-017-0574-8",
      "title": "Saturation in qualitative research: exploring its conceptualization and operationalization",
      "authors": [
        {
          "name": "Benjamin Saunders",
          "openalex_id": "A5089196029",
          "orcid": "https://orcid.org/0000-0002-0856-1596",
          "institutions": [
            "Keele University"
          ]
        },
        {
          "name": "Julius Sim",
          "openalex_id": "A5064266461",
          "orcid": "https://orcid.org/0000-0002-1816-1676",
          "institutions": [
            "Keele University"
          ]
        },
        {
          "name": "Tom Kingstone",
          "openalex_id": "A5085191105",
          "orcid": "https://orcid.org/0000-0001-9179-2303",
          "institutions": [
            "Keele University"
          ]
        },
        {
          "name": "Shula Baker",
          "openalex_id": "A5055604993",
          "institutions": [
            "Keele University"
          ]
        },
        {
          "name": "Jackie Waterfield",
          "openalex_id": "A5040673012",
          "orcid": "https://orcid.org/0000-0001-9004-7125",
          "institutions": [
            "Queen Margaret University"
          ]
        },
        {
          "name": "Bernadette Bartlam",
          "openalex_id": "A5013529931",
          "orcid": "https://orcid.org/0000-0002-8557-6222",
          "institutions": [
            "Keele University"
          ]
        },
        {
          "name": "Heather Burroughs",
          "openalex_id": "A5017772764",
          "orcid": "https://orcid.org/0000-0002-2701-909X",
          "institutions": [
            "Keele University"
          ]
        },
        {
          "name": "Clare Jinks",
          "openalex_id": "A5006114100",
          "orcid": "https://orcid.org/0000-0002-3407-2446",
          "institutions": [
            "Keele University"
          ]
        }
      ],
      "publication_year": 2017,
      "publication_date": "2017-09-14",
      "abstract": "Saturation has attained widespread acceptance as a methodological principle in qualitative research. It is commonly taken to indicate that, on the basis of the data that have been collected or analysed hitherto, further data collection and/or analysis are unnecessary. However, there appears to be uncertainty as to how saturation should be conceptualized, and inconsistencies in its use. In this paper, we look to clarify the nature, purposes and uses of saturation, and in doing so add to theoretical debate on the role of saturation across different methodologies. We identify four distinct approaches to saturation, which differ in terms of the extent to which an inductive or a deductive logic is adopted, and the relative emphasis on data collection, data analysis, and theorizing. We explore the purposes saturation might serve in relation to these different approaches, and the implications for how and when saturation will be sought. In examining these issues, we highlight the uncertain logic underlying saturation-as essentially a predictive statement about the unobserved based on the observed, a judgement that, we argue, results in equivocation, and may in part explain the confusion surrounding its use. We conclude that saturation should be operationalized in a way that is consistent with the research question(s), and the theoretical position and analytic framework adopted, but also that there should be some limit to its scope, so as not to risk saturation losing its coherence and potency if its conceptualization and uses are stretched too widely.",
      "cited_by_count": 10271,
      "type": "article",
      "source": {
        "name": "Quality & Quantity",
        "type": "journal",
        "issn": [
          "0033-5177",
          "1573-7845"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "hybrid",
        "oa_url": "https://link.springer.com/content/pdf/10.1007/s11135-017-0574-8.pdf"
      },
      "topics": [
        "Qualitative Comparative Analysis Research",
        "Evaluation and Performance Assessment",
        "Qualitative Research Methods and Ethics"
      ],
      "referenced_works_count": 74,
      "url": "https://openalex.org/W2754799758"
    },
    {
      "openalex_id": "W1142976542",
      "doi": "10.1515/9783110197532.1.57",
      "title": "Image schemas: From linguistic analysis to neural grounding",
      "authors": [
        {
          "name": "Ellen Dodge",
          "openalex_id": "A5084959572"
        },
        {
          "name": "George Lakoff",
          "openalex_id": "A5000829187",
          "orcid": "https://orcid.org/0000-0002-8972-2856"
        }
      ],
      "publication_year": 2005,
      "publication_date": "2005-12-15",
      "abstract": "Irnage Schemas: From linguistic analysis to neural grounding Ellen Dodge and George Lakoﬂ Abstract What are image schemas? Why should the same primitive image—schemas occur in the world’s languages, even though spatial relations differ widely? What meth- odologies should we use to study them? How is linguistic theory affected by the answers to these questions? We argue that common primitive image-schemas arise from common brain structures, and that linguistic theory must be based on, and consistent with, what we know about the brain and experience. Focusing on motion-related experiences, we show how linguistics and neuroscience, when taken together, increase our understanding of image schemas. First, we look at how image schemas are expressed in language. Then, working from the assump~ tion that linguistic structure is an expression of neural structure, we shift our at- tention to the brain, showing how recent findings in neuroscience can support an analysis of image schemas that relates the structure of experience, thought, and language to neural structure. This analysis not only enhances our current under- standing of image schemas, but also suggests future avenues for image schema research. Key Words: primitive image schema, LOCOMOT ION schema, Cog theory, secondary sen sory—motor areas 1 . Introduction The idea of image schemas emerged from the empirical research on spatial- relations terms by Len Talmy (1972, 1975, 1978, 1983) and Ron Langacker (1976, 1987) in the mid—l970’s. They found, independently, that (1) even closely related languages vary widely in the meanings of their spatial-",
      "cited_by_count": 211,
      "type": "book-chapter",
      "source": null,
      "open_access": {
        "is_oa": true,
        "oa_status": "green",
        "oa_url": "https://escholarship.org/content/qt2wv2z6kj/qt2wv2z6kj.pdf"
      },
      "topics": [
        "Language, Metaphor, and Cognition",
        "Categorization, perception, and language",
        "Linguistics and Discourse Analysis"
      ],
      "referenced_works_count": 0,
      "url": "https://openalex.org/W1142976542"
    },
    {
      "openalex_id": "W4281564584",
      "doi": "10.29333/ajqr/12085",
      "title": "The Coding Manual for Qualitative Researchers",
      "authors": [
        {
          "name": "Maria Lungu",
          "openalex_id": "A5039501295",
          "orcid": "https://orcid.org/0000-0003-0331-8658",
          "institutions": [
            "Florida Atlantic University"
          ]
        }
      ],
      "publication_year": 2022,
      "publication_date": "2022-05-13",
      "abstract": "The Coding Manual fourth edition is reformatted to 15 chapters and divided into three parts, as opposed to six chapters in the third edition.This provides readers with more straightforward yet more detailed sectional references.The fourth edition also introduces two new first-cycle coding methods, 'metaphor coding' and 'theming the data categorically.'The fourth edition is aptly suited as a guide for teaching contexts for coding processes, given the provision of a companion website with student exercises and digital content.This includes screenshots of relevant academic software for analyzing the material and detailed thematic mapping diagrams.Furthermore, this book can assist novice researchers in determining the appropriate approaches to reinforce their perspectives and provide incremental processes for qualitative coding data.",
      "cited_by_count": 10899,
      "type": "article",
      "source": {
        "name": "American Journal of Qualitative Research",
        "type": "journal",
        "issn": [
          "2576-2141"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "diamond",
        "oa_url": "https://www.ajqr.org/download/the-coding-manual-for-qualitative-researchers-12085.pdf"
      },
      "topics": [
        "Evaluation and Performance Assessment"
      ],
      "referenced_works_count": 14,
      "url": "https://openalex.org/W4281564584"
    },
    {
      "openalex_id": "W2019455361",
      "doi": "10.1016/j.bandl.2009.08.002",
      "title": "Brain embodiment of syntax and grammar: Discrete combinatorial mechanisms spelt out in neuronal circuits",
      "authors": [
        {
          "name": "Friedemann Pulvermüller",
          "openalex_id": "A5045983550",
          "orcid": "https://orcid.org/0000-0003-3210-7112",
          "institutions": [
            "Medical Research Council",
            "MRC Cognition and Brain Sciences Unit"
          ]
        }
      ],
      "publication_year": 2010,
      "publication_date": "2010-02-05",
      "abstract": null,
      "cited_by_count": 182,
      "type": "review",
      "source": {
        "name": "Brain and Language",
        "type": "journal",
        "issn": [
          "0093-934X",
          "1090-2155"
        ]
      },
      "open_access": {
        "is_oa": false,
        "oa_status": "closed",
        "oa_url": null
      },
      "topics": [
        "Neurobiology of Language and Bilingualism",
        "Language, Metaphor, and Cognition",
        "Action Observation and Synchronization"
      ],
      "referenced_works_count": 190,
      "url": "https://openalex.org/W2019455361"
    },
    {
      "openalex_id": "W1975284648",
      "doi": "10.1080/10400435.2002.10132054",
      "title": "AAC Performance and Usability Issues: The Effect of AAC Technology on the Communicative Process",
      "authors": [
        {
          "name": "D. Jeffery Higginbotham",
          "openalex_id": "A5023398298",
          "orcid": "https://orcid.org/0000-0001-9224-2418",
          "institutions": [
            "University at Buffalo, State University of New York"
          ]
        },
        {
          "name": "Kevin Caves",
          "openalex_id": "A5085586619",
          "orcid": "https://orcid.org/0000-0001-6630-9615",
          "institutions": [
            "Duke University",
            "Duke Medical Center"
          ]
        }
      ],
      "publication_year": 2002,
      "publication_date": "2002-06-30",
      "abstract": "In this article, Clark's theory of language use is applied to the study of conversations of augmented speakers and their addressees. Discussion focuses on how shared meaning--called common ground--is achieved, the process of grounding utterances under real-time constraints, and how the media characteristics of devices affect the grounding process. A joint action analysis of grounding will be applied to examples of word-board and Voice Output Communication Aid (VOCA)-mediated conversations to show how participants organize their talk around specific media constraints to conduct their conversations and solve communication problems. The authors argue that this model of device-mediated communication performance, or some variety of it, has the potential to reconcile many of the individual research findings in this field within a single explanatory framework. If successful, this approach could be used to evaluate future research with an empirically-based model of communication performance.",
      "cited_by_count": 77,
      "type": "review",
      "source": {
        "name": "Assistive Technology",
        "type": "journal",
        "issn": [
          "1040-0435",
          "1949-3614"
        ]
      },
      "open_access": {
        "is_oa": false,
        "oa_status": "closed",
        "oa_url": null
      },
      "topics": [
        "Assistive Technology in Communication and Mobility",
        "Speech and dialogue systems",
        "Language, Discourse, Communication Strategies"
      ],
      "referenced_works_count": 55,
      "url": "https://openalex.org/W1975284648"
    },
    {
      "openalex_id": "W2096842010",
      "doi": "10.1016/s0010-0277(02)00053-7",
      "title": "Using relations within conceptual systems to translate across conceptual systems",
      "authors": [
        {
          "name": "Robert L. Goldstone",
          "openalex_id": "A5029222386",
          "orcid": "https://orcid.org/0000-0001-8357-8358",
          "institutions": [
            "Indiana University Bloomington"
          ]
        }
      ],
      "publication_year": 2002,
      "publication_date": "2002-07-01",
      "abstract": null,
      "cited_by_count": 67,
      "type": "article",
      "source": {
        "name": "Cognition",
        "type": "journal",
        "issn": [
          "0010-0277",
          "1873-7838"
        ]
      },
      "open_access": {
        "is_oa": false,
        "oa_status": "closed",
        "oa_url": null
      },
      "topics": [
        "Language and cultural evolution",
        "Advanced Text Analysis Techniques",
        "Speech and dialogue systems"
      ],
      "referenced_works_count": 44,
      "url": "https://openalex.org/W2096842010"
    },
    {
      "openalex_id": "W4238158051",
      "doi": "10.1515/9783110216059",
      "title": "Meaning in Mind and Society",
      "authors": [
        {
          "name": "Peter Harder",
          "openalex_id": "A5032634001"
        }
      ],
      "publication_year": 2010,
      "publication_date": "2010-09-15",
      "abstract": "Meaning is embodied - but it is also social. If Cognitive Linguistics is to be a complete theory of language in use, it must cover the whole spectrum from grounded cognition to discourse struggles and bullshit. This book tries to show how. Cognitive Linguistics knocked down the wall between language and the experiential content of the human mind. Frame semantics, embodiment, conceptual construal, figure-ground organization, metaphorical mapping, and mental spaces are among the results of this breakthrough, which at the same time provided cognitive science as a whole with an essential human dimension. A new phase began when Cognitive Linguistics started to see itself as part of the wider movement of 'usage-based' linguistics. Bringing about an alliance between mind and discourse, it complemented the conceptual dimension that had been dominant until then with a 'use' dimension - thereby living up to the explicit 'experiential' commitment of Cognitive Linguistics. This outward expansion is continuing: The focus on 'meaning construction', which began with the theory of blending, highlights emergent, online effects rather than underlying mappings. Cognitive Linguistics is integrating the evolutionary perspective, which links up individual and population-based features of language. The empirical obligations incurred by this expansion have led to greatly increased attention to corpus and experimental methods, especially in relation to sociolinguistic and language acquisition research. The book describes this development and goes on to discuss the foundational challenge that it creates for Cognitive Linguistics as it begins to cover issues that are also central to types of discourse analysis focusing on social processes of determination. The book argues for a synthesis based on a renewed Cognitive Linguistics, which can accommodate everything from bodily grounding to deconstructible floating signifiers in an integrated complete picture, which also covers the roles of arbitrariness and structure.",
      "cited_by_count": 140,
      "type": "book",
      "source": null,
      "open_access": {
        "is_oa": false,
        "oa_status": "closed",
        "oa_url": null
      },
      "topics": [
        "Language, Metaphor, and Cognition"
      ],
      "referenced_works_count": 0,
      "url": "https://openalex.org/W4238158051"
    },
    {
      "openalex_id": "W2464393218",
      "doi": "10.1177/0003122416650963",
      "title": "Modeling Dynamic Identities and Uncertainty in Social Interactions",
      "authors": [
        {
          "name": "Tobias Schröder",
          "openalex_id": "A5031417487",
          "orcid": "https://orcid.org/0000-0002-7113-7464",
          "institutions": [
            "University of Applied Sciences Potsdam"
          ]
        },
        {
          "name": "Jesse Hoey",
          "openalex_id": "A5071941660",
          "orcid": "https://orcid.org/0000-0001-5340-2204",
          "institutions": [
            "University of Waterloo"
          ]
        },
        {
          "name": "Kimberly B. Rogers",
          "openalex_id": "A5031178810",
          "orcid": "https://orcid.org/0000-0002-3744-5295",
          "institutions": [
            "Dartmouth Hospital",
            "Dartmouth College"
          ]
        }
      ],
      "publication_year": 2016,
      "publication_date": "2016-06-25",
      "abstract": "Drawing on Bayesian probability theory, we propose a generalization of affect control theory (BayesACT) that better accounts for the dynamic fluctuation of identity meanings for self and other during interactions, elucidates how people infer and adjust meanings through social experience, and shows how stable patterns of interaction can emerge from individuals’ uncertain perceptions of identities. Using simulations, we illustrate how this generalization offers a resolution to several issues of theoretical significance within sociology and social psychology by balancing cultural consensus with individual deviations from shared meanings, balancing meaning verification with the learning processes reflective of change, and accounting for noise in communicating identity. We also show how the model speaks to debates about core features of the self, which can be understood as stable and yet malleable, coherent and yet composed of multiple identities that may carry competing meanings. We discuss applications of the model in different areas of sociology, implications for understanding identity and social interaction, as well as the theoretical grounding of computational models of social behavior.",
      "cited_by_count": 79,
      "type": "article",
      "source": {
        "name": "American Sociological Review",
        "type": "journal",
        "issn": [
          "0003-1224",
          "1939-8271"
        ]
      },
      "open_access": {
        "is_oa": false,
        "oa_status": "closed",
        "oa_url": null
      },
      "topics": [
        "Social Power and Status Dynamics",
        "Social and Cultural Dynamics",
        "Opinion Dynamics and Social Influence"
      ],
      "referenced_works_count": 94,
      "url": "https://openalex.org/W2464393218"
    },
    {
      "openalex_id": "W2112230545",
      "doi": "10.1016/b978-0-12-385527-5.00007-3",
      "title": "Abstract Concepts",
      "authors": [
        {
          "name": "Diane Pecher",
          "openalex_id": "A5059172501",
          "orcid": "https://orcid.org/0000-0003-0976-6080",
          "institutions": [
            "Erasmus University Rotterdam"
          ]
        },
        {
          "name": "Inge Boot",
          "openalex_id": "A5022248785",
          "institutions": [
            "Erasmus University Rotterdam"
          ]
        },
        {
          "name": "Saskia van Dantzig",
          "openalex_id": "A5014694097",
          "orcid": "https://orcid.org/0000-0003-3289-1613",
          "institutions": [
            "Leiden University"
          ]
        }
      ],
      "publication_year": 2011,
      "publication_date": "2011-01-01",
      "abstract": null,
      "cited_by_count": 116,
      "type": "book-chapter",
      "source": {
        "name": "\u0098The \u009cPsychology of learning and motivation/\u0098The \u009cpsychology of learning and motivation",
        "type": "book series",
        "issn": [
          "0079-7421",
          "1557-802X"
        ]
      },
      "open_access": {
        "is_oa": false,
        "oa_status": "closed",
        "oa_url": null
      },
      "topics": [
        "Language, Metaphor, and Cognition",
        "Action Observation and Synchronization",
        "Categorization, perception, and language"
      ],
      "referenced_works_count": 159,
      "url": "https://openalex.org/W2112230545"
    },
    {
      "openalex_id": "W284064070",
      "doi": null,
      "title": "Social Approaches to Communication",
      "authors": [
        {
          "name": "Wendy Leeds‐Hurwitz",
          "openalex_id": "A5055895654",
          "orcid": "https://orcid.org/0000-0002-7773-2010"
        }
      ],
      "publication_year": 1995,
      "publication_date": "1995-07-28",
      "abstract": "Long before there were formal organizations or mass media, there was face-to-face interaction--the practice which comprises very core of the study of communication. Until recently, however, research in the field of interpersonal communication has been dominated by a behavioral science approach closely aligned with experimental psychology. This timely and provocative volume critiques the limitations of past models, exploring a range of social which help bring communication up to date. Social approaches, writes Leeds-Hurwitz, question whether the traditional theoretical assumptions and research methods followed in the field are still valid and appropriate. While the roots of these approaches are diverse and interdisciplinary, they overlap in their concern for the construction of self, other, and event, and in their acknowledgment of the researcher's role in establishing not only the research questions but also the research context. Social approaches stress the necessity of recognizing the impact of cultural differences on communication research, and identify the ways in which research inquiry creates meanings at the same time as it investigates them. Most importantly, they focus on instances of contact between individuals, the actual transactions in which people engage. Together they demonstrate the ability to disregard labels in pursuit of a common goal, the construction of a more adequate understanding of human interaction. Robert T. Craig's Foreword describes the historical tension in interpersonal communication between behavioral science approaches, on the one hand, and interpretive approaches, on the other. Parts I and II of the volume highlight the theoretical underpinnings of approaches and the philosophical grounding of some of the more central ideas. Part III elaborates on the assumptions shared by approaches, focusing on a series of key concepts, including the dichotomy between qualitative and quantitative research; reflexivity; constructionism; and the individual. Part IV begins the task of applying approaches to particular research topics, including the use of case studies, rapport in research interviews, ethnography as theory, continuity in relationships, and the co-construction of personal narratives. Part V examines where the various chapters lead us, making a strong case for practical theory as the necessary next step. A unique overview of current theoretical innovations in the study of interpersonal communication, SOCIAL APPROACHES TO COMMUNICATION belongs on the shelf of every professional and student in communication. It will be especially valuable to those interested in communication theory, interpersonal communication, and interaction.",
      "cited_by_count": 221,
      "type": "book",
      "source": null,
      "open_access": {
        "is_oa": false,
        "oa_status": "closed",
        "oa_url": null
      },
      "topics": [
        "Complex Systems and Decision Making",
        "Team Dynamics and Performance",
        "Information Systems Theories and Implementation"
      ],
      "referenced_works_count": 0,
      "url": "https://openalex.org/W284064070"
    },
    {
      "openalex_id": "W2154522442",
      "doi": "10.3389/fpsyg.2011.00015",
      "title": "Manipulating Objects and Telling Words: A Study on Concrete and Abstract Words Acquisition",
      "authors": [
        {
          "name": "Anna M. Borghi",
          "openalex_id": "A5020756269",
          "orcid": "https://orcid.org/0000-0001-9455-8408",
          "institutions": [
            "Institute of Cognitive Sciences and Technologies",
            "University of Bologna"
          ]
        },
        {
          "name": "Andrea Flumini",
          "openalex_id": "A5042592645",
          "institutions": [
            "University of Bologna"
          ]
        },
        {
          "name": "Felice Cimatti",
          "openalex_id": "A5019971805",
          "institutions": [
            "University of Calabria"
          ]
        },
        {
          "name": "‎Davide Marocco",
          "openalex_id": "A5027259197",
          "orcid": "https://orcid.org/0000-0001-5185-1313",
          "institutions": [
            "University of Plymouth"
          ]
        },
        {
          "name": "Claudia Scorolli",
          "openalex_id": "A5028233104",
          "orcid": "https://orcid.org/0000-0003-1375-1500",
          "institutions": [
            "University of Bologna"
          ]
        }
      ],
      "publication_year": 2011,
      "publication_date": "2011-01-01",
      "abstract": "Four experiments (E1-E2-E3-E4) investigated whether different acquisition modalities lead to the emergence of differences typically found between concrete and abstract words, as argued by the words as tools (WAT) proposal. To mimic the acquisition of concrete and abstract concepts, participants either manipulated novel objects or observed groups of objects interacting in novel ways (Training 1). In TEST 1 participants decided whether two elements belonged to the same category. Later they read the category labels (Training 2); labels could be accompanied by an explanation of their meaning. Then participants observed previously seen exemplars and other elements, and were asked which of them could be named with a given label (TEST 2). Across the experiments, it was more difficult to form abstract than concrete categories (TEST 1); even when adding labels, abstract words remained more difficult than concrete words (TEST 2). TEST 3 differed across the experiments. In E1 participants performed a feature production task. Crucially, the associations produced with the novel words reflected the pattern evoked by existing concrete and abstract words, as the first evoked more perceptual properties. In E2-E3-E4, TEST 3 consisted of a color verification task with manual/verbal (keyboard-microphone) responses. Results showed the microphone use to have an advantage over keyboard use for abstract words, especially in the explanation condition. This supports WAT: due to their acquisition modality, concrete words evoke more manual information; abstract words elicit more verbal information. This advantage was not present when linguistic information contrasted with perceptual one. Implications for theories and computational models of language grounding are discussed.",
      "cited_by_count": 119,
      "type": "article",
      "source": {
        "name": "Frontiers in Psychology",
        "type": "journal",
        "issn": [
          "1664-1078"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "gold",
        "oa_url": "https://www.frontiersin.org/articles/10.3389/fpsyg.2011.00015/pdf"
      },
      "topics": [
        "Language, Metaphor, and Cognition",
        "Hearing Impairment and Communication",
        "Multisensory perception and integration"
      ],
      "referenced_works_count": 58,
      "url": "https://openalex.org/W2154522442"
    },
    {
      "openalex_id": "W2089402107",
      "doi": "10.1002/1097-0266(200010/11)21:10/11<1105::aid-smj133>3.0.co;2-e",
      "title": "Dynamic capabilities: what are they?",
      "authors": [
        {
          "name": "Kathleen M. Eisenhardt",
          "openalex_id": "A5045613469",
          "orcid": "https://orcid.org/0000-0002-4879-1679",
          "institutions": [
            "Stanford University"
          ]
        },
        {
          "name": "Jeffrey A. Martin",
          "openalex_id": "A5103803105",
          "institutions": [
            "Stanford University"
          ]
        }
      ],
      "publication_year": 2000,
      "publication_date": "2000-01-01",
      "abstract": "This paper focuses on dynamic capabilities and, more generally, the resource-based view of the firm. We argue that dynamic capabilities are a set of specific and identifiable processes such as product development, strategic decision making, and alliancing. They are neither vague nor tautological. Although dynamic capabilities are idiosyncratic in their details and path dependent in their emergence, they have significant commonalities across firms (popularly termed 'best practice'). This suggests that they are more homogeneous, fungible, equifinal, and substitutable than is usually assumed. In moderately dynamic markets, dynamic capabilities resemble the traditional conception of routines. They are detailed, analytic, stable processes with predictable outcomes. In contrast, in high-velocity markets, they are simple, highly experiential and fragile processes with unpredictable outcomes. Finally, well-known learning mechanisms guide the evolution of dynamic capabilities. In moderately dynamic markets, the evolutionary emphasis is on variation. In high-velocity markets, it is on selection. At the level of RBV, we conclude that traditional RBV misidentifies the locus of long-term competitive advantage in dynamic markets, overemphasizes the strategic logic of leverage, and reaches a boundary condition in high-velocity markets. Copyright © 2000 John Wiley & Sons, Ltd.",
      "cited_by_count": 14037,
      "type": "article",
      "source": {
        "name": "Strategic Management Journal",
        "type": "journal",
        "issn": [
          "0143-2095",
          "1097-0266"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "bronze",
        "oa_url": "https://onlinelibrary.wiley.com/doi/pdfdirect/10.1002/1097-0266%28200010/11%2921%3A10/11%3C1105%3A%3AAID-SMJ133%3E3.0.CO%3B2-E"
      },
      "topics": [
        "Innovation and Knowledge Management",
        "Capital Investment and Risk Analysis",
        "Business Strategy and Innovation"
      ],
      "referenced_works_count": 118,
      "url": "https://openalex.org/W2089402107"
    }
  ],
  "count": 20,
  "errors": []
}
