{
  "status": "success",
  "source": "openalex",
  "query": "denotational semantics philosophy",
  "results": [
    {
      "openalex_id": "W4311810268",
      "doi": "10.1007/s11050-022-09198-2",
      "title": "Isn’t there more than one way to bias a polar question?",
      "authors": [
        {
          "name": "Daniel Goodhue",
          "openalex_id": "A5020691042",
          "orcid": "https://orcid.org/0000-0003-0900-6727",
          "institutions": [
            "Leibniz-Centre General Linguistics"
          ]
        }
      ],
      "publication_year": 2022,
      "publication_date": "2022-12-01",
      "abstract": "Abstract I show that speaker bias in polarity focus questions (PFQs) is context sensitive, while speaker bias in high negation questions (HNQs) is context insensitive. This leads me to develop separate accounts of speaker bias in each of these kinds of polar questions. I argue that PFQ bias derives from the fact that they are frequently used in conversational contexts in which an answer to the question has already been asserted by an interlocutor, thus expressing doubt about the prior assertion. This derivation explains their context sensitivity, and the fact that similar bias arises from polar questions that lack polarity focus. I also provide novel evidence that the prejacents of HNQs lack negation, and thus only have an outer negation reading (see, e.g., Ladd in Papers from the seventeenth regional meeting of the Chicago Linguistic Society, vol. 17, pp. 164–171, 1981; Romero and Han in Linguistics and Philosophy 27(5):609–658, 2004; Krifka in Contrastiveness in information structure, alternatives and scalar implicatures, pp. 359–398, 2017; AnderBois in Questions in discourse, pp. 118–171, 2019; Frana and Rawlins in Semantics and Pragmatics 12(16):1–48, 2019; Jeong in Journal of Semantics 38(1):49–94, 2020). Based on a treatment of HNQs as denoting unbalanced partitions (Romero and Han in Linguistics and Philosophy 27(5):609–658, 2004), and competition with their positive polar question alternatives, I propose a novel derivation of speaker bias in HNQs as a conversational implicature. Roughly, if the speaker is ignorant, then a positive polar question will be more useful because it is more informative, so the use of an HNQ conveys that the speaker is not ignorant. The denotation of the HNQ then makes clear which way the speaker is biased. The result separates high negation from verum focus, and I argue that it is more parsimonious and has better empirical coverage than prior accounts.",
      "cited_by_count": 31,
      "type": "article",
      "source": {
        "name": "Natural Language Semantics",
        "type": "journal",
        "issn": [
          "0925-854X",
          "1572-865X"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "hybrid",
        "oa_url": "https://link.springer.com/content/pdf/10.1007/s11050-022-09198-2.pdf"
      },
      "topics": [
        "Language, Discourse, Communication Strategies",
        "Syntax, Semantics, Linguistic Variation",
        "Discourse Analysis in Language Studies"
      ],
      "referenced_works_count": 59,
      "url": "https://openalex.org/W4311810268"
    },
    {
      "openalex_id": "W3111932118",
      "doi": "10.1017/s0022226720000316",
      "title": "On the nature of the lexicon: The status of rich lexical meanings",
      "authors": [
        {
          "name": "Lotte Hogeweg",
          "openalex_id": "A5053656188",
          "orcid": "https://orcid.org/0000-0002-9300-0258",
          "institutions": [
            "Radboud University Nijmegen"
          ]
        },
        {
          "name": "Agustí­n Vicente",
          "openalex_id": "A5066417451",
          "orcid": "https://orcid.org/0000-0002-5331-5546"
        }
      ],
      "publication_year": 2020,
      "publication_date": "2020-11-01",
      "abstract": "Both in linguistics and in psycholinguistics there is some debate about how rich or thin lexico-semantic representations are. Traditionally, in formal semantics but also in philosophy of language as well as in cognitive pragmatics, lexical meanings have been thought to be simple stable denotations or functions. In this paper, we present and discuss a number of interpretational phenomena of which the analysis proposed in the literature makes crucial use of rich meanings. The phenomena in question are cases where the assignment of truth-conditional contents to utterances seems to follow rules that do not operate on simple stable denotations or any other kind of ‘thin’ meanings but where composition takes rich structured representations as input. We also discuss problems for such accounts, which are mostly based on the inability of extant rich meanings accounts to explain many other interpretational phenomena, and we discuss the solutions that have been proposed to solve them. Furthermore, we address the discussion whether the informationally rich meanings are part of semantics, and more specifically part of the lexicon, or whether this information should be ascribed to more general world knowledge.",
      "cited_by_count": 15,
      "type": "article",
      "source": {
        "name": "Journal of Linguistics",
        "type": "journal",
        "issn": [
          "0022-2267",
          "1469-7742"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "hybrid",
        "oa_url": "https://www.cambridge.org/core/services/aop-cambridge-core/content/view/67AF296146D8A085760107D1A8CD329F/S0022226720000316a.pdf/div-class-title-on-the-nature-of-the-lexicon-the-status-of-rich-lexical-meanings-div.pdf"
      },
      "topics": [
        "Syntax, Semantics, Linguistic Variation",
        "Language, Metaphor, and Cognition",
        "linguistics and terminology studies"
      ],
      "referenced_works_count": 98,
      "url": "https://openalex.org/W3111932118"
    },
    {
      "openalex_id": "W3089039732",
      "doi": "10.1162/coli_r_00271",
      "title": "Elements of Formal Semantics: An Introduction to the Mathematical Theory of Meaning in Natural Language",
      "authors": [
        {
          "name": "Michael Yoshitaka Erlewine",
          "openalex_id": "A5058305150",
          "orcid": "https://orcid.org/0000-0003-2727-8507",
          "institutions": [
            "National University of Singapore"
          ]
        }
      ],
      "publication_year": 2016,
      "publication_date": "2016-09-28",
      "abstract": "Yoad Winter's Elements of Formal Semantics is a lucid, well-organized, rather concise, and opinionated introductory textbook of formal natural language semantics. “Formal semantics” here refers to the study of sentence meaning and its tight connection to sentence structure, described with precision using mathematical methods. Elements introduces the central questions, concerns, and techniques of formal semantics, motivated by discussion of successively more complex phenomena in English. The end result presented is a particular flavor of categorial or type-logical grammar.Elements is organized as a textbook and I think this certainly will be its primary use. The book claims to “not presuppose any prior knowledge in logic or theoretical linguistics” (p. 7). It would be appropriate for a first course in semantics at the graduate or upper undergraduate level. In addition to linguistics programs, the book would be an excellent text for courses on natural language meaning and related topics in computer science, artificial intelligence, or philosophy—and in fact, the required level of fluency with mathematical notation and symbolic manipulation may make it more suited to such students, at least at the undergraduate level. This is not a text introducing computational semantics and there is no discussion of practical implementation details. In addition to its primary use as a textbook, this coverage of key topics makes the book a useful primer to the central concerns and results of formal semantics for researchers in a range of closely related disciplines.The 200-odd-page body of the text is organized into five core chapters, sandwiched between brief introduction and conclusion chapters. After the introductory chapter, Chapter 2 introduces us to the study of sentence meaning using judgments of entailment between sentences as the main source of evidence. In a sleight of hand, Winter introduces the “truth-conditionality criterion” (p. 20)—the central hypothesis that links these intuitive judgments of entailment to abstract models—without introducing or using the notion of a “truth-condition.” The idea of compositionality is introduced, motivated by the study of a toy model of simple copular sentences, negation, and conjunction, with discussion of structural ambiguities.Chapter 3 introduces much of the common technical concepts and notation of formal semantics, including types, (higher-order) functions and sets, Currying, and λ-notation. This chapter is particularly well organized and thought through, introducing these technical notions step by step, with examples and motivation from linguistic phenomena where possible. This chapter is one of the clearest presentations of these tools that I have seen, with the caveat that it presupposes a certain fluency with the underlying mathematical notation and concepts. It concludes with an application of these tools to reflexive pronouns and intersective and non-intersective attributive adjectives, as well as propositional vs. predicate negation and conjunction.Chapter 4 is concerned with the interpretation of quantifiers in natural language. Generalized quantifier theory is discussed, first with descriptions of quantifiers as relations between sets, followed by discussion of quantifiers as sets of predicates. This is followed by clear and rather standard exposition of monotonicity, negative polarity item licensing, the denotation of quantificational determiners, and conservativity.Despite my saying that Chapters 3 and 4 are very clear—or maybe because of this—I want to reiterate again that some hand-holding will be required for students without backgrounds in, for example, mathematics or computer science. Simple familiarity with the basic concepts and notation of sets and functions is in fact insufficient; the reader must be comfortable moving quickly between these characterizations and translating between them. Take for example the discussion of quantificational determiner meanings, where in the span of just three pages (p. 116ff), the text switches between (a) a Curried, higher-order function (a function from predicates to functions from predicates to truth values), (b) a binary function (a function mapping two sets of individuals to truth values), and (c) a relation (a set of pairs of sets of individuals), choosing each formulation where convenient. Typographic conventions do not help the reader, either: Sometimes the variables A and B are functions (as in [4.47a]) and sometimes they are sets (as in [4.47b] right below!). I find these issues unfortunate because it would not have taken an inordinate effort to make these (otherwise great) chapters friendlier towards readers who are less mathematically inclined.I think of Chapter 5, entitled “Long-Distance Meaning Relationships,” as logically two chapters and will discuss them in turn. The first half introduces the process of function abstraction through hypothetical reasoning in the tradition here called the Lambek-Van Benthem Calculus, motivated by the discussion of non-subject quantifiers and relativization. A brief detour introduces the idea of introducing a hypothetical premise φ into a proof of conclusion ψ and then “discharging” φ later, resulting in the conclusion φ → ψ. By analogy, in the computation of many sentences with quantifiers and relativization, we introduce a hypothetical argument (variable) u to yield the u-dependent meaning z, and then later “discharge” the hypothesis of u to yield the function λu . z, abstracting over the value of u. This presentation is friendly and successful. There is no mention of the relation of this process of variable introduction and abstraction to syntactic movement as discussed in much contemporary work on the syntax/semantics interface, save for one brief mention later (p. 175).The second half of Chapter 5 uses questions raised in the first half regarding the relationship between semantics and surface word order as motivation to introduce the framework known as Abstract Categorial Grammar (ACG) or also Lambda Grammar. Under this approach, lexical items (signs) have perceptual denotations that can be (higher-order) functions over strings, not just strings themselves. For example, the transitive verb praise has the perceptual representation λx . λy . y ⋅ praised ⋅ x, where ⋅ is concatenation; this encodes that the first argument of praise will follow the verb in surface word order and its second argument will precede the verb. This treatment of the syntax of word order will strike readers with any previous training to the intricacies and regularities of natural language syntax as terribly naive. But to be fair, these limitations are readily acknowledged by Winter himself:…when we talk about ‘Abstract Categorial Grammar,’ we use the term ‘grammar’ in the sense of a formal grammatical framework, with no pretensions to the wide empirical coverage that we normally expect from grammatical descriptions of natural languages… at present there is no commonly accepted way of embedding ACG within linguistic theory. (p. 167)The chapter ends with discussion and treatment of scope ambiguities.Chapter 6 is an introduction to intensional semantics, motivated by classic problems of sense versus reference. After a brief and approachable survey of intensional contexts, a domain of possible worlds (or indices) is added to our models and individual concepts are introduced, deriving the desired result that Lewis Carroll is C. L. Dodgson and John believes Lewis Carroll wrote Alice does not entail John believes C. L. Dodgson wrote Alice. This is followed by a more general discussion of intensionalization using the ACG type system introduced in Chapter 5. The chapter concludes with de re/de dicto ambiguities and their analysis as scope ambiguities.Finally, Chapter 7 suggests directions for further study, devoting a paragraph each to a range of additional topics in formal semantics. This is followed by a brief appendix to Chapter 3 with formal definitions for the basic typing and interpretation system.Each of the core chapters ends with pointers to recommended further reading, at both introductory and advanced levels, which include key works in linguistics, computer science, and philosophy of language. This is followed by a set of exercises, immediately followed by selected solutions. Some exercises emphasize mechanical practice in engaging with technical notions, some are more conceptual, and some introduce new linguistic phenomena to consider. All are clear and of appropriate difficulty. Some are downright clever, like problems 5 and 6 of Chapter 2 (p. 38ff). The inclusion of selected solutions—just final results, not intermediate steps or detailed justification—will be appreciated by conscientious students and those using the text for self-study.In reading the book as a potential text for students, a few gaps stand out. In Chapter 2, where entailment is given a central role in the empirical investigation of meaning, there is no discussion of presupposition. In fact, the definition of “entailment” (p. 16) as any indefeasible consequence will include both presuppositions and entailments proper. Also missing is discussion of motivation and diagnostics for constituency. Readers with little or no linguistics background would have to simply accept the bracketings and trees given in the text, without reliable tools to work out novel sentences on their own. There is also no discussion of languages other than English. Of course, the methods presented here are broadly applicable to other languages, but in my experience it is worth making this point. Still, at the end of the day, I generally think the choice of concepts and topics covered is good, as is their depth.The physical book (I reviewed the paperback) is relatively compact, with nice, large text. The prose feels mature and well edited, with just a small handful of typos.Overall, Elements is a generally clear, precise, and friendly introduction to formal natural language semantics for students with mathematical maturity. I recommend it.",
      "cited_by_count": 11,
      "type": "article",
      "source": {
        "name": "Computational Linguistics",
        "type": "journal",
        "issn": [
          "0891-2017",
          "1530-9312"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "bronze",
        "oa_url": "https://www.mitpressjournals.org/doi/pdf/10.1162/COLI_r_00271"
      },
      "topics": [
        "Rough Sets and Fuzzy Logic",
        "linguistics and terminology studies",
        "Semantic Web and Ontologies"
      ],
      "referenced_works_count": 0,
      "url": "https://openalex.org/W3089039732"
    },
    {
      "openalex_id": "W1486987526",
      "doi": null,
      "title": "Parts of a Whole: Distributivity as a Bridge between Aspect and Measurement",
      "authors": [
        {
          "name": "Lucas Champollion",
          "openalex_id": "A5008601410",
          "orcid": "https://orcid.org/0000-0002-4544-5113"
        }
      ],
      "publication_year": 2017,
      "publication_date": "2017-03-09",
      "abstract": "Why can I tell you that I ran for five minutes but not that I *ran to the store for five minutes? Why can you say that there are five pounds of books in this package if it contains several books, but not *five pounds of book if it contains only one? What keeps you from using *sixty degrees of water to tell me the temperature of the water in your pool when you can use sixty inches of water to tell me its height? And what goes wrong when I complain that *all the ants in my kitchen are numerous?\\nThe constraints on these constructions involve concepts that are generally studied separately: aspect, plural and mass reference, measurement, and distributivity. This work provides a unified perspective on these domains, connects them formally within the framework of mereological semantics, and uses this connection to transfer insights across unrelated bodies of literature. A generalized notion of distributivity is proposed and formalized as a parametrized higher-order property called stratified reference: a predicate that holds of a certain entity or event is required to also hold of its parts along a certain dimension and down to a certain granularity. The dimension parameter is a thematic role in the case of each and all, a measure function in the case of pseudopartitives, and time or space in the case of for-adverbials. The granularity parameter involves pure atoms in the case of each, pure and impure atoms in the case of all, and very small amounts of space, time, or matter in the cases of pseudopartitives and for-adverbials. Stratified reference is used to formulate a single constraint that explains each of the judgments above. The constraint is exploited to improve on existing characterizations of distributivity, atelicity, and monotonicity of measurement.\\nThe framework results in a new take on the minimal-parts problem that occurs in the study of atelic predicates and mass terms. It scales up successfully from temporal to spatial aspect, and it explains why pseudopartitives and other distributive constructions are sensitive to the difference between intensive and extensive measure functions. It provides a fresh view on atomic and cover-based theories of quantificational distributivity. The framework is also used to account for the scopal behavior of all and of for-adverbials with respect to cumulative quantification and dependent plurals. Together with a novel theory of collective predication, the framework also provides an account of the differences between such predicates as be numerous and gather as they interact with all.",
      "cited_by_count": 246,
      "type": "book",
      "source": {
        "name": "ScholarlyCommons (University of Pennsylvania)",
        "type": "repository",
        "issn": null
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "green",
        "oa_url": "https://repository.upenn.edu/edissertations/958"
      },
      "topics": [
        "Syntax, Semantics, Linguistic Variation",
        "Logic, Reasoning, and Knowledge",
        "Advanced Algebra and Logic"
      ],
      "referenced_works_count": 160,
      "url": "https://openalex.org/W1486987526"
    },
    {
      "openalex_id": "W2120958459",
      "doi": "10.1075/prag.10.4.02ver",
      "title": "Notes on the role of metapragmatic awareness in language use",
      "authors": [
        {
          "name": "Jef Verschueren",
          "openalex_id": "A5086067960",
          "orcid": "https://orcid.org/0000-0002-4120-9068"
        }
      ],
      "publication_year": 2015,
      "publication_date": "2015-02-18",
      "abstract": "Against the background of a general theory of pragmatics, reflections are formulated on the central role of metapragmatic awareness as a specific manifestation of salience, the status of processes of meaning generation in language use in relation to the cognitive apparatus. First the notions of metalanguage and metapragmatics, as used in linguistics, are discussed. Then metalinguistic and metapragmatic phenomena are presented as reflections of metapragmatic awareness. Two ways in which indicators of metapragmatic awareness function in language use are distinguished: Their functioning as anchoring devices locating linguistic form in relation to context, and their functioning as signals of the language users’ reflexive interpretations of the activities they are engaged in. Finally, some social implications of metapragmatic functioning are discussed, in particular in relation to language ideologies and identity construction.",
      "cited_by_count": 326,
      "type": "article",
      "source": {
        "name": "Pragmatics Quarterly Publication of the International Pragmatics Association (IPrA)",
        "type": "journal",
        "issn": [
          "1018-2101",
          "2406-4238"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "bronze",
        "oa_url": "https://www.jbe-platform.com/deliver/fulltext/prag.10.4.02ver.pdf?itemId=%2Fcontent%2Fjournals%2F10.1075%2Fprag.10.4.02ver&mimeType=pdf&containerItemId=content/journals/24064238"
      },
      "topics": [
        "Language, Discourse, Communication Strategies",
        "EFL/ESL Teaching and Learning",
        "Discourse Analysis in Language Studies"
      ],
      "referenced_works_count": 47,
      "url": "https://openalex.org/W2120958459"
    },
    {
      "openalex_id": "W2607892599",
      "doi": "10.18653/v1/n18-1101",
      "title": "A Broad-Coverage Challenge Corpus for Sentence Understanding through Inference",
      "authors": [
        {
          "name": "Adina Williams",
          "openalex_id": "A5062696000",
          "orcid": "https://orcid.org/0000-0001-5281-3343",
          "institutions": [
            "Shandong University of Political Science and Law",
            "University of Applied Sciences and Arts of Southern Switzerland",
            "New York University",
            "Supélec"
          ]
        },
        {
          "name": "Nikita Nangia",
          "openalex_id": "A5013626682",
          "institutions": [
            "Shandong University of Political Science and Law",
            "University of Applied Sciences and Arts of Southern Switzerland",
            "New York University",
            "Supélec"
          ]
        },
        {
          "name": "Samuel R. Bowman",
          "openalex_id": "A5112713734",
          "institutions": [
            "New York University"
          ]
        }
      ],
      "publication_year": 2018,
      "publication_date": "2018-01-01",
      "abstract": "This paper introduces the Multi-Genre Natural Language Inference (MultiNLI) corpus, a dataset designed for use in the development and evaluation of machine learning models for sentence understanding. In addition to being one of the largest corpora available for the task of NLI, at 433k examples, this corpus improves upon available resources in its coverage: it offers data from ten distinct genres of written and spoken English--making it possible to evaluate systems on nearly the full complexity of the language--and it offers an explicit setting for the evaluation of cross-genre domain adaptation.",
      "cited_by_count": 325,
      "type": "preprint",
      "source": null,
      "open_access": {
        "is_oa": true,
        "oa_status": "gold",
        "oa_url": "https://www.aclweb.org/anthology/N18-1101.pdf"
      },
      "topics": [
        "Natural Language Processing Techniques",
        "Topic Modeling",
        "Text Readability and Simplification"
      ],
      "referenced_works_count": 34,
      "url": "https://openalex.org/W2607892599"
    },
    {
      "openalex_id": "W4285161341",
      "doi": "10.1007/978-3-031-08020-3",
      "title": "The Road to General Intelligence",
      "authors": [
        {
          "name": "Jerry Swan",
          "openalex_id": "A5037668386",
          "orcid": "https://orcid.org/0000-0003-1944-7147",
          "institutions": [
            "University of York"
          ]
        },
        {
          "name": "Eric Nivel",
          "openalex_id": "A5033135853"
        },
        {
          "name": "Neel Kant",
          "openalex_id": "A5044949020",
          "institutions": [
            "Nvidia (United States)"
          ]
        },
        {
          "name": "Jules Hedges",
          "openalex_id": "A5085985351",
          "institutions": [
            "University of Strathclyde"
          ]
        },
        {
          "name": "Timothy Atkinson",
          "openalex_id": "A5003194107",
          "orcid": "https://orcid.org/0000-0002-5036-3358"
        },
        {
          "name": "Bas R. Steunebrink",
          "openalex_id": "A5014269289",
          "institutions": [
            "Dalle Molle Institute for Artificial Intelligence Research"
          ]
        }
      ],
      "publication_year": 2022,
      "publication_date": "2022-01-01",
      "abstract": "Humans have always dreamed of automating laborious physical and intellectual tasks, but the latter has proved more elusive than naively suspected. Seven decades of systematic study of Artificial Intelligence have witnessed cycles of hubris and despair. The successful realization of General Intelligence (evidenced by the kind of cross-domain flexibility enjoyed by humans) will spawn an industry worth billions and transform the range of viable automation tasks.The recent notable successes of Machine Learning has lead to conjecture that it might be the appropriate technology for delivering General Intelligence. In this book, we argue that the framework of machine learning is fundamentally at odds with any reasonable notion of intelligence and that essential insights from previous decades of AI research are being forgotten. We claim that a fundamental change in perspective is required, mirroring that which took place in the philosophy of science in the mid 20th century. We propose a framework for General Intelligence, together with a reference architecture that emphasizes the need for anytime bounded rationality and a situated denotational semantics. We given necessary emphasis to compositional reasoning, with the required compositionality being provided via principled symbolic-numeric inference mechanisms based on universal constructions from category theory. • Details the pragmatic requirements for real-world General Intelligence. • Describes how machine learning fails to meet these requirements. • Provides a philosophical basis for the proposed approach. • Provides mathematical detail for a reference architecture. • Describes a research program intended to address issues of concern in contemporary AI. The book includes an extensive bibliography, with ~400 entries covering the history of AI and many related areas of computer science and mathematics.The target audience is the entire gamut of Artificial Intelligence/Machine Learning researchers and industrial practitioners. There are a mixture of descriptive and rigorous sections, according to the nature of the topic. Undergraduate mathematics is in general sufficient. Familiarity with category theory is advantageous for a complete understanding of the more advanced sections, but these may be skipped by the reader who desires an overall picture of the essential concepts This is an open access book.",
      "cited_by_count": 5,
      "type": "book",
      "source": {
        "name": "Studies in computational intelligence",
        "type": "book series",
        "issn": [
          "1860-949X",
          "1860-9503"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "hybrid",
        "oa_url": "https://link.springer.com/content/pdf/10.1007/978-3-031-08020-3.pdf"
      },
      "topics": [
        "History of Computing Technologies"
      ],
      "referenced_works_count": 291,
      "url": "https://openalex.org/W4285161341"
    },
    {
      "openalex_id": "W1913216232",
      "doi": "10.1007/s10988-015-9178-8",
      "title": "Definiteness and determinacy",
      "authors": [
        {
          "name": "Elizabeth Coppock",
          "openalex_id": "A5074610868",
          "orcid": "https://orcid.org/0000-0001-9987-344X",
          "institutions": [
            "Swedish Collegium for Advanced Study",
            "University of Gothenburg"
          ]
        },
        {
          "name": "David Beaver",
          "openalex_id": "A5033853014",
          "orcid": "https://orcid.org/0000-0003-1859-4786",
          "institutions": [
            "The University of Texas at Austin"
          ]
        }
      ],
      "publication_year": 2015,
      "publication_date": "2015-09-02",
      "abstract": null,
      "cited_by_count": 140,
      "type": "article",
      "source": {
        "name": "Linguistics and Philosophy",
        "type": "journal",
        "issn": [
          "0165-0157",
          "1573-0549"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "hybrid",
        "oa_url": "https://link.springer.com/content/pdf/10.1007/s10988-015-9178-8.pdf"
      },
      "topics": [
        "Syntax, Semantics, Linguistic Variation",
        "Logic, Reasoning, and Knowledge",
        "Advanced Algebra and Logic"
      ],
      "referenced_works_count": 91,
      "url": "https://openalex.org/W1913216232"
    },
    {
      "openalex_id": "W2101524978",
      "doi": "10.1146/annurev-linguist-030514-125150",
      "title": "Vagueness and Imprecision: Empirical Foundations",
      "authors": [
        {
          "name": "Stephanie Solt",
          "openalex_id": "A5050212640",
          "orcid": "https://orcid.org/0000-0002-3269-8461",
          "institutions": [
            "Leibniz-Centre General Linguistics"
          ]
        }
      ],
      "publication_year": 2015,
      "publication_date": "2015-01-01",
      "abstract": "Vagueness is a pervasive feature of natural language, which has been studied from a range of perspectives. This review focuses on recent empirical insights into vagueness that have come out of the field of linguistic semantics, as well as the theoretical developments that these have prompted. Topics covered include the distinction between vagueness and imprecision, or what I refer to as Type 1 and Type 2 vagueness; the complex manifestations of vagueness in the adjectival domain; and recent experimental findings regarding “ordinary” speakers’ use and interpretation of vague language. Also briefly discussed is the broader question of why language is vague.",
      "cited_by_count": 162,
      "type": "article",
      "source": {
        "name": "Annual Review of Linguistics",
        "type": "journal",
        "issn": [
          "2333-9683",
          "2333-9691"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "bronze",
        "oa_url": "https://www.annualreviews.org/doi/pdf/10.1146/annurev-linguist-030514-125150"
      },
      "topics": [
        "Advanced Algebra and Logic",
        "Rough Sets and Fuzzy Logic",
        "Multi-Criteria Decision Making"
      ],
      "referenced_works_count": 114,
      "url": "https://openalex.org/W2101524978"
    },
    {
      "openalex_id": "W3114991630",
      "doi": "10.1111/mila.12328",
      "title": "Polysemy and thought: Toward a generative theory of concepts",
      "authors": [
        {
          "name": "Jake Quilty‐Dunn",
          "openalex_id": "A5051377046",
          "orcid": "https://orcid.org/0000-0002-4642-8008",
          "institutions": [
            "Washington University in St. Louis"
          ]
        }
      ],
      "publication_year": 2020,
      "publication_date": "2020-12-27",
      "abstract": "Most theories of concepts take concepts to be structured bodies of information used in categorization and inference. This paper argues for a version of atomism, on which concepts are unstructured symbols. However, traditional Fodorian atomism is falsified by polysemy and fails to provide an account of how concepts figure in cognition. This paper argues that concepts are generative pointers, that is, unstructured symbols that point to memory locations where cognitively useful bodies of information are stored and can be deployed to resolve polysemy. The notion of generative pointers allows for unresolved ambiguity in thought and provides a basis for conceptual engineering.",
      "cited_by_count": 115,
      "type": "article",
      "source": {
        "name": "Mind & Language",
        "type": "journal",
        "issn": [
          "0268-1064",
          "1468-0017"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "hybrid",
        "oa_url": "https://onlinelibrary.wiley.com/doi/pdfdirect/10.1111/mila.12328"
      },
      "topics": [
        "Language and cultural evolution",
        "Child and Animal Learning Development",
        "Cognitive Science and Education Research"
      ],
      "referenced_works_count": 187,
      "url": "https://openalex.org/W3114991630"
    },
    {
      "openalex_id": "W2477283024",
      "doi": "10.17684/i4a53en",
      "title": "Prospects and problems of prototype theory",
      "authors": [
        {
          "name": "Dirk Geeraerts",
          "openalex_id": "A5066176620",
          "orcid": "https://orcid.org/0000-0001-6350-0588",
          "institutions": [
            "KU Leuven"
          ]
        }
      ],
      "publication_year": 2016,
      "publication_date": "2016-07-31",
      "abstract": "Parallel to the research that I did on the application of prototype theory to questions of semantic change (which eventually resulted in my Diachronic Prototype Semantics monograph of 1997), I paid attention on a number of occasions to the theoretical clarification of the notion of prototypicality as such (and of the related notion of polysemy: see the second section of this collection). In the paper reprinted here, I try to bring some systematicity into the many uses of the concept ‘prototypicality’ by distinguishing between two cross-classifying dimensions. First, I make a distinction between two crucial structural phenomena underlying prototypicality effects: flexibility (i.e. the absence of clear boundaries and demarcations) and salience (i.e. differences of structural weight). Second, I suggest that both prototypicality phenomena may be found on an intensional level (the level of definitions) and on an extensional level (the level of referents). The cross-classification of the two dimensions defines four basic types of prototypicality effects.",
      "cited_by_count": 131,
      "type": "article",
      "source": {
        "name": "Diacronia",
        "type": "journal",
        "issn": [
          "2393-1140"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "diamond",
        "oa_url": "https://www.diacronia.ro/en/journal/issue/4/A53/en/pdf"
      },
      "topics": [
        "Categorization, perception, and language",
        "Language, Metaphor, and Cognition",
        "Syntax, Semantics, Linguistic Variation"
      ],
      "referenced_works_count": 58,
      "url": "https://openalex.org/W2477283024"
    },
    {
      "openalex_id": "W2782920707",
      "doi": "10.3765/salt.v27i0.4155",
      "title": "Rhetorical questions: Severing asking from questioning",
      "authors": [
        {
          "name": "María Biezma",
          "openalex_id": "A5081361645",
          "institutions": [
            "University of Konstanz"
          ]
        },
        {
          "name": "Kyle Rawlins",
          "openalex_id": "A5028288589",
          "institutions": [
            "Johns Hopkins University"
          ]
        }
      ],
      "publication_year": 2017,
      "publication_date": "2017-12-15",
      "abstract": "Rhetorical questions (RhQs) are puzzling for theoretical accounts of questions: while they have an interrogative form, they seem to provide the same information as a parallel assertion. We propose that solving this puzzle requires a deeper understanding of the dynamics of interrogative utterances, and in particular we argue for a dynamics parallel to what has recently been proposed for assertions and imperatives: uttering an interrogative is a proposal to update the context, in this case the QUD, and its acceptance leads to the final inquisitive update. We argue that RhQs are interrogatives triggering the presupposition that the context entails the answer, so if accepted as a QUD, they would be immediately answered. This, in combination with the dynamics we develop, allows us to explain both the similarities with assertions as well as the differences in their discourse function.",
      "cited_by_count": 140,
      "type": "article",
      "source": {
        "name": "Proceedings from Semantics and Linguistic Theory",
        "type": "journal",
        "issn": [
          "2163-5943",
          "2163-5951"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "diamond",
        "oa_url": "https://journals.linguisticsociety.org/proceedings/index.php/SALT/article/download/27.302/3859"
      },
      "topics": [
        "Language, Discourse, Communication Strategies",
        "Language, Metaphor, and Cognition"
      ],
      "referenced_works_count": 26,
      "url": "https://openalex.org/W2782920707"
    },
    {
      "openalex_id": "W2410362857",
      "doi": "10.3765/sp.9.15",
      "title": "Covert distributivity in algebraic event semantics",
      "authors": [
        {
          "name": "Lucas Champollion",
          "openalex_id": "A5008601410",
          "orcid": "https://orcid.org/0000-0002-4544-5113",
          "institutions": [
            "New York University"
          ]
        }
      ],
      "publication_year": 2016,
      "publication_date": "2016-06-03",
      "abstract": "This is the first in a pair of papers that aim to provide a comprehensive analysis of the semantic phenomenon of distributivity in natural language. This paper investigates and formalizes different sources of covert distributivity. Apart from lexical distributivity effects, which are modeled by meaning postulates, phrasal distributivity is captured via two covert operators: (i) a D operator distributing over atoms only (Link 1987), and (ii) a cover-based Part operator, which can also distribute over nonatomic pluralities under contextual licensing (Schwarzschild 1996). The resulting theory surpasses accounts in which nonatomic distributivity is freely available, or not available at all; furthermore, it correctly predicts differences between lexical and phrasal nonatomic distributivity. D and Part are reformulated in Neo-Davidsonian algebraic event semantics, so that they apply to event predicates and make the sum event available for further modification by arguments and adjuncts. This paves the way for an account of the context-dependency of distributivity phenomena under for-adverbials, which improves on theories that predict indefinites to either always or never covary with for-adverbials. The paper and its companion include an explicit proposal for the compositional process in event semantics. BibTeX info",
      "cited_by_count": 105,
      "type": "article",
      "source": {
        "name": "Semantics and Pragmatics",
        "type": "journal",
        "issn": [
          "1937-8912"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "diamond",
        "oa_url": "https://semprag.org/index.php/sp/article/download/sp.9.15/pdf"
      },
      "topics": [
        "Logic, Reasoning, and Knowledge",
        "Semantic Web and Ontologies",
        "Access Control and Trust"
      ],
      "referenced_works_count": 153,
      "url": "https://openalex.org/W2410362857"
    },
    {
      "openalex_id": "W2302963717",
      "doi": "10.1162/tacl_a_00088",
      "title": "Transforming Dependency Structures to Logical Forms for Semantic Parsing",
      "authors": [
        {
          "name": "Siva Reddy",
          "openalex_id": "A5102886212",
          "institutions": [
            "University of Edinburgh"
          ]
        },
        {
          "name": "Oscar Täckström",
          "openalex_id": "A5087735236",
          "institutions": [
            "Google (United States)"
          ]
        },
        {
          "name": "Michael Collins",
          "openalex_id": "A5079061237",
          "orcid": "https://orcid.org/0000-0003-0997-1527",
          "institutions": [
            "Google (United States)"
          ]
        },
        {
          "name": "Tom Kwiatkowski",
          "openalex_id": "A5011150187",
          "institutions": [
            "Google (United States)"
          ]
        },
        {
          "name": "Dipanjan Das",
          "openalex_id": "A5021055773",
          "orcid": "https://orcid.org/0000-0003-2325-0646",
          "institutions": [
            "Google (United States)"
          ]
        },
        {
          "name": "Mark Steedman",
          "openalex_id": "A5055023881",
          "orcid": "https://orcid.org/0000-0003-2509-0797",
          "institutions": [
            "University of Edinburgh"
          ]
        },
        {
          "name": "Mirella Lapata",
          "openalex_id": "A5041024491",
          "orcid": "https://orcid.org/0000-0002-2107-1516",
          "institutions": [
            "University of Edinburgh"
          ]
        }
      ],
      "publication_year": 2016,
      "publication_date": "2016-12-01",
      "abstract": "The strongly typed syntax of grammar formalisms such as CCG, TAG, LFG and HPSG offers a synchronous framework for deriving syntactic structures and semantic logical forms. In contrast—partly due to the lack of a strong type system—dependency structures are easy to annotate and have become a widely used form of syntactic analysis for many languages. However, the lack of a type system makes a formal mechanism for deriving logical forms from dependency structures challenging. We address this by introducing a robust system based on the lambda calculus for deriving neo-Davidsonian logical forms from dependency trees. These logical forms are then used for semantic parsing of natural language to Freebase. Experiments on the Free917 and Web-Questions datasets show that our representation is superior to the original dependency trees and that it outperforms a CCG-based representation on this task. Compared to prior work, we obtain the strongest result to date on Free917 and competitive results on WebQuestions.",
      "cited_by_count": 159,
      "type": "article",
      "source": {
        "name": "Transactions of the Association for Computational Linguistics",
        "type": "journal",
        "issn": [
          "2307-387X"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "diamond",
        "oa_url": "http://www.mitpressjournals.org/doi/pdf/10.1162/tacl_a_00088"
      },
      "topics": [
        "Natural Language Processing Techniques",
        "Topic Modeling",
        "Software Engineering Research"
      ],
      "referenced_works_count": 70,
      "url": "https://openalex.org/W2302963717"
    },
    {
      "openalex_id": "W2887626589",
      "doi": "10.1093/jos/ffy014",
      "title": "The Anatomy of a Comparative Illusion",
      "authors": [
        {
          "name": "Alexis Wellwood",
          "openalex_id": "A5009190786",
          "orcid": "https://orcid.org/0000-0002-4258-3895"
        },
        {
          "name": "Roumyana Pancheva",
          "openalex_id": "A5079681519"
        },
        {
          "name": "Valentine Hacquard",
          "openalex_id": "A5002710204",
          "orcid": "https://orcid.org/0000-0003-3854-0312"
        },
        {
          "name": "Colin Phillips",
          "openalex_id": "A5016723264",
          "orcid": "https://orcid.org/0000-0002-3886-3384"
        }
      ],
      "publication_year": 2018,
      "publication_date": "2018-07-16",
      "abstract": "Comparative constructions like More people have been to Russia than I have are reported to be acceptable and meaningful by native speakers of English; yet, upon closer reflection, they are judged to be incoherent. This mismatch between initial perception and more considered judgment challenges the idea that we perceive sentences veridically, and interpret them fully; it is thus potentially revealing about the relationship between grammar and language processing. This paper presents the results of the first detailed investigation of these so-called 'comparative illusions'. We test four hypotheses about their source: a shallow syntactic parser, some type of repair by ellipsis, an incorrectly-resolved lexical ambiguity, or a persistent event comparison interpretation. Two formal acceptability studies show that speakers are most prone to the illusion when the matrix clause supports an event comparison reading. A verbatim recall task tests and finds evidence for such construals in speakers' recollections of the sentences. We suggest that this reflects speakers' entertaining an interpretation that is initially consistent with the sentence, but failing to notice when this interpretation becomes unavailable at the than-clause. In particular, semantic knowledge blinds people to an illicit operator-variable configuration in the syntax. Rather than illustrating processing in the absence of grammatical analysis, comparative illusions thus underscore the importance of syntactic and semantic rules in sentence processing.",
      "cited_by_count": 168,
      "type": "article",
      "source": {
        "name": "Journal of Semantics",
        "type": "journal",
        "issn": [
          "0167-5133",
          "1477-4593"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "bronze",
        "oa_url": "https://academic.oup.com/jos/article-pdf/35/3/543/27083980/ffy014.pdf"
      },
      "topics": [
        "Neurobiology of Language and Bilingualism",
        "Syntax, Semantics, Linguistic Variation",
        "Language, Metaphor, and Cognition"
      ],
      "referenced_works_count": 56,
      "url": "https://openalex.org/W2887626589"
    },
    {
      "openalex_id": "W1941814675",
      "doi": "10.3765/sp.8.10",
      "title": "A \"de-Fregean\" semantics (and neo-Gricean pragmatics) for modified and unmodified numerals",
      "authors": [
        {
          "name": "Christopher Kennedy",
          "openalex_id": "A5007504592",
          "orcid": "https://orcid.org/0000-0002-9605-8308",
          "institutions": [
            "University of Chicago"
          ]
        }
      ],
      "publication_year": 2015,
      "publication_date": "2015-05-13",
      "abstract": "A challenge for the semantic and pragmatic analysis of modified numerals is how to account for ignorance implications about exact quantity. Superlative-modified numerals (<em>at least/most six</em>) systematically give rise to such implications while their comparative-modified counterparts (<em>more/fewer than sixggy</em>) do not, but the distribution of ignorance implications with superlative modifiers is sensitive to how the numeral interacts with modals and other operators. In this paper, I demonstrate that a &quot;de-Fregean&quot; semantic analysis of modified and unmodified numerals as second-order properties of degrees that differ only in the kind of ordering relation they introduce supports a neo-Gricean pragmatic account of ignorance implications as Quantity implicatures, and derives the pattern of interaction with modals as a scopal phenomenon. http://dx.doi.org/10.3765/sp.8.10 <a href=\"http://semantics-online.org/sp-bib/kennedy-2015-defregean.bib\">BibTeX info</a>",
      "cited_by_count": 110,
      "type": "article",
      "source": {
        "name": "Semantics and Pragmatics",
        "type": "journal",
        "issn": [
          "1937-8912"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "diamond",
        "oa_url": "https://semprag.org/index.php/sp/article/download/sp.8.10/pdf_8_10"
      },
      "topics": [
        "Syntax, Semantics, Linguistic Variation",
        "Advanced Algebra and Logic",
        "Logic, Reasoning, and Knowledge"
      ],
      "referenced_works_count": 58,
      "url": "https://openalex.org/W1941814675"
    },
    {
      "openalex_id": "W2145060083",
      "doi": "10.1353/lan.2015.0047",
      "title": "Semantic variation and the grammar of property concepts",
      "authors": [
        {
          "name": "Itamar Francez",
          "openalex_id": "A5040629994"
        },
        {
          "name": "Andrew Koontz‐Garboden",
          "openalex_id": "A5061522229"
        }
      ],
      "publication_year": 2015,
      "publication_date": "2015-09-01",
      "abstract": "This article discusses the effects of variation in the meaning of property concept (PC) lexemes (Dixon 1982) on the form of predicative and comparative constructions. We demonstrate the existence of two kinds of PC lexeme, which differ systematically in how they participate in constructions expressing the truth conditions of PC predication. The first kind of lexeme is used in canonical predicative constructions, the other in predicative constructions that invoke possessive morphology or syntax. The differences between the two classes are observable both within a single language and crosslinguistically. The article argues that the morphosyntactic differences in the behavior of the two lexeme types are predictable from their lexical semantics. Specifically, we argue that some PC lexemes denote mass substances (in a technical sense) and therefore require possessive semantics to achieve the relevant truth conditions. A semantic theory for substance-denoting lexemes is developed, and a compositional analysis of the relevant constructions is presented for Ulwa, an endangered Misumalpan language of Nicaragua. We argue that assuming semantic variation is necessary, since the observed generalizations cannot be captured by extending existing semantic analyses of gradable adjectives to all PC lexemes.",
      "cited_by_count": 95,
      "type": "article",
      "source": {
        "name": "Language",
        "type": "journal",
        "issn": [
          "0097-8507",
          "1535-0665"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "bronze",
        "oa_url": "https://muse.jhu.edu/pub/24/article/593269"
      },
      "topics": [
        "Syntax, Semantics, Linguistic Variation",
        "Language, Metaphor, and Cognition",
        "Linguistics and Discourse Analysis"
      ],
      "referenced_works_count": 77,
      "url": "https://openalex.org/W2145060083"
    },
    {
      "openalex_id": "W2343329509",
      "doi": "10.3765/sp.9.3",
      "title": "Focus fronting, unexpectedness, and evaluative implicatures",
      "authors": [
        {
          "name": "Valentina Bianchi",
          "openalex_id": "A5000284807",
          "orcid": "https://orcid.org/0000-0002-4441-063X",
          "institutions": [
            "University of Siena"
          ]
        },
        {
          "name": "Giuliano Bocci",
          "openalex_id": "A5038125761",
          "orcid": "https://orcid.org/0000-0002-3800-8249",
          "institutions": [
            "University of Geneva"
          ]
        },
        {
          "name": "Silvio Cruschina",
          "openalex_id": "A5009934731",
          "orcid": "https://orcid.org/0000-0002-8082-8232",
          "institutions": [
            "University of Vienna"
          ]
        }
      ],
      "publication_year": 2016,
      "publication_date": "2016-04-27",
      "abstract": "This paper discusses the fronting of a focal constituent to a clause- initial position which, in various languages, is associated with an import of unexpectedness. We provide prosodic and syntactic evidence from Italian showing that this phenomenon has distinctive grammatical properties with respect to other instances of “focus fronting”. We argue that the fronted constituent bears narrow focus, and that the unexpectedness import conveys that the asserted proposition is less likely than one or more distinct focus alternatives (see Grosz 2011). We characterize this import as a conventional implicature, and we argue that likelihood is interpreted with respect to an informative modal base which is shared by the conversational community (the context set). We show that the unexpectedness import expressed by a speaker can be accepted or rejected by the other discourse participants: thus, it qualifies as an evaluative commitment of the speaker and, when accepted by the interlocutors, it can give rise to a shared evaluation.",
      "cited_by_count": 145,
      "type": "article",
      "source": {
        "name": "Semantics and Pragmatics",
        "type": "journal",
        "issn": [
          "1937-8912"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "diamond",
        "oa_url": "https://semprag.org/index.php/sp/article/download/sp.9.3/pdf"
      },
      "topics": [
        "Phonetics and Phonology Research",
        "Linguistic Studies and Language Acquisition",
        "Syntax, Semantics, Linguistic Variation"
      ],
      "referenced_works_count": 61,
      "url": "https://openalex.org/W2343329509"
    },
    {
      "openalex_id": "W3096780468",
      "doi": "10.1111/mila.12329",
      "title": "Polysemy: Pragmatics and sense conventions",
      "authors": [
        {
          "name": "Robyn Carston",
          "openalex_id": "A5091231351",
          "orcid": "https://orcid.org/0000-0003-0820-8968",
          "institutions": [
            "University College London"
          ]
        }
      ],
      "publication_year": 2020,
      "publication_date": "2020-12-31",
      "abstract": "Polysemy, understood as instances of a single linguistic expression having multiple related senses, is not a homogenous phenomenon. There are regular (apparently, rule‐based) cases and irregular (resemblance‐based) cases, which have different processing profiles. Although a primary source of polysemy is pragmatic inference, at least some cases become conventionalised and linguistically encoded. Three main issues are discussed: (a) the key differences between regular and irregular cases and the role, if any, of a “core meaning”; (b) the distinction between pragmatic polysemy and semantic polysemy; and (c) the role of syntactic meaning in both generating and constraining polysemy.",
      "cited_by_count": 157,
      "type": "article",
      "source": {
        "name": "Mind & Language",
        "type": "journal",
        "issn": [
          "0268-1064",
          "1468-0017"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "hybrid",
        "oa_url": "https://onlinelibrary.wiley.com/doi/pdfdirect/10.1111/mila.12329"
      },
      "topics": [
        "Syntax, Semantics, Linguistic Variation",
        "Language, Metaphor, and Cognition",
        "Language, Discourse, Communication Strategies"
      ],
      "referenced_works_count": 86,
      "url": "https://openalex.org/W3096780468"
    },
    {
      "openalex_id": "W3131457744",
      "doi": "10.1016/j.artint.2021.103473",
      "title": "What do we want from Explainable Artificial Intelligence (XAI)? – A stakeholder perspective on XAI and a conceptual model guiding interdisciplinary XAI research",
      "authors": [
        {
          "name": "Markus Langer",
          "openalex_id": "A5038410639",
          "orcid": "https://orcid.org/0000-0002-8165-1803",
          "institutions": [
            "Saarland University"
          ]
        },
        {
          "name": "Daniel Oster",
          "openalex_id": "A5052038529",
          "orcid": "https://orcid.org/0000-0003-2761-6262",
          "institutions": [
            "Saarland University"
          ]
        },
        {
          "name": "Timo Speith",
          "openalex_id": "A5007325624",
          "orcid": "https://orcid.org/0000-0002-6675-154X",
          "institutions": [
            "Saarland University"
          ]
        },
        {
          "name": "Holger Hermanns",
          "openalex_id": "A5028747794",
          "orcid": "https://orcid.org/0000-0002-2766-9615",
          "institutions": [
            "Saarland University",
            "Institute of Software"
          ]
        },
        {
          "name": "Lena Kästner",
          "openalex_id": "A5034952055",
          "orcid": "https://orcid.org/0000-0002-8747-6911",
          "institutions": [
            "Saarland University"
          ]
        },
        {
          "name": "Eva Schmidt",
          "openalex_id": "A5075670033",
          "orcid": "https://orcid.org/0000-0002-7305-7126",
          "institutions": [
            "TU Dortmund University"
          ]
        },
        {
          "name": "Andreas Sesing-Wagenpfeil",
          "openalex_id": "A5027323776",
          "orcid": "https://orcid.org/0000-0003-0894-5407",
          "institutions": [
            "Saarland University"
          ]
        },
        {
          "name": "Kevin Baum",
          "openalex_id": "A5012518399",
          "orcid": "https://orcid.org/0000-0002-6893-573X",
          "institutions": [
            "Saarland University"
          ]
        }
      ],
      "publication_year": 2021,
      "publication_date": "2021-02-15",
      "abstract": null,
      "cited_by_count": 517,
      "type": "article",
      "source": {
        "name": "Artificial Intelligence",
        "type": "journal",
        "issn": [
          "0004-3702",
          "1872-7921"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "bronze",
        "oa_url": "https://www.sciencedirect.com/science/article/pii/S0004370221000242"
      },
      "topics": [
        "Explainable Artificial Intelligence (XAI)",
        "Artificial Intelligence in Healthcare and Education",
        "Ethics and Social Impacts of AI"
      ],
      "referenced_works_count": 325,
      "url": "https://openalex.org/W3131457744"
    },
    {
      "openalex_id": "W2409151533",
      "doi": "10.3765/sp.9.9",
      "title": "Anankastic conditionals are just conditionals",
      "authors": [
        {
          "name": "Peter Klecha",
          "openalex_id": "A5003577296"
        }
      ],
      "publication_year": 2016,
      "publication_date": "2016-06-03",
      "abstract": "This paper presents a relative theory of tense which accounts for tense behaviors in English in both matrix and embedded contexts. Crucial to this proposal is novel data which shows that the temporal orientation of finite embedded clauses is constrained by the attitude verbs which embed them. While such constraints have been observed in modal auxiliaries and non-finite-embedding attitude verbs, finite-embedding-attitudes present an important new perspective because they show that whatever constraints are introduced by the modal must be able to coexist with a tensed prejacent. This proposal is compositional, and a formal analysis is given, by which modals, including attitude verbs, may constrain the temporal possibilities of an embedded clause, without themselves introducing a reference time argument. The constraining effect of attitude verbs also eliminates the need to stipulate a general Upper Limit Constraint, and allows for a means to capture correspondences between modal flavor and temporal orientation. The result is an elegant accounting of embedded tense with empirical coverage superior to previous proposals. http://dx.doi.org/10.3765/sp.9.9 BibTeX info",
      "cited_by_count": 104,
      "type": "article",
      "source": {
        "name": "Semantics and Pragmatics",
        "type": "journal",
        "issn": [
          "1937-8912"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "diamond",
        "oa_url": "https://semprag.org/index.php/sp/article/download/sp.9.9/pdf"
      },
      "topics": [
        "Syntax, Semantics, Linguistic Variation",
        "Linguistic Variation and Morphology",
        "Natural Language Processing Techniques"
      ],
      "referenced_works_count": 49,
      "url": "https://openalex.org/W2409151533"
    },
    {
      "openalex_id": "W2560244435",
      "doi": "10.4148/1944-3676.1107",
      "title": "Iceberg Semantics For Count Nouns And Mass Nouns: Classifiers, measures and portions",
      "authors": [
        {
          "name": "Fred Landman",
          "openalex_id": "A5086261260",
          "institutions": [
            "Tel Aviv University"
          ]
        }
      ],
      "publication_year": 2016,
      "publication_date": "2016-12-08",
      "abstract": "The background for this paper is the framework of Boolean semantics for mass and count nouns, and singular and plural count nouns, as developed from the work of Godehard Link in Link 1983 (see e.g. the expositions in Landman 1991, 2010). Link-style Boolean semantics for nouns (here called Mountain semantics) analyzes the oppositions mass-count and singular-plural in terms of the notion of atomicity: counting is in terms of singular objects, which are taken to be atoms. Consequently, Link bases his semantics on two separate Boolean domains: a non-atomic mass domain and an atomic count domain. Singular count nouns are interpreted as sets of atoms, and semantic plurality is closure under sum, so plural objects are sums of atoms. In this, sorted setup portions - like two portions of soup - are a puzzle: they are mass stuff - soup -, but count - two. But in order to be count they must be atoms. But they are not, because they are just soup. Mountain semantics can deal with portions, but at a cost. In the first part of this paper I outline Iceberg semantics, an alternative to Mountain semantics within the general framework of Boolean semantics. Iceberg semantics specifies a compositional mechanism which associates with the standard denotation of any noun phrase (here called the body) a base set, a set that generates the body under the sum operation ⊔. For count nouns, the base is the set in terms of which the members of the body are counted and to which distribution takes place. In Iceberg semantics, what allows counting to be correct is the requirement on the interpretations of count nouns that the base of their interpretation is (contextually) disjoint. Already at this level we see two salient properties of Iceberg semantics: -Atoms and atomicity play no role in the theory, so we can assume an unsorted interpretation domain for mass nouns and count nouns. In Iceberg semantics, mass and count can be seen as different perspectives on the same stuff (different bases for the same body). This means that we can do away with the extreme body-sorting and body-gridding that atomicity entails. With this we allow a simpler and more elegant analysis of mass-count interactions. For instance, portions can just be 'mass' stuff, evaluated relative to a count base. -The mass-count distinction is formulated in terms of disjointness of the base. Iceberg semantics associates bases not just with the interpretations of lexical nouns, but with NPs in general and with DPs. This means that Iceberg semantics provides a compositional semantic theory of the mass-count distinction, and hence it provides a framework in which the mass-count nature of complex NPs and of DPs can be fruitfully studied. It is the analysis of complex NPs and their mass-count properties that is the focus of the second part of this paper. There I develop an analysis of English and Dutch pseudo- partitives, in particular, measure phrases like three&lt;strong&gt; liters&lt;/strong&gt; of wine and classifier phrases like three &lt;strong&gt;glasses&lt;/strong&gt; of wine. We will study measure interpretations and classifier interpretations of measures and classifiers, and different types of classifier interpretations: container interpretations, contents interpretations, and - indeed - portion interpretations. Rothstein 2011 argues that classifier interpretations (including portion interpretations) of pseudo partitives pattern with count nouns, but that measure interpretations pattern with mass nouns. I will show that this distinction follows from the very basic architecture of Iceberg semantics.",
      "cited_by_count": 96,
      "type": "article",
      "source": {
        "name": "The Baltic International Yearbook of Cognition Logic and Communication",
        "type": "journal",
        "issn": [
          "1944-3676"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "diamond",
        "oa_url": "https://newprairiepress.org/cgi/viewcontent.cgi?article=1107&context=biyclc"
      },
      "topics": [
        "Natural Language Processing Techniques",
        "Advanced Algebra and Logic",
        "Rough Sets and Fuzzy Logic"
      ],
      "referenced_works_count": 12,
      "url": "https://openalex.org/W2560244435"
    },
    {
      "openalex_id": "W2272048879",
      "doi": "10.1016/j.lingua.2015.12.010",
      "title": "The heterogeneity of procedural meaning",
      "authors": [
        {
          "name": "Robyn Carston",
          "openalex_id": "A5091231351",
          "orcid": "https://orcid.org/0000-0003-0820-8968",
          "institutions": [
            "University College London",
            "University of Oslo",
            "Public Library of Science"
          ]
        }
      ],
      "publication_year": 2016,
      "publication_date": "2016-01-25",
      "abstract": null,
      "cited_by_count": 119,
      "type": "article",
      "source": {
        "name": "Lingua",
        "type": "journal",
        "issn": [
          "0024-3841",
          "1872-6135"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "bronze",
        "oa_url": "https://www.sciencedirect.com/science/article/pii/S0024384115002624"
      },
      "topics": [
        "Language, Metaphor, and Cognition",
        "Natural Language Processing Techniques",
        "Syntax, Semantics, Linguistic Variation"
      ],
      "referenced_works_count": 39,
      "url": "https://openalex.org/W2272048879"
    },
    {
      "openalex_id": "W2220833859",
      "doi": "10.1353/lan.2015.0065",
      "title": "Distributional modification: The case of frequency adjectives",
      "authors": [
        {
          "name": "Berit Gehrke",
          "openalex_id": "A5033282356",
          "orcid": "https://orcid.org/0000-0002-6315-9532",
          "institutions": [
            "Pompeu Fabra University",
            "Université Paris Cité",
            "Délégation Paris 7",
            "Centre National de la Recherche Scientifique"
          ]
        },
        {
          "name": "Louise McNally",
          "openalex_id": "A5005432861",
          "orcid": "https://orcid.org/0000-0002-3355-913X",
          "institutions": [
            "Pompeu Fabra University",
            "Centre National de la Recherche Scientifique",
            "Université Paris Cité",
            "Délégation Paris 7"
          ]
        }
      ],
      "publication_year": 2015,
      "publication_date": "2015-12-01",
      "abstract": "We argue that distributional modification is one strategy that language affords for composing propositions about the quantity of entities that participate in a given situation. Distributional modifiers apply to kind descriptions, contributing the entailment that the kind is instantiated by a set of tokens with a particular distribution. As a case study, we analyze frequency adjectives (FAs, e.g. occasional ). We show that previous work, including our own, has suffered for focusing on the paraphrases of FAs rather than on their morphosyntax. We argue for two subclasses of FAs: those that are intersective modifiers sortally restricted to events, and those that are not. The study reinforces two novel theoretical claims in Gehrke &amp; McNally 2011: sometimes kinds are realized by sets of tokens, rather than individual tokens; and some clauses constitute descriptions of event kinds , rather than event tokens .",
      "cited_by_count": 93,
      "type": "article",
      "source": {
        "name": "Language",
        "type": "journal",
        "issn": [
          "0097-8507",
          "1535-0665"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "bronze",
        "oa_url": "https://muse.jhu.edu/pub/24/article/604077"
      },
      "topics": [
        "Syntax, Semantics, Linguistic Variation",
        "Natural Language Processing Techniques",
        "Linguistics and Discourse Analysis"
      ],
      "referenced_works_count": 56,
      "url": "https://openalex.org/W2220833859"
    },
    {
      "openalex_id": "W1855233185",
      "doi": "10.1007/s11229-015-0722-4",
      "title": "A uniform semantics for embedded interrogatives: an answer, not necessarily the answer",
      "authors": [
        {
          "name": "Benjamin Spector",
          "openalex_id": "A5004675499",
          "orcid": "https://orcid.org/0000-0003-0468-5986",
          "institutions": [
            "Université Paris Sciences et Lettres",
            "Institut Jean Nicod",
            "École Normale Supérieure - PSL",
            "Centre National de la Recherche Scientifique"
          ]
        },
        {
          "name": "Paul Égré",
          "openalex_id": "A5090078698",
          "orcid": "https://orcid.org/0000-0002-9114-7686",
          "institutions": [
            "École Normale Supérieure - PSL",
            "Université Paris Sciences et Lettres",
            "Institut Jean Nicod",
            "Centre National de la Recherche Scientifique"
          ]
        }
      ],
      "publication_year": 2015,
      "publication_date": "2015-05-19",
      "abstract": null,
      "cited_by_count": 86,
      "type": "article",
      "source": {
        "name": "Synthese",
        "type": "journal",
        "issn": [
          "0039-7857",
          "1573-0964"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "bronze",
        "oa_url": "https://link.springer.com/content/pdf/10.1007/s11229-015-0722-4.pdf"
      },
      "topics": [
        "Epistemology, Ethics, and Metaphysics",
        "Multi-Agent Systems and Negotiation",
        "Logic, Reasoning, and Knowledge"
      ],
      "referenced_works_count": 62,
      "url": "https://openalex.org/W1855233185"
    },
    {
      "openalex_id": "W3188700141",
      "doi": "10.1007/s10988-016-9195-2",
      "title": "Composing alternatives",
      "authors": [
        {
          "name": "Ivano Ciardelli",
          "openalex_id": "A5057421445",
          "orcid": "https://orcid.org/0000-0001-6152-3401",
          "institutions": [
            "University of Amsterdam"
          ]
        },
        {
          "name": "Floris Roelofsen",
          "openalex_id": "A5033287498",
          "orcid": "https://orcid.org/0000-0002-3224-5251",
          "institutions": [
            "University of Amsterdam"
          ]
        },
        {
          "name": "Nadine Theiler",
          "openalex_id": "A5065121057",
          "orcid": "https://orcid.org/0000-0003-1824-3791",
          "institutions": [
            "University of Amsterdam"
          ]
        }
      ],
      "publication_year": 2016,
      "publication_date": "2016-10-25",
      "abstract": "There is a prominent line of work in natural language semantics, rooted in the work of Hamblin, in which the meaning of a sentence is not taken to be a single proposition, but rather a set of propositions—a set of alternatives. This allows for a more fine-grained view on meaning, which has led to improved analyses of a wide range of linguistic phenomena. However, this approach also faces a number of problems. We focus here on two of these, in our view the most fundamental ones. The first has to do with how meanings are composed, i.e., with the type-theoretic operations of function application and abstraction; the second has to do with how meanings are compared, i.e., the notion of entailment. Our aim is to reconcile what we take to be the essence of Hamblin’s proposal with the more orthodox type-theoretic framework rooted in the work of Montague in such a way that both the explanatory utility of the former and the solid formal foundations of the latter are preserved. Our proposal builds on insights from recent work on inquisitive semantics, and it also contributes to the further development of this framework by specifying how the inquisitive meaning of a sentence may be built up compositionally.",
      "cited_by_count": 77,
      "type": "article",
      "source": {
        "name": "Linguistics and Philosophy",
        "type": "journal",
        "issn": [
          "0165-0157",
          "1573-0549"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "hybrid",
        "oa_url": "https://link.springer.com/content/pdf/10.1007%2Fs10988-016-9195-2.pdf"
      },
      "topics": [
        "Syntax, Semantics, Linguistic Variation",
        "Linguistics and Discourse Analysis",
        "Logic, Reasoning, and Knowledge"
      ],
      "referenced_works_count": 62,
      "url": "https://openalex.org/W3188700141"
    },
    {
      "openalex_id": "W1940322128",
      "doi": "10.3765/salt.v24i0.2446",
      "title": "An alternative theory of imprecision",
      "authors": [
        {
          "name": "Stephanie Solt",
          "openalex_id": "A5050212640",
          "orcid": "https://orcid.org/0000-0002-3269-8461",
          "institutions": [
            "Leibniz-Centre General Linguistics"
          ]
        }
      ],
      "publication_year": 2015,
      "publication_date": "2015-04-05",
      "abstract": "&lt;div class=\"page\" title=\"Page 1\"&gt;&lt;div class=\"layoutArea\"&gt;&lt;div class=\"column\"&gt;&lt;p&gt;&lt;span&gt;Numerical expressions are often used imprecisely or approximately. This paper defends a novel analysis of numerical imprecision based on the notion of scale granularity, construed here in terms of sets of alternatives. I apply this approach to account for new facts relating to the interaction of (im)precision and comparison, in particular the necessarily precise interpretation of measure expressions in compara- tives, and the negative polarity status of overt approximators in comparatives (e.g. &lt;/span&gt;&lt;span&gt;Mabel owns *(no) more than about one hundred sheep.&lt;/span&gt;&lt;span&gt;) &lt;/span&gt;&lt;/p&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;",
      "cited_by_count": 73,
      "type": "article",
      "source": {
        "name": "Proceedings from Semantics and Linguistic Theory",
        "type": "journal",
        "issn": [
          "2163-5943",
          "2163-5951"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "diamond",
        "oa_url": "http://journals.linguisticsociety.org/proceedings/index.php/SALT/article/download/24.514/2434"
      },
      "topics": [
        "Syntax, Semantics, Linguistic Variation"
      ],
      "referenced_works_count": 11,
      "url": "https://openalex.org/W1940322128"
    },
    {
      "openalex_id": "W2133580886",
      "doi": "10.3765/salt.v24i0.2412",
      "title": "Gradable adjectives, vagueness, and optimal language use: A speaker-oriented model",
      "authors": [
        {
          "name": "Ciyang Qing",
          "openalex_id": "A5017209475"
        },
        {
          "name": "Michael Franke",
          "openalex_id": "A5076654614",
          "orcid": "https://orcid.org/0000-0001-9670-8510",
          "institutions": [
            "University of Tübingen"
          ]
        }
      ],
      "publication_year": 2015,
      "publication_date": "2015-04-05",
      "abstract": "&lt;p&gt;This paper addresses two issues that arise in a degree-based approach to the semantics of positive forms of gradable adjectives such as tall in the sentence “John is tall” (e.g., &lt;span&gt;Kennedy &amp;amp; McNally 2005&lt;/span&gt;; &lt;span&gt;Kennedy 2007&lt;/span&gt;): First, how the standard of comparison is contextually determined; Second, why gradable adjectives exhibit the relative-absolute distinction. Combining ideas of previous evolutionary and probabilistic approaches (e.g., &lt;span&gt;Potts 2008&lt;/span&gt;; &lt;span&gt;Franke 2012&lt;/span&gt;; &lt;span&gt;Lassiter 2011&lt;/span&gt;; &lt;span&gt;Lassiter &amp;amp; Goodman 2013&lt;/span&gt;), we propose a new model that makes exact and empirically testable probabilistic predictions about speakers’ use of gradable adjectives and that derives the relative-absolute distinction from considerations of optimal language use. Along the way, we distinguish between vagueness and loose use, and argue that, within our approach, vagueness can be understood as the result of uncertainty about the exact degree distribution within the comparison class.&lt;/p&gt;",
      "cited_by_count": 110,
      "type": "article",
      "source": {
        "name": "Proceedings from Semantics and Linguistic Theory",
        "type": "journal",
        "issn": [
          "2163-5943",
          "2163-5951"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "diamond",
        "oa_url": "http://journals.linguisticsociety.org/proceedings/index.php/SALT/article/download/24.23/2138"
      },
      "topics": [
        "Language and cultural evolution",
        "Natural Language Processing Techniques",
        "Evolutionary Algorithms and Applications"
      ],
      "referenced_works_count": 16,
      "url": "https://openalex.org/W2133580886"
    },
    {
      "openalex_id": "W2612521429",
      "doi": "10.1111/lnc3.12241",
      "title": "Spatial semantics: Modeling the meaning of prepositions",
      "authors": [
        {
          "name": "Joost Zwarts",
          "openalex_id": "A5035733976",
          "orcid": "https://orcid.org/0000-0002-8892-6523",
          "institutions": [
            "Utrecht University"
          ]
        }
      ],
      "publication_year": 2017,
      "publication_date": "2017-05-01",
      "abstract": "Abstract Reference to space, especially with prepositions, plays a central role in natural language and is receiving more and more attention over the past decades. One line of research uses formal semantic modeling, using topological and other geometrical concepts such as regions, vectors, and paths. Another line of research has drawn attention to the role of function, force‐dynamics, polysemy, prototypes, and crosslinguistic variation in this domain. This paper gives an overview of both lines of research and argues that a synthesis is possible, based on a proper division of labor between semantics and pragmatics, richer ontologies, and a perspective on categorization that uses conceptual spaces and semantic maps.",
      "cited_by_count": 76,
      "type": "article",
      "source": {
        "name": "Language and Linguistics Compass",
        "type": "journal",
        "issn": [
          "1749-818X"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "bronze",
        "oa_url": "https://onlinelibrary.wiley.com/doi/pdfdirect/10.1111/lnc3.12241"
      },
      "topics": [
        "Constraint Satisfaction and Optimization",
        "Categorization, perception, and language",
        "Geographic Information Systems Studies"
      ],
      "referenced_works_count": 95,
      "url": "https://openalex.org/W2612521429"
    },
    {
      "openalex_id": "W2606051756",
      "doi": "10.26686/ajl.v14i1.4028",
      "title": "What If? The Exploration of an Idea",
      "authors": [
        {
          "name": "Graham Priest",
          "openalex_id": "A5024901674",
          "institutions": [
            "City University of New York",
            "The Graduate Center, CUNY"
          ]
        }
      ],
      "publication_year": 2017,
      "publication_date": "2017-04-11",
      "abstract": "A crucial question here is what, exactly, the conditional in the naive truth/set comprehension principles is. In 'Logic of Paradox', I outlined two options. One is to take it to be the material conditional of the extensional paraconsistent logic LP. Call this \"Strategy 1\". LP is a relatively weak logic, however. In particular, the material conditional does not detach. The other strategy is to take it to be some detachable conditional. Call this \"Strategy 2\". The aim of the present essay is to investigate Stragey 1. It is not to advocate it. The work is simply an extended exploration of the strategy, its strengths, its weaknesses, and the various dierent ways in which it may be implemented. In the first part of the paper I will set up the appropriate background details. In the second, I will look at the strategy as it applies to the semantic paradoxes. In the third I will look at how it applies to the set-theoretic paradoxes.",
      "cited_by_count": 85,
      "type": "article",
      "source": {
        "name": "The Australasian Journal of Logic",
        "type": "journal",
        "issn": [
          "1448-5052"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "diamond",
        "oa_url": "https://ojs.victoria.ac.nz/ajl/article/download/4028/3574"
      },
      "topics": [
        "Philosophy and Theoretical Science",
        "Logic, Reasoning, and Knowledge",
        "Classical Philosophy and Thought"
      ],
      "referenced_works_count": 56,
      "url": "https://openalex.org/W2606051756"
    }
  ],
  "count": 30,
  "errors": []
}
