{
  "status": "success",
  "source": "openalex",
  "query": "intentionality philosophy of mind",
  "results": [
    {
      "openalex_id": "W2166027036",
      "doi": "10.4324/9781315471617-12",
      "title": "Philosophy of social science",
      "authors": [],
      "publication_year": 2018,
      "publication_date": "2018-04-19",
      "abstract": "Preface 1. What Is the Philosophy of Social Science? 2. The Methodological Divide: Naturalism Versus Interpretation 3. The Explanation of Human Action 4. Actions, Intentionality and the Mind/Body Problem 5. Behaviorism in the Behavioral Sciences 6. Problems of Rational Choice Theory 7. Social Psychology and the Construction of Society 8. Continental Philosophy of Social Science 9. Holism and Antireductionism in Sociology and Psychology 10. Functionalism as a Research Program 11. Sociobiology or the Standard Social Science Model? 12. Theories of Cultural Evolution 13. Research Ethics in Social Inquiry 14. Facts and Values in the Human Sciences 15. Social Science and the Enduring Questions of Philosophy Bibliography Index",
      "cited_by_count": 552,
      "type": "book-chapter",
      "source": null,
      "open_access": {
        "is_oa": false,
        "oa_status": "closed",
        "oa_url": null
      },
      "topics": [
        "Philosophy and History of Science",
        "Epistemology, Ethics, and Metaphysics",
        "Pragmatism in Philosophy and Education"
      ],
      "referenced_works_count": 0,
      "url": "https://openalex.org/W2166027036"
    },
    {
      "openalex_id": "W4248169967",
      "doi": "10.1093/oso/9780198794325.001.0001",
      "title": "Enactivist Interventions",
      "authors": [
        {
          "name": "Shaun Gallagher",
          "openalex_id": "A5029669651",
          "orcid": "https://orcid.org/0000-0002-3147-9929"
        }
      ],
      "publication_year": 2017,
      "publication_date": "2017-08-22",
      "abstract": "<italic>Enactivist Interventions</italic> explores central issues in the contemporary debates about embodied cognition, addressing interdisciplinary questions about intentionality, representation, affordances, the role of affect, and the problems of perception and cognitive penetration, action and free will, higher-order cognition, and intersubjectivity. It argues for a rethinking of the concept of mind, drawing on pragmatism, phenomenology, and cognitive science. It interprets enactivism as a philosophy of nature that has significant methodological and theoretical implications for the scientific investigation of the mind. <italic>Enactivist Interventions</italic> argues that, like the basic phenomena of perception and action, sophisticated cognitive phenomena like reflection, imagining, and mathematical reasoning are best explained in terms of an affordance-based skilled coping. It thus argues for a continuity that runs between basic action, affectivity, and a rationality that in every case remains embodied. It also discusses recent predictive models of brain function and outlines an alternative, enactivist interpretation that emphasizes the close coupling of brain, body, and environment rather than a strong boundary that isolates the brain in its internal processes. The extensive relational dynamics that integrates the brain with the extra-neural body opens into an environment that is physical, social, and cultural and that recycles back into the enactive process. Cognitive processes are <italic>in the world</italic>, situated in affordance spaces defined across evolutionary, developmental, and individual histories, and are constrained by affective processes and normative dimensions of social and cultural practices.",
      "cited_by_count": 781,
      "type": "book",
      "source": {
        "name": "Oxford University Press eBooks",
        "type": "ebook platform",
        "issn": null
      },
      "open_access": {
        "is_oa": false,
        "oa_status": "closed",
        "oa_url": null
      },
      "topics": [
        "Embodied and Extended Cognition"
      ],
      "referenced_works_count": 0,
      "url": "https://openalex.org/W4248169967"
    },
    {
      "openalex_id": "W2805096256",
      "doi": "10.22555/joeed.v5i1.2154",
      "title": "Phenomenology: A Philosophy and Method of Inquiry",
      "authors": [
        {
          "name": "Sadruddin Bahadur Qutoshi",
          "openalex_id": "A5028369393",
          "orcid": "https://orcid.org/0000-0003-1630-428X",
          "institutions": [
            "Karakoram International University"
          ]
        }
      ],
      "publication_year": 2018,
      "publication_date": "2018-05-30",
      "abstract": "&lt;p&gt; &lt;em&gt;Phenomenology as a philosophy and a method of inquiry is not limited to an approach to knowing, it is rather an intellectual engagement in interpretations and meaning making that is used to understand the lived world of human beings at a conscious level. Historically, Husserl’ (1913/1962) perspective of phenomenology is a science of understanding human beings at a deeper level by gazing at the phenomenon. However, Heideggerian view of interpretive-hermeneutic phenomenology gives wider meaning to the lived experiences under study. Using this approach, a researcher uses bracketing as a taken for granted assumption in describing the natural way of appearance of phenomena to gain insights into lived experiences and interpret for meaning making. The data collection and analysis takes place side by side to illumine the specific experience to identify the phenomena that is perceived by the actors in a particular situation. The outcomes of a phenomenological study broadens the mind, improves the ways of thinking to see a phenomenon, and it enables to see ahead and define researchers’ posture through intentional study of lived experiences. However, the subjectivity and personal knowledge in perceiving and interpreting it from the research participant’s point of view has been central in phenomenological studies. To achieve such an objective, phenomenology could be used extensively in social sciences.&lt;/em&gt;&lt;/p&gt;",
      "cited_by_count": 261,
      "type": "article",
      "source": {
        "name": "Journal of Education and Educational Development",
        "type": "journal",
        "issn": [
          "2310-0869",
          "2313-3538"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "gold",
        "oa_url": "https://doi.org/10.22555/joeed.v5i1.2154"
      },
      "topics": [
        "Hermeneutics and Narrative Identity",
        "Phenomenology and Existential Philosophy",
        "Social Science and Policy Research"
      ],
      "referenced_works_count": 8,
      "url": "https://openalex.org/W2805096256"
    },
    {
      "openalex_id": "W2896816610",
      "doi": "10.1093/oxfordhb/9780198735410.013.3",
      "title": "Ecological-Enactive Cognition as engaging with a field of relevant affordances",
      "authors": [
        {
          "name": "Erik Rietveld",
          "openalex_id": "A5002678933",
          "orcid": "https://orcid.org/0000-0001-5197-142X",
          "institutions": [
            "University of Amsterdam"
          ]
        },
        {
          "name": "Damiaan Denys",
          "openalex_id": "A5010458603",
          "orcid": "https://orcid.org/0000-0002-3191-3844",
          "institutions": [
            "University of Amsterdam"
          ]
        },
        {
          "name": "Maarten van Westen",
          "openalex_id": "A5012970380",
          "orcid": "https://orcid.org/0000-0002-7854-9306",
          "institutions": [
            "University of Amsterdam"
          ]
        }
      ],
      "publication_year": 2018,
      "publication_date": "2018-10-09",
      "abstract": "Abstract The topic of this Oxford handbook is “4E cognition”: cognition as embodied, embedded, enactive, and extended. However, one important “E” is missing: an E for ecological. We sketch an ecological-enactive approach to cognition that presents a framework for bringing together the embodied/enactive program with the ecological program originally developed by James Gibson, in which affordances are central. We call this framework the skilled intentionality framework. The skilled intentionality framework is a philosophical approach to understanding the situated and affective embodied mind. It is a new conceptual framework for the field of 4E cognitive science that focuses on skilled action and builds upon an enriched notion of affordances. We define skilled intentionality as the selective engagement with multiple affordances simultaneously in a concrete situation. The skilled intentionality framework clarifies how complementary insights on affordance responsiveness from philosophy/phenomenology, ecological psychology, emotion psychology, and neurodynamics hang together in an intertwined way.",
      "cited_by_count": 92,
      "type": "reference-entry",
      "source": {
        "name": "Oxford University Press eBooks",
        "type": "ebook platform",
        "issn": null
      },
      "open_access": {
        "is_oa": false,
        "oa_status": "closed",
        "oa_url": null
      },
      "topics": [
        "Embodied and Extended Cognition",
        "Mental Health and Psychiatry",
        "Philosophy and History of Science"
      ],
      "referenced_works_count": 47,
      "url": "https://openalex.org/W2896816610"
    },
    {
      "openalex_id": "W2632253730",
      "doi": null,
      "title": "A Mark of the Mental : In Defense of Informational Teleosemantics",
      "authors": [
        {
          "name": "Karen Neander",
          "openalex_id": "A5088152547"
        }
      ],
      "publication_year": 2017,
      "publication_date": "2017-06-16",
      "abstract": "Drawing on insights from causal theories of reference, teleosemantics, and state space semantics, a theory of naturalized mental representation. In A Mark of Mental, Karen Neander considers representational power of mental states-described by cognitive scientist Zenon Pylyshyn as second hardest of philosophy of mind (the first being consciousness). The puzzle at heart of book is sometimes called the problem of mental content, Brentano's problem, or the problem of intentionality. Its motivating mystery is how neurobiological states can have semantic properties such as meaning or reference. Neander proposes a naturalistic account for sensory-perceptual (nonconceptual) representations. Neander draws on insights from state-space semantics (which appeals to relations of second-order similarity between representing and represented domains), causal theories of reference (which claim reference relation is a causal one), and teleosemantic theories (which claim that semantic norms, at their simplest, depend on functional norms). She proposes and defends an intuitive, theoretically well-motivated but highly controversial thesis: sensory-perceptual systems have function to produce inner state changes that are analogs of as well as caused by their referents. Neander shows that three main elements-functions, causal-information relations, and relations of second-order similarity-complement rather than conflict with each other. After developing an argument for teleosemantics by examining nature of explanation in mind and brain sciences, she develops a theory of mental content and defends it against six main content-determinacy challenges to a naturalized semantics.",
      "cited_by_count": 182,
      "type": "book",
      "source": null,
      "open_access": {
        "is_oa": false,
        "oa_status": "closed",
        "oa_url": null
      },
      "topics": [
        "Philosophy and Theoretical Science"
      ],
      "referenced_works_count": 0,
      "url": "https://openalex.org/W2632253730"
    },
    {
      "openalex_id": "W4244115152",
      "doi": "10.1093/acprof:oso/9780198716297.001.0001",
      "title": "Cognition, Content, and the A Priori",
      "authors": [
        {
          "name": "Robert Hanna",
          "openalex_id": "A5109395150"
        }
      ],
      "publication_year": 2015,
      "publication_date": "2015-10-01",
      "abstract": "Abstract This book develops a unified contemporary Kantian theory of rational human cognition and knowledge. Along the way, it provides accounts of (i) intentionality and its contents, including non-conceptual content and conceptual content, (ii) sense perception and perceptual knowledge, including perceptual self-knowledge, (iii) the analytic-synthetic distinction, (iv) the nature of logic, and (v) a priori truth and knowledge in mathematics, logic, and philosophy. This book is specifically intended to reach out to two very different audiences: contemporary Analytic philosophers of mind and knowledge, on the one hand, and contemporary Kantian philosophers or Kant-scholars, on the other. At the same time, it is also riding the crest of a wave of extremely exciting and even revolutionary emerging new trends and new work in the philosophy of mind and epistemology, with a special concentration on the philosophy of perception. What is revolutionary in this new wave are its strong emphases on action, on cognitive phenomenology, on disjunctivist direct realism, on embodiment, and on sense perception as a primitive proto-rational capacity for cognizing the world. The book makes a fundamental contribution to this philosophical revolution by giving it a specifically contemporary Kantian twist, and by pushing these new lines of investigation radically further.",
      "cited_by_count": 81,
      "type": "book",
      "source": null,
      "open_access": {
        "is_oa": false,
        "oa_status": "closed",
        "oa_url": null
      },
      "topics": [
        "Philosophy and Theoretical Science",
        "Epistemology, Ethics, and Metaphysics",
        "Historical Philosophy and Science"
      ],
      "referenced_works_count": 364,
      "url": "https://openalex.org/W4244115152"
    },
    {
      "openalex_id": "W2769563706",
      "doi": "10.1177/0170840617736939",
      "title": "Imagination and Creativity in Organizations",
      "authors": [
        {
          "name": "Neil Thompson",
          "openalex_id": "A5090002218",
          "orcid": "https://orcid.org/0000-0001-8689-5287"
        }
      ],
      "publication_year": 2017,
      "publication_date": "2017-11-24",
      "abstract": "Scholars adopting a relational ontology of organisational creativity have shifted attention away from a preoccupation with individual minds towards that which is enacted, emergent, shared, unpredictable and contingent. This article follows suit, yet breaks new ground by reconsidering how the mind plays an active role in unfolding creative interactions by building a bridge between literature on organisational creativity, aesthetics and philosophy of imagination. I draw on English Romanticism to craft a theoretical model of organisational creativity as an aesthetic and relational process of shared imagining. This model demonstrates how organisational members use primary and secondary modes of imagination and creative expression to develop, materialise and share perceptions and images of possible futures. By elaborating on their interplay, this article contributes to literature by theorising an active and generative role of mind that does not have the ontological shortcomings of leading theories. In turn, this has a number of implications for literature on entrepreneurship and organisational creativity in terms of situating and embodying creative thinking, explaining the intentionality and motivation for creative actions, overcoming perceptual differences and changing practices and routines.",
      "cited_by_count": 94,
      "type": "article",
      "source": {
        "name": "Organization Studies",
        "type": "journal",
        "issn": [
          "0170-8406",
          "1741-3044"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "hybrid",
        "oa_url": "https://journals.sagepub.com/doi/pdf/10.1177/0170840617736939"
      },
      "topics": [
        "Creativity in Education and Neuroscience",
        "Management and Organizational Studies",
        "Management Theory and Practice"
      ],
      "referenced_works_count": 115,
      "url": "https://openalex.org/W2769563706"
    },
    {
      "openalex_id": "W4214719474",
      "doi": "10.4324/9781315771939",
      "title": "Perception",
      "authors": [
        {
          "name": "Adam Pautz",
          "openalex_id": "A5052809398"
        }
      ],
      "publication_year": 2021,
      "publication_date": "2021-03-16",
      "abstract": "\"Perception is one of the most pervasive and puzzling problems in philosophy, generating a great deal of attention and controversy in philosophy of mind, psychology and metaphysics. If perceptual illusion and hallucination are possible, how can perception be what it intuitively seems to be, a direct and immediate access to reality? Perception is an outstanding introduction to this fundamental topic, covering both the perennial and recent work on the problem. Adam Pautz examines four of the most important theories of perception: the sense datum view; the Qualia view; the intentional view; and the disjunctive view, assessing each in turn. He also discusses the relationship between perception and the physical world, in particular arguments for physical reductivism in perception, and the problem of sensory qualities such as color. Useful examples are included throughout the book to illustrate the problematic nature of perception, including consciousness, hallucination, illusion, blindsight, the reliability of introspection, and whether perception is conceptual or non-conceptual. The addition of chapter summaries, suggestions for further reading and a glossary of terms make Perception essential reading for anyone studying the topic in detail, as well as for students of philosophy of mind, philosophy of psychology and metaphysics\"--",
      "cited_by_count": 69,
      "type": "book",
      "source": null,
      "open_access": {
        "is_oa": false,
        "oa_status": "closed",
        "oa_url": null
      },
      "topics": [
        "History of Science and Medicine"
      ],
      "referenced_works_count": 0,
      "url": "https://openalex.org/W4214719474"
    },
    {
      "openalex_id": "W4246699554",
      "doi": "10.1093/acprof:oso/9780190457204.001.0001",
      "title": "Distributed Agency",
      "authors": [],
      "publication_year": 2017,
      "publication_date": "2017-02-16",
      "abstract": "Abstract This book presents an interdisciplinary inroad into the latest thinking about the distributed nature of agency: what it’s like, what are its conditions of possibility, and what are its consequences. The book’s 26 chapters are written by a wide range of scholars, from anthropology, biology, cognitive science, linguistics, philosophy, psychology, geography, law, economics, and sociology. While each chapter takes up different materials using different methods, they all chart relations between the key elements of agency: intentionality, causality, flexibility, and accountability. Each chapter seeks to explain how and why such relations are distributed—not just across individuals, but also across bodies and minds, people and things, spaces and times. To do this, the authors work through empirical studies of particular cases, while also offering reviews and syntheses of key ideas from the authors’ respective research traditions. The goals with this collection of essays are to assemble insights from new research on the anatomy of human agency, to address divergent framings of the issues from different disciplines, and to suggest directions for new debates and lines of research. This volume will be a resource for researchers working on allied topics, and for students learning about the elements of human-specific modes of shared action, from causality, intentionality, and personhood to ethics, punishment, and accountability.",
      "cited_by_count": 101,
      "type": "book",
      "source": {
        "name": "Oxford University Press eBooks",
        "type": "ebook platform",
        "issn": null
      },
      "open_access": {
        "is_oa": false,
        "oa_status": "closed",
        "oa_url": null
      },
      "topics": [],
      "referenced_works_count": 0,
      "url": "https://openalex.org/W4246699554"
    },
    {
      "openalex_id": "W2561262129",
      "doi": "10.1017/apa.2016.28",
      "title": "Is Having Your Computer Compromised a Personal Assault? The Ethics of Extended Cognition",
      "authors": [
        {
          "name": "J. Adam Carter",
          "openalex_id": "A5026726066",
          "orcid": "https://orcid.org/0000-0002-1222-8331"
        },
        {
          "name": "S. Orestis Palermos",
          "openalex_id": "A5004967642",
          "orcid": "https://orcid.org/0000-0002-0297-084X"
        }
      ],
      "publication_year": 2016,
      "publication_date": "2016-01-01",
      "abstract": "ABSTRACT: Philosophy of mind and cognitive science (e.g., Clark and Chalmers 1998; Clark 2010; Palermos 2014) have recently become increasingly receptive to the hypothesis of extended cognition, according to which external artifacts such as our laptops and smartphones can—under appropriate circumstances—feature as material realizers of a person's cognitive processes. We argue that, to the extent that the hypothesis of extended cognition is correct, our legal and ethical theorizing and practice must be updated by broadening our conception of personal assault so as to include intentional harm toward gadgets that have been appropriately integrated . We next situate the theoretical case for extended personal assault within the context of some recent ethical and legal cases and close with critical discussion.",
      "cited_by_count": 87,
      "type": "article",
      "source": {
        "name": "Journal of the American Philosophical Association",
        "type": "journal",
        "issn": [
          "2053-4477",
          "2053-4485"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "green",
        "oa_url": "https://www.research.ed.ac.uk/en/publications/a2e5d972-8a95-4ea5-8b94-9192b073a61b"
      },
      "topics": [
        "Neuroethics, Human Enhancement, Biomedical Innovations",
        "Embodied and Extended Cognition",
        "Psychology of Moral and Emotional Judgment"
      ],
      "referenced_works_count": 70,
      "url": "https://openalex.org/W2561262129"
    },
    {
      "openalex_id": "W4249893472",
      "doi": "10.1093/oso/9780198732570.001.0001",
      "title": "Non-Propositional Intentionality",
      "authors": [
        {
          "name": "Grzankowski, Alex",
          "openalex_id": ""
        },
        {
          "name": "Montague, Michelle",
          "openalex_id": ""
        }
      ],
      "publication_year": 2018,
      "publication_date": "2018-08-22",
      "abstract": "This book is about the possibility and the prospects of making sense of non-propositional intentionality. Intentionality lies at the centre of a great deal of the philosophy of mind and, by and large, it is understood in propositional terms. Typically, the examples of intentionality deemed fundamental and the explanations of their natures rely on the idea of propositional content. But these commitments cannot go unquestioned and the (often implicit) acceptance of “propositionalism” has impeded philosophical discussion about the nature of intentionality in at least three noteworthy ways: (i) a precise statement of propositionalism has been left undeveloped; (ii) the motivations for propositionalism are rarely articulated; and (iii) apparent counterexamples and challenges to propositionalism, along with non-propositional theories of intentionality, are underexplored. The contributors to this volume explore and correct these impediments by discussing in detail what the commitment to propositionalism amounts to; by shedding light on why one might find the thesis attractive (or unattractive); and by exploring the ways in which one might depart from propositionalism.",
      "cited_by_count": 53,
      "type": "book",
      "source": {
        "name": "Oxford University Press eBooks",
        "type": "ebook platform",
        "issn": null
      },
      "open_access": {
        "is_oa": false,
        "oa_status": "closed",
        "oa_url": null
      },
      "topics": [
        "Philosophy and Theoretical Science"
      ],
      "referenced_works_count": 0,
      "url": "https://openalex.org/W4249893472"
    },
    {
      "openalex_id": "W1515857817",
      "doi": "10.4324/9780429506994",
      "title": "Philosophy of Mind",
      "authors": [
        {
          "name": "John Heil",
          "openalex_id": "A5113731154"
        }
      ],
      "publication_year": 2019,
      "publication_date": "2019-08-29",
      "abstract": "Preface to the second edition Preface to the first edition 1. Introduction 1.1 Experience and reality 1.2 The unavoidability of the philosophy of mind 1.3 Science and metaphysics 1.4 Metaphysics and cognitive science 1.5 A look ahead Suggested reading 2. Cartesian Dualism 2.1 Science and philosophy 2.2 Descartes's Dualism 2.3 Substances, attributes, and modes 2.4 The metaphysics of Cartesian Dualism 2.5 Mind-body interaction Suggested reading 3. Decartes's legacy 3.1 Dualism without interaction 3.2 Parallelism 3.3 Occasionalism 3.4 Causation and occasionalism 3.5 Idealism 3.6 Mind and meaning 3.7 Epiphenomealism Suggested reading 4. Non-Cartesian Dualism 4.1 Three facets of Cartesian Dualism 4.2 Individuating substances 4.3 Metaphysical interlude 4.4 Substance dualism 4.5 Self-body interaction 4.6 Taking stock Suggested reading 5. Behaviourism 5.1 Moving away from Dualism 5.2 Historical and philosophical background 5.3 Privacy and its consequences 5.4 The beetle in the box 5.5 Philosophical behaviourism 5.6 Dispositions 5.7 Behavioural analysis 5.8 Sensation 5.9 The legacy of philosophical behaviourism 5.10 Intrinsic and extrinsic characteristics 5.11 Psychological behaviourism 5.12 The demise of behaviourism Suggested reading 6. The identity theory 6.1 Correlation to identification 6.2 Parsimony 6.3 Self-conscious thought 6.4 Locating mental qualities 6.5 Substance, properties, states, and events 6.6 Predicates and properties 6.7 Strict identity 6.8 Leibniz's law 6.9 The $64 question 6.10 Qualities of experiences and qualities experienced 6.11 Epistemological loose ends 6.12 Taking stock Suggested reading 7. Functionalism 7.1 The emergence of functionalism 7.2 The functionalist picture 7.3 Abstraction as partial consideration 7.4 Minds as computing machines 7.5 Functional explanation 7.6 Functionalist ontology 7.7 Functionalism and materialism 7.8 Functional properties 7.9 Mental properties as functional properties 7.10 Functionalism and behaviourism 7.11 Characterizing functional states 7.12 Total functional systems Suggested reading 8. The representational theory of mind 8.1 Mental representation 8.2 Semantic engines 8.3 The mind as a semantic engine 8.4 The Chinese room 8.5 From syntax to semantics 8.6 Levels of description 8.7 Levels of description and the special sciences 8.8 From taxonomy to ontology 8.9 Layers of reality Suggested reading 9. Qualia 9.1 Qualities of conscious experience 9.2 Zombies 9.3 Biting the bullet 9.4 Living without Qualia 9.5 The mystery of consciousness Suggested reading 10. Radical interpretation 10.1 Minds as constructs 10.2 Davidson and the propositional attitudes 10.3 Semantic opacity 10.4 Radical interpretation: Background issues 10.5 T-theories 10.6 From T-theories to I-theories 10. 7 Decision theory 10.8 Charity 10.9 Indeterminacy 10.10 The omniscient interpreter 10.11 Interpretation and measurement 10.12 Structures and content 10.13 Mental causation and the propositional attitudes 10.14 An apparent regress Suggested reading 11. The intentonal stance 11.1 From Davidson to Dennett 11.2 Taking a stance 11.3 From intentional stance to design stance 11.4 From design stance to physical stance 11.5 The emerging picture 11.6 Thought and language 11.7 Kinds of mind 11.8 Consciousness 11.9 Searle's objection Suggested reading 12. Eliminativism 12.1 From instrumentalism to eliminativism 12.2 Theories and theory reduction 12.3 Stitch's argument 12.4 Is eliminativism self-refuting? Suggested reading 13. Property Dualism 13.1 From substances to properties 13.2 Appearance and reality 13.3 Mental causation 13.4 Mental-material supervienience 13.5 Causal relevance 13.6 The causal relevance of mental properties 13.7 The upshot 13.8 Conclusion Suggested reading 14. Mind and metaphysics 14.1 The status of philosophies of mind 14.2 Metaphysical p",
      "cited_by_count": 94,
      "type": "book",
      "source": null,
      "open_access": {
        "is_oa": false,
        "oa_status": "closed",
        "oa_url": null
      },
      "topics": [
        "Classical Philosophy and Thought",
        "Philosophy and Theoretical Science",
        "Medieval and Classical Philosophy"
      ],
      "referenced_works_count": 0,
      "url": "https://openalex.org/W1515857817"
    },
    {
      "openalex_id": "W2971921852",
      "doi": "10.1093/oso/9780199685479.001.0001",
      "title": "Brentano's Mind",
      "authors": [
        {
          "name": "Mark Textor",
          "openalex_id": "A5086620720",
          "orcid": "https://orcid.org/0000-0002-8419-6949"
        }
      ],
      "publication_year": 2017,
      "publication_date": "2017-09-21",
      "abstract": "Brentano is one of the ‘grandfathers’ of philosophy of mind. His work influenced analytic philosophers like Russell and Chisholm as well as phenomenologists like Husserl and Sartre and continues to shape debates in the philosophy of mind. Brentano made intentionality a central topic in the philosophy of mind by proposing that ‘directedness’ is the mark of the mental. The book’s first part investigates Brentano’s intentionalism and attempts to improve or develop it. I argue that there is no plausible version of this doctrine and reject it in favour of a mark of the mental proposed by Brentano’s student Husserl: mental phenomena have no appearances. The book’s second part develops and defends Brentano’s metaphysics of awareness. Awareness of a mental activity and this mental activity are not distinct mental acts, the first representing the second. They are one and the same activity directed on <italic>several</italic> objects. Brentano’s basic insight is that intentionality is plural: <italic>directedness is always directedness on some objects</italic>. I will assess Brentano’s arguments for this view and argue that the plural conception of intentionality solves thorny problems about perceptual consciousness (II.1). I will go on to articulate Brentano’s distinction between awareness and observation in the proposed framework (II.2). In the next part (II.3) I use enjoying an activity as a model for awareness of it and explore the intentionality and nature of pleasure. The book’s final part (II.4) extends the plural view to the conscious mental life of a thinker at a time (the unity of synchronic consciousness): it is one mental act with many objects.",
      "cited_by_count": 29,
      "type": "book",
      "source": {
        "name": "Oxford University Press eBooks",
        "type": "ebook platform",
        "issn": null
      },
      "open_access": {
        "is_oa": false,
        "oa_status": "closed",
        "oa_url": null
      },
      "topics": [
        "Philosophy and Theoretical Science",
        "Philosophy, Science, and History",
        "Phenomenology and Existential Philosophy"
      ],
      "referenced_works_count": 0,
      "url": "https://openalex.org/W2971921852"
    },
    {
      "openalex_id": "W2917665918",
      "doi": "10.1093/oso/9780190859053.001.0001",
      "title": "Combining Minds",
      "authors": [
        {
          "name": "Luke Roelofs",
          "openalex_id": "A5039348899",
          "orcid": "https://orcid.org/0000-0002-2424-8583",
          "institutions": [
            "Ruhr University Bochum"
          ]
        }
      ],
      "publication_year": 2019,
      "publication_date": "2019-02-19",
      "abstract": "Abstract This book explores a neglected philosophical question: How do groups of interacting minds relate to singular minds? Could several of us, by organizing ourselves the right way, constitute a single conscious mind that contains our minds as parts? And could each of us have been, all along, a group of mental parts in close cooperation? Scientific progress seems to be slowly revealing that all the different physical objects around us are, at root, just a matter of the right parts put together in the right ways: How far could the same be true of minds? This book argues that we are too used to seeing the mind as an indivisible unity and that understanding our place in nature requires being willing to see minds as composite systems, simultaneously one conscious whole and many conscious parts. In thinking through the implications of such a shift of perspective, the book relates the question of mental combination to a range of different theories of the mind (in particular panpsychism, functionalism, and Neo-Lockeanism about personal identity) and identifies, clarifies, and addresses a wide array of philosophical objections (concerning personal identity, the unity of consciousness, the privacy of experience, and other issues) that have been raised against the idea of composite minds. The result is an account of the metaphysics of composition and consciousness that can illuminate many different debates in philosophy of mind, concerning split brains, collective intentionality, and the combination problem, among others.",
      "cited_by_count": 53,
      "type": "book",
      "source": {
        "name": "Oxford University Press eBooks",
        "type": "ebook platform",
        "issn": null
      },
      "open_access": {
        "is_oa": false,
        "oa_status": "closed",
        "oa_url": null
      },
      "topics": [
        "Philosophy and Theoretical Science"
      ],
      "referenced_works_count": 447,
      "url": "https://openalex.org/W2917665918"
    },
    {
      "openalex_id": "W2556610291",
      "doi": "10.1007/s11098-016-0809-x",
      "title": "Phenomenal consciousness, collective mentality, and collective moral responsibility",
      "authors": [
        {
          "name": "Matthew Baddorf",
          "openalex_id": "A5087210623",
          "orcid": "https://orcid.org/0000-0001-9753-7477",
          "institutions": [
            "University of Rochester"
          ]
        }
      ],
      "publication_year": 2016,
      "publication_date": "2016-11-26",
      "abstract": null,
      "cited_by_count": 47,
      "type": "article",
      "source": {
        "name": "Philosophical Studies",
        "type": "journal",
        "issn": [
          "0031-8116",
          "1573-0883"
        ]
      },
      "open_access": {
        "is_oa": false,
        "oa_status": "closed",
        "oa_url": null
      },
      "topics": [
        "Psychology of Moral and Emotional Judgment",
        "Free Will and Agency",
        "Epistemology, Ethics, and Metaphysics"
      ],
      "referenced_works_count": 36,
      "url": "https://openalex.org/W2556610291"
    },
    {
      "openalex_id": "W2515403873",
      "doi": "10.1002/hbm.23300",
      "title": "The imaginative mind",
      "authors": [
        {
          "name": "Anna Abraham",
          "openalex_id": "A5085781036",
          "orcid": "https://orcid.org/0000-0003-4954-8205",
          "institutions": [
            "Leeds Beckett University"
          ]
        }
      ],
      "publication_year": 2016,
      "publication_date": "2016-07-25",
      "abstract": "Abstract The astounding capacity for the human imagination to be engaged across a wide range of contexts is limitless and fundamental to our day‐to‐day experiences. Although processes of imagination are central to human psychological function, they rarely occupy center stage in academic discourse or empirical study within psychological and neuroscientific realms. The aim of this paper is to tackle this imbalance by drawing together the multitudinous facets of imagination within a common framework. The processes fall into one of five categories depending on whether they are characterized as involving perceptual/motor related mental imagery, intentionality or recollective processing, novel combinatorial or generative processing, exceptional phenomenology in the aesthetic response, or altered psychological states which range from commonplace to dysfunctional. These proposed categories are defined on the basis of theoretical ideas from philosophy as well as empirical evidence from neuroscience. By synthesizing the findings across these domains of imagination, this novel five‐part or quinquepartite classification of the human imagination aids in systematizing, and thereby abets, our understanding of the workings and neural foundations of the human imagination. It would serve as a blueprint to direct further advances in the field of imagination while also promoting crosstalk with reference to stimulus‐oriented facets of information processing. A biologically and ecologically valid psychology is one that seeks to explain fundamental aspects of human nature. Given the ubiquitous nature of the imaginative operations in our daily lives, there can be little doubt that these quintessential aspects of the mind should be central to the discussion. Hum Brain Mapp 37:4197–4211, 2016 . © 2016 Wiley Periodicals, Inc.",
      "cited_by_count": 114,
      "type": "review",
      "source": {
        "name": "Human Brain Mapping",
        "type": "journal",
        "issn": [
          "1065-9471",
          "1097-0193"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "green",
        "oa_url": "https://www.ncbi.nlm.nih.gov/pmc/articles/6867574"
      },
      "topics": [
        "Creativity in Education and Neuroscience",
        "Aesthetic Perception and Analysis",
        "Mind wandering and attention"
      ],
      "referenced_works_count": 150,
      "url": "https://openalex.org/W2515403873"
    },
    {
      "openalex_id": "W4240907584",
      "doi": "10.1093/acrefore/9780190228613.013.627",
      "title": "Posthumanism",
      "authors": [
        {
          "name": "Diane Marie Keeling",
          "openalex_id": "A5051463075",
          "orcid": "https://orcid.org/0000-0003-3613-9162"
        },
        {
          "name": "Marguerite Nguyen Lehman",
          "openalex_id": "A5076641984"
        }
      ],
      "publication_year": 2018,
      "publication_date": "2018-04-26",
      "abstract": "Posthumanism is a philosophical perspective of how change is enacted in the world. As a conceptualization and historicization of both agency and the “human,” it is different from those conceived through humanism. Whereas a humanist perspective frequently assumes the human is autonomous, conscious, intentional, and exceptional in acts of change, a posthumanist perspective assumes agency is distributed through dynamic forces of which the human participates but does not completely intend or control. Posthumanist philosophy constitutes the human as: (a) physically, chemically, and biologically enmeshed and dependent on the environment; (b) moved to action through interactions that generate affects, habits, and reason; and (c) possessing no attribute that is uniquely human but is instead made up of a larger evolving ecosystem. There is little consensus in posthumanist scholarship about the degree to which a conscious human subject can actively create change, but the human does participate in change. As distinguished from posthumanism, humanism is credited with attributing the conscious and intentional human subject as the dominant source of agency most worthy of scholarly attention. Since its inception during the Renaissance, humanism has been constituted in various ways throughout history, but as a collective body of literature, the human is typically constituted through humanism as: (a) autonomous from nature given the intellectual faculties of the mind that controls the body, (b) uniquely capable of and motivated by speech and reason, and (c) an exceptional animal that is superior to other creatures. Humanist assumptions concerning the human are infused throughout Western philosophy and reinforce a nature/culture dualism where human culture is distinct from nature. In contrast, a posthumanist scholar rejects this dichotomy through understanding the human as entangled with its environment. A posthumanist scholar of communication typically integrates scholarship from a variety of other disciplines including, but not limited to: art, architecture, cybernetics, ecology, ethology, geology, music, psychoanalysis, and quantum physics.",
      "cited_by_count": 73,
      "type": "reference-entry",
      "source": {
        "name": "Oxford Research Encyclopedia of Communication",
        "type": "journal",
        "issn": null
      },
      "open_access": {
        "is_oa": false,
        "oa_status": "closed",
        "oa_url": null
      },
      "topics": [
        "Space Science and Extraterrestrial Life"
      ],
      "referenced_works_count": 0,
      "url": "https://openalex.org/W4240907584"
    },
    {
      "openalex_id": "W2819510528",
      "doi": "10.1111/phc3.12529",
      "title": "The developmental and cultural psychology of free will",
      "authors": [
        {
          "name": "Tamar Kushnir",
          "openalex_id": "A5026362436",
          "orcid": "https://orcid.org/0000-0002-7656-6292",
          "institutions": [
            "Cornell University"
          ]
        }
      ],
      "publication_year": 2018,
      "publication_date": "2018-07-12",
      "abstract": "Abstract This paper provides an account of the developmental origins of our belief in free will based on research from a range of ages—infants, preschoolers, older children, and adults—and across cultures. The foundations of free will beliefs are in infants' understanding of intentional action—their ability to use context to infer when agents are free to “do otherwise” and when they are constrained. In early childhood, new knowledge about causes of action leads to new abilities to imagine constraints on action. Moreover, unlike adults, young children tend to view psychological causes (i.e., desires) and social causes (i.e., following rules or group norms, being kind or fair) of action as constraints on free will. But these beliefs change, and also diverge across cultures, corresponding to differences between Eastern and Western philosophies of mind, self, and action. Finally, new evidence shows developmentally early, culturally dependent links between free will beliefs and behavior, in particular when choice‐making requires self‐control.",
      "cited_by_count": 74,
      "type": "article",
      "source": {
        "name": "Philosophy Compass",
        "type": "journal",
        "issn": [
          "1747-9991"
        ]
      },
      "open_access": {
        "is_oa": false,
        "oa_status": "closed",
        "oa_url": null
      },
      "topics": [
        "Free Will and Agency",
        "Child and Animal Learning Development",
        "Psychology of Moral and Emotional Judgment"
      ],
      "referenced_works_count": 122,
      "url": "https://openalex.org/W2819510528"
    },
    {
      "openalex_id": "W4234488805",
      "doi": "10.1093/oso/9780190052027.001.0001",
      "title": "Anscombe's Intention",
      "authors": [
        {
          "name": "John Schwenkler",
          "openalex_id": "A5041716031",
          "orcid": "https://orcid.org/0000-0003-3183-6727"
        }
      ],
      "publication_year": 2019,
      "publication_date": "2019-11-28",
      "abstract": "This book provides a careful, critical, and appropriately contextualized presentation of the main lines of argument in G.E.M. Anscombe’s seminal book, <italic>Intention</italic>, at a level appropriate to the advanced undergraduate but also capable of benefiting specialists in action theory, ethics, and the history of analytic philosophy. It begins by situating Anscombe’s project in relation to the controversy she initiated over the decision by the University of Oxford to award an honorary degree to Harry Truman, and the connection she saw between her Oxford colleagues’ willingness to excuse Truman’s murderous actions and the situation of moral philosophy at the time. It also documents many of the ways Anscombe drew on the thought of Aristotle, Aquinas, and Wittgenstein, as well as the points at which her argument engages with the work of then-contemporary authors, especially R.M. Hare and Gilbert Ryle. Against this background, the primary focus of the book is on presenting Anscombe’s arguments and assessing the plausibility and philosophical power of the position she develops. Topics that receive especially close attention include: Anscombe’s argument that the primary role of the concept of intention is in the description of what happens in the world, and not of an agent’s state of mind; her account of action as a teleological unity; the relation between rationalizing explanation and causal explanation; the difference between practical and theoretical reasoning; and the possibility of non-observational self-knowledge of what one intentionally does.",
      "cited_by_count": 67,
      "type": "book",
      "source": {
        "name": "Oxford University Press eBooks",
        "type": "ebook platform",
        "issn": null
      },
      "open_access": {
        "is_oa": false,
        "oa_status": "closed",
        "oa_url": null
      },
      "topics": [
        "Seventeenth-Century Political and Philosophical Thought",
        "History of Science and Medicine",
        "Historical Philosophy and Science"
      ],
      "referenced_works_count": 0,
      "url": "https://openalex.org/W4234488805"
    },
    {
      "openalex_id": "W1950796505",
      "doi": "10.1007/978-3-319-18075-5",
      "title": "Alexius Meinong, The Shepherd of Non-Being",
      "authors": [
        {
          "name": "Dale Jacquette",
          "openalex_id": "A5112251939",
          "institutions": [
            "University of Bern"
          ]
        }
      ],
      "publication_year": 2015,
      "publication_date": "2015-01-01",
      "abstract": null,
      "cited_by_count": 66,
      "type": "book",
      "source": {
        "name": "Synthese Library/Synthese library",
        "type": "book series",
        "issn": [
          "0166-6991",
          "2542-8292"
        ]
      },
      "open_access": {
        "is_oa": false,
        "oa_status": "closed",
        "oa_url": null
      },
      "topics": [
        "Classical Philosophy and Thought",
        "Phenomenology and Existential Philosophy",
        "Philosophical Ethics and Theory"
      ],
      "referenced_works_count": 0,
      "url": "https://openalex.org/W1950796505"
    },
    {
      "openalex_id": "W1977622376",
      "doi": "10.4324/9781315235561",
      "title": "Trying Without Willing",
      "authors": [
        {
          "name": "Timothy Cleveland",
          "openalex_id": "A5010113467"
        }
      ],
      "publication_year": 2016,
      "publication_date": "2016-12-05",
      "abstract": "Within the context of a critique of volitional accounts of action based on trying, Trying Without Willing articulates a conception of intentional action based on the notion of de re intention. A central theme is that volitional theories of action based on the concept of trying presuppose dubious Cartesian assumptions about the nature of mind and mental states. There is an original account of Cartesianism which captures how even the orthodox materialist theories of action are bound by Cartesian assumptions. Articulating criticisms of contemporary volitional theories against the backdrop of this Cartesian picture provides a diagnosis of what is amiss with all these views and helps motivate a new view of the mind and its role in intentional action. This view has some affinities with the view of perception which Hilary Putnam recently articulated in his Dewey Lectures and John McDowell developed in his recent book Mind and World. This book will be of interest to professional philosophers and graduate students as well as anyone seriously interested in the philosophy of mind, the nature of intentional action, the problem of mental causation, or the influence of Cartesiansim in contemporary analytic philosophy.",
      "cited_by_count": 24,
      "type": "book",
      "source": null,
      "open_access": {
        "is_oa": false,
        "oa_status": "closed",
        "oa_url": null
      },
      "topics": [
        "Neuroethics, Human Enhancement, Biomedical Innovations"
      ],
      "referenced_works_count": 0,
      "url": "https://openalex.org/W1977622376"
    },
    {
      "openalex_id": "W2768896937",
      "doi": "10.3389/fnbeh.2017.00229",
      "title": "The Agent Brain: A Review of Non-invasive Brain Stimulation Studies on Sensing Agency",
      "authors": [
        {
          "name": "Davide Crivelli",
          "openalex_id": "A5045998701",
          "orcid": "https://orcid.org/0000-0003-2221-2349",
          "institutions": [
            "Università Cattolica del Sacro Cuore"
          ]
        },
        {
          "name": "Michela Balconi",
          "openalex_id": "A5048276247",
          "orcid": "https://orcid.org/0000-0002-8634-1951",
          "institutions": [
            "Università Cattolica del Sacro Cuore"
          ]
        }
      ],
      "publication_year": 2017,
      "publication_date": "2017-11-20",
      "abstract": "According to philosophy of mind and neuroscientific models, the sense of agency can be defined as the sense that I am the one that is generating an action and causing its effects. Such ability to sense ourselves as causal agents is critical for the definition of intentional behavior and is a primary root for human interaction skills. The present mini-review aims at discussing evidences from non-invasive brain stimulation (NIBS) studies targeting functional correlates of different aspects of agency and evidences on the way stimulation techniques affect such core feature of human subjective experience. Clinical and brain imaging studies helped in defining a neural network mediating agency-related processes, which includes the dorsolateral prefrontal cortex (dlPFC), the cingulate cortex (CC), the supplementary and pre-supplementary motor areas (SMA and pre-SMA), the posterior parietal cortex (PPC) and its inferior regions and the cerebellum. However, while the plurality of those structures mirrors the complexity of the phenomenon, their actual roles with respect to different components of the experience of agency have been primarily explored via correlational techniques, without a clear evidence about their causal significance with respect to the integration of sensorimotor information, intentionalization, and action monitoring processes. Therefore, insights into the specific causal role of different cortical structures can be specified by using NIBS techniques, in order to provide improved understanding into the bases of our ability vs. inability to properly act in complex social contexts.",
      "cited_by_count": 44,
      "type": "review",
      "source": {
        "name": "Frontiers in Behavioral Neuroscience",
        "type": "journal",
        "issn": [
          "1662-5153"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "gold",
        "oa_url": "https://www.frontiersin.org/articles/10.3389/fnbeh.2017.00229/pdf"
      },
      "topics": [
        "Free Will and Agency",
        "Psychosomatic Disorders and Their Treatments",
        "Neural and Behavioral Psychology Studies"
      ],
      "referenced_works_count": 54,
      "url": "https://openalex.org/W2768896937"
    },
    {
      "openalex_id": "W3020665105",
      "doi": "10.1093/oso/9780198859918.001.0001",
      "title": "Kant and Animals",
      "authors": [],
      "publication_year": 2020,
      "publication_date": "2020-04-23",
      "abstract": "Abstract This is an edited collection devoted to the topic of the role of animals within Kant’s philosophy. It addresses key issues within both his theoretical and practical philosophy. It examines the place of Kant’s model of animal minds in the historical and contemporary contexts. It addresses the question of whether Kant’s philosophy of mind allows for animals to be capable of intentional representations of spatiotemporal objects. It explores how Kant treated the issue of animal nature as it manifests in humans and non-humans alike, and questions how Kant’s scientific theory attempted to accommodate animals within his broader Enlightenment worldview. It also addresses traditional worries about the moral status of animals within Kant’s and Kantian moral theory. Kant notoriously denied that we have direct obligations to animals, and the question persists as to whether Kantian moral theory provides the right account of the moral status of non-human animals. Several papers in this collection address the question and whether Kant’s views can be defended or ought to be rejected altogether on this basis alone. The collection considers the relevance of Kantian theory for our understanding of contemporary challenges facing human beings with regard to our relationship to animals.",
      "cited_by_count": 38,
      "type": "book",
      "source": null,
      "open_access": {
        "is_oa": false,
        "oa_status": "closed",
        "oa_url": null
      },
      "topics": [
        "Philosophical Ethics and Theory"
      ],
      "referenced_works_count": 281,
      "url": "https://openalex.org/W3020665105"
    },
    {
      "openalex_id": "W2976618462",
      "doi": "10.4324/9781351115865-3",
      "title": "Reasons and theories of sensory affect",
      "authors": [
        {
          "name": "Murat Aydede",
          "openalex_id": "A5074485689",
          "orcid": "https://orcid.org/0000-0001-7503-7885"
        },
        {
          "name": "Matthew Fulkerson",
          "openalex_id": "A5060256903",
          "orcid": "https://orcid.org/0000-0003-0761-5537"
        }
      ],
      "publication_year": 2018,
      "publication_date": "2018-07-11",
      "abstract": "Some sensory experiences are pleasant, some unpleasant. The metaphysics of ­sensory affect is the functional role the sensory information plays in the mental economy of the agent. This chapter looks at the state of art in the philosophy of mind, presents the main contenders, and then critically compares and contrasts them. In particular, it examines how they handle the reason-giving power of affective states. The chapter also looks into two representationalist proposals and a functionalist proposal and argues that, contrary to their own advertisements, the representationalist proposals do not adequately account for why and how sensory affect can motivate, rationalize, and justify subsequent behavior and intentional mental activity. It shows that the functionalist proposal does a much better job in this regard, and that when the representationalist proposals are modified to do a better job, they may fare better not because of their representationalist credentials but due to their functionalist ones.",
      "cited_by_count": 35,
      "type": "book-chapter",
      "source": null,
      "open_access": {
        "is_oa": true,
        "oa_status": "gold",
        "oa_url": "https://api.taylorfrancis.com/content/chapters/edit/download?identifierName=doi&identifierValue=10.4324/9781351115865-3&type=chapterpdf"
      },
      "topics": [
        "Philosophy and Theoretical Science",
        "Embodied and Extended Cognition",
        "Aesthetic Perception and Analysis"
      ],
      "referenced_works_count": 111,
      "url": "https://openalex.org/W2976618462"
    },
    {
      "openalex_id": "W3108284025",
      "doi": "10.1007/s11229-020-02938-z",
      "title": "Hybrid collective intentionality",
      "authors": [
        {
          "name": "Thomas N. P. A. Brouwer",
          "openalex_id": "A5014723720",
          "orcid": "https://orcid.org/0000-0003-2804-7428",
          "institutions": [
            "University of Leeds"
          ]
        },
        {
          "name": "Roberta Ferrario",
          "openalex_id": "A5081432914",
          "orcid": "https://orcid.org/0000-0002-9175-3096",
          "institutions": [
            "Istituto di Scienza e Tecnologie dell'Informazione \"Alessandro Faedo\""
          ]
        },
        {
          "name": "Daniele Porello",
          "openalex_id": "A5017945984",
          "orcid": "https://orcid.org/0000-0003-3655-0218",
          "institutions": [
            "Istituto di Scienza e Tecnologie dell'Informazione \"Alessandro Faedo\""
          ]
        }
      ],
      "publication_year": 2020,
      "publication_date": "2020-11-22",
      "abstract": null,
      "cited_by_count": 21,
      "type": "article",
      "source": {
        "name": "Synthese",
        "type": "journal",
        "issn": [
          "0039-7857",
          "1573-0964"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "hybrid",
        "oa_url": "https://link.springer.com/content/pdf/10.1007/s11229-020-02938-z.pdf"
      },
      "topics": [
        "Psychology of Moral and Emotional Judgment",
        "Free Will and Agency",
        "Epistemology, Ethics, and Metaphysics"
      ],
      "referenced_works_count": 52,
      "url": "https://openalex.org/W3108284025"
    },
    {
      "openalex_id": "W2909017487",
      "doi": "10.4324/9781315676982-20",
      "title": "Consciousness and Intentionality",
      "authors": [
        {
          "name": "David Pitt",
          "openalex_id": "A5061852219"
        }
      ],
      "publication_year": 2018,
      "publication_date": "2018-03-15",
      "abstract": "Consciousness is extremely difficult to explain within the naturalist framework that has prevailed in analytic philosophy of mind for most of the twentieth century, and into the twenty-first. Intentionality, on the other hand, insofar as it is a phenomenon that is not essentially tied to consciousness, was seen to be more tractable, and various theories grounding it in or reducing it to natural relations between the brain and the world it represents were proposed and developed. There is a common point to be made about the role of phenomenology in determining conceptual and perceptual intentionality (content). The diagnosis offered by advocates of phenomenal intentionality is that such difficulties are bound to arise whenever the intrinsic properties of representations are ignored. In spite of the fact that consciousness and phenomenality stubbornly resist naturalistic explanation, no theory of intentionality can afford to ignore them.",
      "cited_by_count": 18,
      "type": "book-chapter",
      "source": null,
      "open_access": {
        "is_oa": true,
        "oa_status": "gold",
        "oa_url": "https://api.taylorfrancis.com/content/chapters/edit/download?identifierName=doi&identifierValue=10.4324/9781315676982-20&type=chapterpdf"
      },
      "topics": [
        "Classical Philosophy and Thought"
      ],
      "referenced_works_count": 1,
      "url": "https://openalex.org/W2909017487"
    },
    {
      "openalex_id": "W145404667",
      "doi": "10.4324/9781315728476",
      "title": "Wittgenstein and Perception",
      "authors": [
        {
          "name": "Michael Campbell",
          "openalex_id": "A5066982610",
          "orcid": "https://orcid.org/0000-0003-2156-2179"
        },
        {
          "name": "Michael O’Sullivan",
          "openalex_id": "A5085564561",
          "orcid": "https://orcid.org/0000-0002-2869-4580"
        }
      ],
      "publication_year": 2015,
      "publication_date": "2015-02-11",
      "abstract": "Throughout his career, Wittgenstein was preoccupied with issues in the philosophy of perception. Despite this, little attention has been paid to this aspect of Wittgenstein's work. This volume redresses this lack, by bringing together an international group of leading philosophers to focus on the impact of Wittgenstein's work on the philosophy of perception. The ten specially commissioned chapters draw on the complete range of Wittgenstein's writings, from his earliest to latest extant works, and combine both exegetical approaches with engagements with contemporary philosophy of mind. Topics covered include: • perception and judgement in the Tractatus • aspect-perception • the putative intentionality of perception • representationalism. The book also includes an overview which summarises the evolution of Wittgenstein's views on perception throughout his life. With an outstanding array of contributors, Wittgenstein and Perception is essential reading for students and scholars of Wittgenstein's work, as well as those working in philosophy of mind and philosophy of perception.",
      "cited_by_count": 22,
      "type": "book",
      "source": null,
      "open_access": {
        "is_oa": false,
        "oa_status": "closed",
        "oa_url": null
      },
      "topics": [
        "Wittgensteinian philosophy and applications"
      ],
      "referenced_works_count": 1,
      "url": "https://openalex.org/W145404667"
    },
    {
      "openalex_id": "W4298316416",
      "doi": "10.4324/9780203485583",
      "title": "Theories of Consciousness",
      "authors": [
        {
          "name": "William Seager",
          "openalex_id": "A5109550524"
        }
      ],
      "publication_year": 2016,
      "publication_date": "2016-02-12",
      "abstract": "Despite recent strides in neuroscience and psychology that have deepened understanding of the brain, consciousness remains one of the greatest philosophical and scientific puzzles. The second edition of Theories of Consciousness: An Introduction and Assessment provides a fresh and up-to-date introduction to a variety of approaches to consciousness, and contributes to the current lively debate about the nature of consciousness and whether a scientific understanding of it is possible. After an initial overview of the status and prospects of physicalism in the face of the problem of consciousness, William Seager explores key themes from Descartes - the founder of the modern problem of consciousness. He then turns to the most important theories of consciousness: identity theories and the generation problem higher-order thought theories of consciousness self-representational theories of consciousness Daniel Dennett's theory of consciousness attention-based theories of consciousness representational theories of consciousness conscious intentionality panpsychism neutral monism. Thoroughly revised and expanded throughout, this second edition includes new chapters on animal consciousness, reflexive consciousness, combinatorial forms of panpsychism and neutral monism, as well as a significant new chapter on physicalism, emergence and consciousness. The book's broad scope, depth of coverage and focus on key philosophical positions and arguments make it an indispensable text for those teaching or studying philosophy of mind and psychology. It is also an excellent resource for those working in related fields such as cognitive science and the neuroscience of consciousness.",
      "cited_by_count": 63,
      "type": "book",
      "source": null,
      "open_access": {
        "is_oa": false,
        "oa_status": "closed",
        "oa_url": null
      },
      "topics": [
        "Classical Philosophy and Thought"
      ],
      "referenced_works_count": 0,
      "url": "https://openalex.org/W4298316416"
    },
    {
      "openalex_id": "W2703365991",
      "doi": "10.3389/fpsyg.2017.01084",
      "title": "The Five Marks of the Mental",
      "authors": [
        {
          "name": "Tuomas K. Pernu",
          "openalex_id": "A5066589711",
          "orcid": "https://orcid.org/0000-0002-6668-6127",
          "institutions": [
            "University of Helsinki",
            "King's College London"
          ]
        }
      ],
      "publication_year": 2017,
      "publication_date": "2017-07-07",
      "abstract": "The mental realm seems different to the physical realm; the mental is thought to be dependent on, yet distinct from the physical. But how, exactly, are the two realms supposed to be different, and what, exactly, creates the seemingly insurmountable juxtaposition between the mental and the physical? This review identifies and discusses five marks of the mental, features that set characteristically mental phenomena apart from the characteristically physical phenomena. These five marks (intentionality, consciousness, free will, teleology, and normativity) are not presented as a set of features that define mentality. Rather, each of them is something we seem to associate with phenomena we consider mental, and each of them seems to be in tension with the physical view of reality in its own particular way. It is thus suggested how there is no single mind-body problem, but a set of distinct but interconnected problems. Each of these separate problems is analyzed, and their differences, similarities and connections are identified. This provides a useful basis for future theoretical work on psychology and philosophy of mind, that until now has too often suffered from unclarities, inadequacies, and conflations.",
      "cited_by_count": 27,
      "type": "review",
      "source": {
        "name": "Frontiers in Psychology",
        "type": "journal",
        "issn": [
          "1664-1078"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "gold",
        "oa_url": "https://www.frontiersin.org/articles/10.3389/fpsyg.2017.01084/pdf"
      },
      "topics": [
        "Philosophy and Theoretical Science",
        "Mental Health and Psychiatry",
        "Free Will and Agency"
      ],
      "referenced_works_count": 248,
      "url": "https://openalex.org/W2703365991"
    },
    {
      "openalex_id": "W4223592710",
      "doi": "10.4324/9781003174103",
      "title": "Autonomy, Enactivism, and Mental Disorder",
      "authors": [
        {
          "name": "Michelle Maiese",
          "openalex_id": "A5053389217",
          "orcid": "https://orcid.org/0000-0003-4039-4561"
        }
      ],
      "publication_year": 2022,
      "publication_date": "2022-04-12",
      "abstract": "This book brings together insights from the enactivist approach in philosophy of mind and existing work on autonomous agency from both philosophy of action and feminist philosophy. It then utilizes this proposed account of autonomous agency to make sense of the impairments in agency that commonly occur in cases of dissociative identity disorder, mood disorders, and psychopathy. While much of the existing philosophical work on autonomy focuses on threats that come from outside the agent, this book addresses how inner conflict, instability of character, or motivational issues can disrupt agency. In the first half of the book, the author conceptualizes what it means to be self-governing and to exercise autonomous agency. In the second half, she investigates the extent to which agents with various forms of mental disorder are capable of exercising autonomy. In her view, many forms of mental disorder involve disruptions to self-governance, so that agents lack sufficient control over their intentional behavior or are unable to formulate and execute coherent action plans. However, this does not mean that they are utterly incapable of autonomous agency; rather, their ability to exercise this capacity is compromised in important respects. Understanding these agential impairments can help to deepen our understanding of what it means to exercise autonomy, and also devise more effective treatments that restore subjects' agency. Autonomy, Enactivism, and Mental Disorder will be of interest to researchers and advanced students working in philosophy of mind, philosophy of action, philosophy of psychiatry, and feminist philosophy.",
      "cited_by_count": 27,
      "type": "book",
      "source": null,
      "open_access": {
        "is_oa": false,
        "oa_status": "closed",
        "oa_url": null
      },
      "topics": [
        "Mental Health and Psychiatry",
        "Neuroethics, Human Enhancement, Biomedical Innovations",
        "Philosophy and History of Science"
      ],
      "referenced_works_count": 0,
      "url": "https://openalex.org/W4223592710"
    }
  ],
  "count": 30,
  "errors": []
}
