{
  "status": "success",
  "source": "openalex",
  "query": "symbol grounding problem critique",
  "results": [
    {
      "openalex_id": "W2023015865",
      "doi": "10.3758/bf03196322",
      "title": "Six views of embodied cognition",
      "authors": [
        {
          "name": "Margaret Wilson",
          "openalex_id": "A5101055987",
          "institutions": [
            "University of California, Santa Cruz"
          ]
        }
      ],
      "publication_year": 2002,
      "publication_date": "2002-12-01",
      "abstract": null,
      "cited_by_count": 4313,
      "type": "review",
      "source": {
        "name": "Psychonomic Bulletin & Review",
        "type": "journal",
        "issn": [
          "1069-9384",
          "1531-5320"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "bronze",
        "oa_url": "https://link.springer.com/content/pdf/10.3758/BF03196322.pdf"
      },
      "topics": [
        "Action Observation and Synchronization",
        "Language, Metaphor, and Cognition",
        "Embodied and Extended Cognition"
      ],
      "referenced_works_count": 129,
      "url": "https://openalex.org/W2023015865"
    },
    {
      "openalex_id": "W2114766444",
      "doi": "10.1111/j.1756-8765.2010.01115.x",
      "title": "Grounded Cognition: Past, Present, and Future",
      "authors": [
        {
          "name": "Lawrence W. Barsalou",
          "openalex_id": "A5078508282",
          "orcid": "https://orcid.org/0000-0002-1232-3152",
          "institutions": [
            "Emory University"
          ]
        }
      ],
      "publication_year": 2010,
      "publication_date": "2010-09-07",
      "abstract": "Thirty years ago, grounded cognition had roots in philosophy, perception, cognitive linguistics, psycholinguistics, cognitive psychology, and cognitive neuropsychology. During the next 20 years, grounded cognition continued developing in these areas, and it also took new forms in robotics, cognitive ecology, cognitive neuroscience, and developmental psychology. In the past 10 years, research on grounded cognition has grown rapidly, especially in cognitive neuroscience, social neuroscience, cognitive psychology, social psychology, and developmental psychology. Currently, grounded cognition appears to be achieving increased acceptance throughout cognitive science, shifting from relatively minor status to increasing importance. Nevertheless, researchers wonder whether grounded mechanisms lie at the heart of the cognitive system or are peripheral to classic symbolic mechanisms. Although grounded cognition is currently dominated by demonstration experiments in the absence of well-developed theories, the area is likely to become increasingly theory driven over the next 30 years. Another likely development is the increased incorporation of grounding mechanisms into cognitive architectures and into accounts of classic cognitive phenomena. As this incorporation occurs, much functionality of these architectures and phenomena is likely to remain, along with many original mechanisms. Future theories of grounded cognition are likely to be heavily influenced by both cognitive neuroscience and social neuroscience, and also by developmental science and robotics. Aspects from the three major perspectives in cognitive science-classic symbolic architectures, statistical/dynamical systems, and grounded cognition-will probably be integrated increasingly in future theories, each capturing indispensable aspects of intelligence.",
      "cited_by_count": 940,
      "type": "review",
      "source": {
        "name": "Topics in Cognitive Science",
        "type": "journal",
        "issn": [
          "1756-8757",
          "1756-8765"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "bronze",
        "oa_url": "https://onlinelibrary.wiley.com/doi/pdfdirect/10.1111/j.1756-8765.2010.01115.x"
      },
      "topics": [
        "Action Observation and Synchronization",
        "Language and cultural evolution",
        "Language, Metaphor, and Cognition"
      ],
      "referenced_works_count": 86,
      "url": "https://openalex.org/W2114766444"
    },
    {
      "openalex_id": "W4309930795",
      "doi": "10.3389/fncom.2022.642397",
      "title": "Integrated world modeling theory expanded: Implications for the future of consciousness",
      "authors": [
        {
          "name": "Adam Safron",
          "openalex_id": "A5059737776",
          "orcid": "https://orcid.org/0000-0002-3102-7623",
          "institutions": [
            "Johns Hopkins University",
            "Indiana University Bloomington"
          ]
        }
      ],
      "publication_year": 2022,
      "publication_date": "2022-11-24",
      "abstract": "Integrated world modeling theory (IWMT) is a synthetic theory of consciousness that uses the free energy principle and active inference (FEP-AI) framework to combine insights from integrated information theory (IIT) and global neuronal workspace theory (GNWT). Here, I first review philosophical principles and neural systems contributing to IWMT’s integrative perspective. I then go on to describe predictive processing models of brains and their connections to machine learning architectures, with particular emphasis on autoencoders (perceptual and active inference), turbo-codes (establishment of shared latent spaces for multi-modal integration and inferential synergy), and graph neural networks (spatial and somatic modeling and control). Future directions for IIT and GNWT are considered by exploring ways in which modules and workspaces may be evaluated as both complexes of integrated information and arenas for iterated Bayesian model selection. Based on these considerations, I suggest novel ways in which integrated information might be estimated using concepts from probabilistic graphical models, flow networks, and game theory. Mechanistic and computational principles are also considered with respect to the ongoing debate between IIT and GNWT regarding the physical substrates of different kinds of conscious and unconscious phenomena. I further explore how these ideas might relate to the “Bayesian blur problem,” or how it is that a seemingly discrete experience can be generated from probabilistic modeling, with some consideration of analogies from quantum mechanics as potentially revealing different varieties of inferential dynamics. I go on to describe potential means of addressing critiques of causal structure theories based on network unfolding, and the seeming absurdity of conscious expander graphs (without cybernetic symbol grounding). Finally, I discuss future directions for work centered on attentional selection and the evolutionary origins of consciousness as facilitated “unlimited associative learning.” While not quite solving the Hard problem, this article expands on IWMT as a unifying model of consciousness and the potential future evolution of minds.",
      "cited_by_count": 27,
      "type": "article",
      "source": {
        "name": "Frontiers in Computational Neuroscience",
        "type": "journal",
        "issn": [
          "1662-5188"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "gold",
        "oa_url": "https://doi.org/10.3389/fncom.2022.642397"
      },
      "topics": [
        "Neural dynamics and brain function",
        "Functional Brain Connectivity Studies",
        "Embodied and Extended Cognition"
      ],
      "referenced_works_count": 248,
      "url": "https://openalex.org/W4309930795"
    },
    {
      "openalex_id": "W2151020819",
      "doi": "10.2307/25148742",
      "title": "The Nature of Theory in Information Systems1",
      "authors": [
        {
          "name": "Gregor",
          "openalex_id": "A5097615957",
          "institutions": [
            "Australian National University"
          ]
        }
      ],
      "publication_year": 2006,
      "publication_date": "2006-09-01",
      "abstract": "The aim of this research essay is to examine the structural nature of theory in Information Systems. Despite the importance of theory, questions relating to its form and structure are neglected in comparison with questions relating to epistemology. The essay addresses issues of causality, explanation, prediction, and generalization that underlie an understanding of theory. A taxonomy is proposed that classifies information systems theories with respect to the manner in which four central goals are addressed: analysis, explanation, prediction, and prescription. Five interrelated types of theory are distinguished: (1) theory for analyzing, (2) theory for explaining, (3) theory for predicting, (4) theory for explaining and predicting, and (5) theory for design and action. Examples illustrate the nature of each theory type. The applicability of the taxonomy is demonstrated by classifying a sample of journal articles. The paper contributes by showing that multiple views of theory exist and by exposing the assumptions underlying different viewpoints. In addition, it is suggested that the type of theory under development can influence the choice of an epistemological approach. Support is given for the legitimacy and value of each theory type. The building of integrated bodies of theory that encompass all theory types is advocated.",
      "cited_by_count": 3147,
      "type": "article",
      "source": {
        "name": "MIS Quarterly",
        "type": "journal",
        "issn": [
          "0276-7783",
          "2162-9730"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "green",
        "oa_url": "https://openresearch-repository.anu.edu.au/bitstreams/77077d0f-f636-40a8-89fb-d2d2365ad7ad/download"
      },
      "topics": [
        "Information Systems Theories and Implementation",
        "Business Process Modeling and Analysis",
        "Big Data and Business Intelligence"
      ],
      "referenced_works_count": 106,
      "url": "https://openalex.org/W2151020819"
    },
    {
      "openalex_id": "W2475426101",
      "doi": "10.1186/s40594-016-0046-z",
      "title": "A conceptual framework for integrated STEM education",
      "authors": [
        {
          "name": "Todd R. Kelley",
          "openalex_id": "A5017952091",
          "orcid": "https://orcid.org/0000-0001-6086-1927"
        },
        {
          "name": "J. Geoff Knowles",
          "openalex_id": "A5077139932",
          "orcid": "https://orcid.org/0000-0001-6696-058X",
          "institutions": [
            "Ivy Tech Community College of Indiana"
          ]
        }
      ],
      "publication_year": 2016,
      "publication_date": "2016-07-18",
      "abstract": "The global urgency to improve STEM education may be driven by environmental and social impacts of the twenty-first century which in turn jeopardizes global security and economic stability. The complexity of these global factors reach beyond just helping students achieve high scores in math and science assessments. Friedman (The world is flat: A brief history of the twenty-first century, 2005) helped illustrate the complexity of a global society, and educators must help students prepare for this global shift. In response to these challenges, the USA experienced massive STEM educational reforms in the last two decades. In practice, STEM educators lack cohesive understanding of STEM education. Therefore, they could benefit from a STEM education conceptual framework. The process of integrating science, technology, engineering, and mathematics in authentic contexts can be as complex as the global challenges that demand a new generation of STEM experts. Educational researchers indicate that teachers struggle to make connections across the STEM disciplines. Consequently, students are often disinterested in science and math when they learn in an isolated and disjoined manner missing connections to crosscutting concepts and real-world applications. The following paper will operationalize STEM education key concepts and blend learning theories to build an integrated STEM education framework to assist in further researching integrated STEM education.",
      "cited_by_count": 1605,
      "type": "article",
      "source": {
        "name": "International Journal of STEM Education",
        "type": "journal",
        "issn": [
          "2196-7822"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "gold",
        "oa_url": "https://stemeducationjournal.springeropen.com/track/pdf/10.1186/s40594-016-0046-z"
      },
      "topics": [
        "Science Education and Pedagogy",
        "Experimental Learning in Engineering",
        "Teaching and Learning Programming"
      ],
      "referenced_works_count": 70,
      "url": "https://openalex.org/W2475426101"
    },
    {
      "openalex_id": "W2222080613",
      "doi": "10.1017/s1742058x13000349",
      "title": "INTERSECTIONALITY",
      "authors": [
        {
          "name": "Devon W. Carbado",
          "openalex_id": "A5058287939",
          "institutions": [
            "University of California, Los Angeles"
          ]
        },
        {
          "name": "Kimberlé W. Crenshaw",
          "openalex_id": "A5084078930",
          "institutions": [
            "University of California, Los Angeles"
          ]
        },
        {
          "name": "Vickie M. Mays",
          "openalex_id": "A5023443927",
          "orcid": "https://orcid.org/0000-0002-3395-7939",
          "institutions": [
            "University of California, Los Angeles"
          ]
        },
        {
          "name": "Barbara Tomlinson",
          "openalex_id": "A5058550531",
          "institutions": [
            "University of California, Santa Barbara"
          ]
        }
      ],
      "publication_year": 2013,
      "publication_date": "2013-01-01",
      "abstract": "Very few theories have generated the kind of interdisciplinary and global engagement that marks the intellectual history of intersectionality. Yet, there has been very little effort to reflect upon precisely how intersectionality has moved across time, disciplines, issues, and geographic and national boundaries. Our failure to attend to intersectionality's movement has limited our ability to see the theory in places in which it is already doing work and to imagine other places to which the theory might be taken. Addressing these questions, this special issue reflects upon the genesis of intersectionality, engages some of the debates about its scope and theoretical capacity, marks some of its disciplinary and global travels, and explores the future trajectory of the theory. To do so, the volume includes academics from across the disciplines and from outside of the United States. Their respective contributions help us to understand how intersectionality has moved and to broaden our sense of where the theory might still go.",
      "cited_by_count": 950,
      "type": "article",
      "source": {
        "name": "Du Bois Review Social Science Research on Race",
        "type": "journal",
        "issn": [
          "1742-058X",
          "1742-0598"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "bronze",
        "oa_url": "https://www.cambridge.org/core/services/aop-cambridge-core/content/view/1E5E73E8E54A487B4CCFE85BB299D0E6/S1742058X13000349a.pdf/div-class-title-intersectionality-div.pdf"
      },
      "topics": [
        "LGBTQ Health, Identity, and Policy",
        "Historical Gender and Feminism Studies",
        "Feminism, Gender, and Sexuality Studies"
      ],
      "referenced_works_count": 2,
      "url": "https://openalex.org/W2222080613"
    },
    {
      "openalex_id": "W2160490388",
      "doi": "10.1080/17493460600844157",
      "title": "The semantic turn: A new foundation for design",
      "authors": [
        {
          "name": "Pelle Ehn",
          "openalex_id": "A5092918859"
        }
      ],
      "publication_year": 2007,
      "publication_date": "2007-04-01",
      "abstract": "History and Aim Brief History of Product Semantics Trajectory of Artificiality The Changing Environment of Design Redesigning Design (Discourse) Basic concepts of human-centered design Predecessors The Axiomaticity of Meaning Sense, Meaning, and Context Stakeholders in Design Second-Order Understanding Ethics in a Design Culture Meaning of Artifacts in Use Interfaces Disruptions and Usability Recognition Explorations Reliance Design Principles Meaning of Artifacts in Language Language Categories Characters Identities Verbal Metaphors Narratives Culture Meanings in the Lives of Artifacts Life Cycles Stakeholder Networks Projects Genetic Meanings Critical Sizes of Supportive Communities Whole Life Cycle Accounting Meanings in an Ecology of Artifacts Ecology Ecology of Artifacts Ecological Meanings Technological Cooperatives Mythology Design methods, research, and a science for design A New Science for Design Methods for Creating Spaces of Possible Futures Methods for Inquiring into Stakeholders' Concepts and Motivations Human-Centered Design Methods Validating Semantic Claims Advancing Design Discourse Distantiations Semiotics Cognitivism Ergonomics Aesthetics Functionalism Marketing Textualism Roots in the Ulm School of Design? Bill's Functionalism Bense's Information Philosophy Maldonado's Semiotics Chernyshevsky's Political Economy of Aesthetics Rittel's Methodology Barriers to Considerations of Meaning and Some Exceptions REFERENCES INDEX",
      "cited_by_count": 917,
      "type": "article",
      "source": {
        "name": "Artifact",
        "type": "journal",
        "issn": [
          "1749-3463",
          "1749-3471"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "diamond",
        "oa_url": "https://scholarworks.iu.edu/journals/index.php/artifact/article/download/1300/1348"
      },
      "topics": [
        "Design Education and Practice"
      ],
      "referenced_works_count": 4,
      "url": "https://openalex.org/W2160490388"
    },
    {
      "openalex_id": "W3187248581",
      "doi": "10.1007/s13347-010-0005-4",
      "title": "Bootstrapping Normativity",
      "authors": [
        {
          "name": "Graham White",
          "openalex_id": "A5103597589",
          "institutions": [
            "Queen Mary University of London"
          ]
        }
      ],
      "publication_year": 2010,
      "publication_date": "2010-12-29",
      "abstract": null,
      "cited_by_count": 3,
      "type": "article",
      "source": {
        "name": "Philosophy & Technology",
        "type": "journal",
        "issn": [
          "2210-5433",
          "2210-5441"
        ]
      },
      "open_access": {
        "is_oa": false,
        "oa_status": "closed",
        "oa_url": null
      },
      "topics": [
        "Language and cultural evolution",
        "Evolutionary Game Theory and Cooperation",
        "Philosophy and History of Science"
      ],
      "referenced_works_count": 35,
      "url": "https://openalex.org/W3187248581"
    },
    {
      "openalex_id": "W4210357581",
      "doi": "10.5325/jworlchri.11.2.0305",
      "title": "Relocating World Christianity: Interdisciplinary Studies in Universal and Local Expressions of the Christian Faith",
      "authors": [
        {
          "name": "Devaka Premawardhana",
          "openalex_id": "A5051229738",
          "orcid": "https://orcid.org/0000-0002-7469-0660",
          "institutions": [
            "Emory University"
          ]
        }
      ],
      "publication_year": 2021,
      "publication_date": "2021-08-01",
      "abstract": "Relocating World Christianity makes one of the most robust theoretical interventions into scholarship on World Christianity since the field first took shape through the efforts of missiologists and theologians. Without denying the value of existing approaches, this volume makes the case for a wider interdisciplinarity that encompasses history, anthropology, and political science, and draws on recent shifts within these disciplines to overcome what, in the introduction, editors Joel Cabrita and David Maxwell present as World Christianity’s fundamental shortcoming: its excessive privileging of place-bound localities and cultural particularities. The problem is World Christianity’s grounding in area studies assumptions born of what Cabrita and Maxwell describe as Western scholars’ and churches’ postcolonial guilt over European imperialism and its ties to Christian expansion. While acknowledging the value of localized studies, Cabrita and Maxwell argue that World Christianity has so far mostly missed the large-scale connections and worldwide flows that matter not only empirically, but also to many Christians’ own perceptions of themselves as members of a universal body. The dominant tendency of compartmentalizing Christianities, treating them as self-contained units runs the risk of reifying local cultures. It also reflects recent theological emphases on incarnation and inculturation at the expense of longer-standing Christian themes of unity and transcendence—as the volume’s other editor, Emma Wild-Wood, argues in the afterword.The fulsome, learned introduction to this volume will surely become required reading for scholars and students of World Christianity. Among the twelve chapters that follow—all by reputable scholars—readers will find compelling evidence in support of the editors’ main thesis. Those chapters are thoughtfully divided into four thematic sections. The first, titled “Connections and Comparisons,” focuses on the interlocking linkages of Christian communities across different parts of the world. The second, “Locating Knowledge,” emphasizes the importance of place in the construction of knowledge about Christianity. It is hard not to see this section as at odds with the overall thrust of the editorial introduction. Peter Phan’s chapter, for example, emphasizes the necessarily contextualized, indigenized, and inculturated dimensions of Christian faith, though not without also gesturing toward cross-continental theological exchanges. In the third section, titled “Place and Belonging in World Christianity,” chapters are concerned with the multiscalar manifestations of Christianity, equally local and translocal, culturalist and connected, nationalist and networked. The fourth section, “Migration and Diaspora,” returns readers squarely to the global scale, to the transnational conduits and symbols through which Christian communities create and sustain themselves along migratory routes.Readers may find dizzying the multiple scales of focus through which they must pass in proceeding from one chapter, and especially from one section, to the next. But what those multiple scales clarify is that attention to the local is not to be altogether discounted. Why, then, the need to contrast so starkly this volume’s approach with previous approaches? There is an unusually polemical tone to the introduction, for example, when it insinuates that site-specific studies reveal “a fetishistic commitment to regional particularity” (21) and are motivated by “normative” and “ideological” agendas such as postcolonial anxieties and anti-imperial politics. Surely the new paradigm proposed here is not itself value-free or ideologically neutral. Analytical trends change with political currents, and though globalization was very recently regnant, the tide has already shifted with the resurgence of nationalist, antiglobalist sentiment (consider Trumpism and Brexit, for example). This calls into question any suggestion that localized frames are historically contingent and ideologically driven in a way that transnational frames are not.As for the major argument of the editorial introduction, World Christianity scholars would likely contest the characterization of their work as insufficiently attentive to the connective and comparative; indeed, the reason most write of World Christianity and not World Christianities seems precisely to emphasize unity alongside diversity. But even within this volume—particularly in the middle two sections—it is clear that networks mean nothing without nodes. How, then, to draw the line between a fair and a fetishized treatment of the local?My own concern is that an overemphasis on the macro-scale potentially slides too easily into homogenizing and universalizing accounts by licensing avoidance of locally grounded, deeply contextualized, linguistically attuned, and empirically detailed inquiry—so long as one attends to the transnational flows and networks now enjoying analytical currency. Occasionally in the introduction, often in the chapters, and importantly in the book’s subtitle, this volume reveals how the local and the universal complement rather than compete with each other, how variegated Christian communities coexist with global faith networks. This is where the volume is at its best.Where it also shines is in its naming and, through particular chapters, correcting of a secondary set of unexamined biases in World Christianity scholarship: toward Africa, toward Protestantism, and toward triumphalist accounts of Christian growth. In sum, this is a landmark volume that carefully historicizes the field of World Christianity and boldly charts new analytical directions. Specialists will debate whether the critiques of existing scholarship are justified, but there will be no dispute that the critiques, and the proposed corrections, must be taken seriously.",
      "cited_by_count": 58,
      "type": "article",
      "source": {
        "name": "Journal of World Christianity",
        "type": "journal",
        "issn": [
          "1943-1538",
          "2377-8784"
        ]
      },
      "open_access": {
        "is_oa": false,
        "oa_status": "closed",
        "oa_url": null
      },
      "topics": [
        "Christian Theology and Mission",
        "Religion, Society, and Development"
      ],
      "referenced_works_count": 0,
      "url": "https://openalex.org/W4210357581"
    },
    {
      "openalex_id": "W2112184938",
      "doi": "10.1613/jair.4135",
      "title": "Multimodal Distributional Semantics",
      "authors": [
        {
          "name": "Elia Bruni",
          "openalex_id": "A5007465102",
          "institutions": [
            "University of Trento"
          ]
        },
        {
          "name": "Nam K. Tran",
          "openalex_id": "A5081833996",
          "orcid": "https://orcid.org/0000-0003-1565-0025",
          "institutions": [
            "L3S Research Center"
          ]
        },
        {
          "name": "Marco Baroni",
          "openalex_id": "A5038612405",
          "orcid": "https://orcid.org/0000-0001-5066-3580",
          "institutions": [
            "University of Trento"
          ]
        }
      ],
      "publication_year": 2014,
      "publication_date": "2014-01-23",
      "abstract": "Distributional semantic models derive computational representations of word meaning from the patterns of co-occurrence of words in text. Such models have been a success story of computational linguistics, being able to provide reliable estimates of semantic relatedness for the many semantic tasks requiring them. However, distributional models extract meaning information exclusively from text, which is an extremely impoverished basis compared to the rich perceptual sources that ground human semantic knowledge. We address the lack of perceptual grounding of distributional models by exploiting computer vision techniques that automatically identify discrete \u0093visual words\u0094 in images, so that the distributional representation of a word can be extended to also encompass its co-occurrence with the visual words of images it is associated with. We propose a flexible architecture to integrate text- and image-based distributional information, and we show in a set of empirical tests that our integrated model is superior to the purely text-based approach, and it provides somewhat complementary semantic information with respect to the latter.",
      "cited_by_count": 925,
      "type": "article",
      "source": {
        "name": "Journal of Artificial Intelligence Research",
        "type": "journal",
        "issn": [
          "1076-9757",
          "1943-5037"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "diamond",
        "oa_url": "https://www.jair.org/index.php/jair/article/download/10857/25905"
      },
      "topics": [
        "Multimodal Machine Learning Applications",
        "Advanced Image and Video Retrieval Techniques",
        "Domain Adaptation and Few-Shot Learning"
      ],
      "referenced_works_count": 166,
      "url": "https://openalex.org/W2112184938"
    },
    {
      "openalex_id": "W2120409145",
      "doi": "10.1017/s0272263102002024",
      "title": "FREQUENCY EFFECTS IN LANGUAGE PROCESSING",
      "authors": [
        {
          "name": "Nick C. Ellis",
          "openalex_id": "A5039969309",
          "orcid": "https://orcid.org/0000-0002-4235-6481",
          "institutions": [
            "University College of the North",
            "Bangor University"
          ]
        }
      ],
      "publication_year": 2002,
      "publication_date": "2002-06-01",
      "abstract": "This article shows how language processing is intimately tuned to input frequency. Examples are given of frequency effects in the processing of phonology, phonotactics, reading, spelling, lexis, morphosyntax, formulaic language, language comprehension, grammaticality, sentence production, and syntax. The implications of these effects for the representations and developmental sequence of SLA are discussed. Usage-based theories hold that the acquisition of language is exemplar based. It is the piecemeal learning of many thousands of constructions and the frequency-biased abstraction of regularities within them. Determinants of pattern productivity include the power law of practice, cue competition and constraint satisfaction, connectionist learning, and effects of type and token frequency. The regularities of language emerge from experience as categories and prototypical patterns. The typical route of emergence of constructions is from formula, through low-scope pattern, to construction. Frequency plays a large part in explaining sociolinguistic variation and language change. Learners' sensitivity to frequency in all these domains has implications for theories of implicit and explicit learning and their interactions. The review concludes by considering the history of frequency as an explanatory concept in theoretical and applied linguistics, its 40 years of exile, and its necessary reinstatement as a bridging variable that binds the different schools of language acquisition research.",
      "cited_by_count": 2134,
      "type": "article",
      "source": {
        "name": "Studies in Second Language Acquisition",
        "type": "journal",
        "issn": [
          "0272-2631",
          "1470-1545"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "bronze",
        "oa_url": "https://www.cambridge.org/core/services/aop-cambridge-core/content/view/C4A2C08A0900E306078B9819D7ABF428/S0272263102002024a.pdf/div-class-title-frequency-effects-in-language-processing-div.pdf"
      },
      "topics": [
        "Reading and Literacy Development",
        "EFL/ESL Teaching and Learning",
        "Language Development and Disorders"
      ],
      "referenced_works_count": 330,
      "url": "https://openalex.org/W2120409145"
    },
    {
      "openalex_id": "W602224805",
      "doi": "10.5860/choice.46-2158",
      "title": "Two bits: the cultural significance of free software",
      "authors": [
        {
          "name": "Christopher Kelty",
          "openalex_id": "A5016045705",
          "orcid": "https://orcid.org/0000-0003-0253-5554"
        }
      ],
      "publication_year": 2008,
      "publication_date": "2008-12-01",
      "abstract": "In Two Bits, Christopher M. Kelty investigates the history and cultural significance of Free Software, revealing the people and practices that have transformed not only software but also music, film, science, and education. Free Software is a set of practices devoted to the collaborative creation of software source code that is made openly and freely available through an unconventional use of copyright law. Kelty explains how these specific practices have reoriented the relations of power around the creation, dissemination, and authorization of all kinds of knowledge. He also makes an important contribution to discussions of public spheres and social imaginaries by demonstrating how Free Software is a \"recursive public\" - a public organized around the ability to build, modify, and maintain the very infrastructure that gives it life in the first place.",
      "cited_by_count": 728,
      "type": "article",
      "source": {
        "name": "Choice Reviews Online",
        "type": "journal",
        "issn": [
          "0009-4978",
          "1523-8253",
          "1943-5975"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "green",
        "oa_url": "https://evols.library.manoa.hawaii.edu/bitstreams/2fcdaed4-bc58-4588-ba72-f094446dd574/download"
      },
      "topics": [
        "Open Source Software Innovations",
        "Digital Games and Media",
        "Copyright and Intellectual Property"
      ],
      "referenced_works_count": 286,
      "url": "https://openalex.org/W602224805"
    },
    {
      "openalex_id": "W2155332470",
      "doi": "10.1370/afm.818",
      "title": "Evaluative Criteria for Qualitative Research in Health Care: Controversies and Recommendations",
      "authors": [
        {
          "name": "Deborah J. Cohen",
          "openalex_id": "A5000351094",
          "orcid": "https://orcid.org/0000-0003-1689-4574",
          "institutions": [
            "University of Dental Medicine",
            "Somerset Medical Center",
            "Johnson University"
          ]
        },
        {
          "name": "Benjamin F. Crabtree",
          "openalex_id": "A5041536527",
          "orcid": "https://orcid.org/0000-0003-2292-6835",
          "institutions": [
            "Johnson University",
            "University of Dental Medicine",
            "Somerset Medical Center"
          ]
        }
      ],
      "publication_year": 2008,
      "publication_date": "2008-07-01",
      "abstract": "Qualitative research is not a unified field. Most manuscript and grant reviewers are not qualitative experts and are likely to embrace a generic set of criteria rather than those relevant to the particular qualitative approach proposed or reported. Reviewers and researchers need to be aware of this tendency and educate health care researchers about the criteria appropriate for evaluating qualitative research from within the theoretical and methodological framework from which it emerges.",
      "cited_by_count": 823,
      "type": "article",
      "source": {
        "name": "The Annals of Family Medicine",
        "type": "journal",
        "issn": [
          "1544-1709",
          "1544-1717"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "diamond",
        "oa_url": "https://www.annfammed.org/content/annalsfm/6/4/331.full.pdf"
      },
      "topics": [
        "Health Policy Implementation Science",
        "Patient Satisfaction in Healthcare",
        "Health Systems, Economic Evaluations, Quality of Life"
      ],
      "referenced_works_count": 176,
      "url": "https://openalex.org/W2155332470"
    },
    {
      "openalex_id": "W3176876316",
      "doi": "10.31234/osf.io/rm5b2",
      "title": "Integrated World Modeling Theory (IWMT) Expanded: Implications for Theories of Consciousness and Artificial Intelligence",
      "authors": [
        {
          "name": "Adam Safron",
          "openalex_id": "A5059737776",
          "orcid": "https://orcid.org/0000-0002-3102-7623"
        }
      ],
      "publication_year": 2021,
      "publication_date": "2021-06-21",
      "abstract": "Integrated World Modeling Theory (IWMT) is a synthetic theory of consciousness that uses the Free Energy Principle and Active Inference (FEP-AI) framework to combine insights from Integrated Information Theory (IIT) and Global Neuronal Workspace Theory (GNWT). Here, I first review philosophical principles and neural systems contributing to IWMT’s integrative perspective. I then go on to describe predictive processing models of brains and their connections to machine learning architectures, with particular emphasis on autoencoders (perceptual and active inference), turbo-codes (establishment of shared latent spaces for multi-modal integration and inferential synergy), and graph neural networks (spatial and somatic modeling and control). Particular emphasis is placed on the hippocampal/entorhinal system, which may provide a source of high-level reasoning via predictive contrasting and generalized navigation, so affording multiple kinds of conscious access. Future directions for IIT and GNWT are considered by exploring ways in which modules and workspaces may be evaluated as both complexes of integrated information and arenas for iterated Bayesian model selection. Based on these considerations, I suggest novel ways in which integrated information might be estimated using concepts from probabilistic graphical models, flow networks, and game theory. Mechanistic and computational principles are also considered with respect to the ongoing debate between IIT and GNWT regarding the physical substrates of different kinds of conscious and unconscious phenomena. I further explore how these ideas might relate to the “Bayesian blur problem”, or how it is that a seemingly discrete experience can be generated from probabilistic modeling, with some consideration of analogies from quantum mechanics as potentially revealing different varieties of inferential dynamics. Finally, I go on to describe parallels between FEP-AI and theories of universal intelligence, including with respect to implications for the future of artificially intelligent systems. Particular emphasis is given to the pioneering work of Schmidhuber and colleagues, who have been designing world modeling architectures for over three decades. These discussions include recurrent computation and its relationships with feedforward processing, including potential means of addressing critiques of causal structure theories based on network unfolding, and the seeming absurdity of conscious expander graphs (without cybernetic symbol grounding). While not quite solving the Hard problem, this article expands on IWMT as a unifying model of consciousness and the potential future evolution of minds.",
      "cited_by_count": 14,
      "type": "preprint",
      "source": null,
      "open_access": {
        "is_oa": true,
        "oa_status": "gold",
        "oa_url": "https://doi.org/10.31234/osf.io/rm5b2"
      },
      "topics": [
        "Cognitive Science and Mapping",
        "Cognitive Science and Education Research"
      ],
      "referenced_works_count": 0,
      "url": "https://openalex.org/W3176876316"
    },
    {
      "openalex_id": "W3081259023",
      "doi": "10.17863/cam.55392",
      "title": "A Christian Ontology of the Flesh: Word, Symbol, Performance",
      "authors": [
        {
          "name": "Rozelle Robson Bosch",
          "openalex_id": "A5058889968",
          "orcid": "https://orcid.org/0000-0002-7107-9153"
        }
      ],
      "publication_year": 2020,
      "publication_date": "2020-01-01",
      "abstract": "Maurice Merleau-Ponty responded to the loss of the body in the wake of Western philosophy after Rene Descartes by constructing a phenomenology of perception and an ontology of the flesh. His voice, although decidedly removed from the religious, is constantly brought into theological debate whether it be Judith Butler’s reading of Merleau-Ponty’s early lectures on Malebranche’s sensuous theology, or a reading of his phenomenology for theologies of embodiment by contemporary philosophers of religion. Within Christian theology, the body has experienced its own loss, or so contemporary critics of the Christian flesh suggest when they cast it as that which is either negated or riddled with dualism. In this line of critique, Paul and Augustine become figureheads for the loss of the Christian body. A new reading of Paul, Augustine and others at the hand of recent scholarship may, however, provide a different angle from which to approach the problem of the flesh. By defining the self as one who is informed by the senses, and thereby relationally ordered to created other and divine, perception becomes a new mode of approaching the Christian body. Here the focus is less on the absence of the body than the absence of a theological grammar of perception. Reading perception in relation to the life, death and resurrection of Christ, the Spirit’s union of the self to Christ and of God’s grounding persons in the life of the Trinity, sets the stage for a uniquely embodied expression of divine presence. Here an embodied theology advances the simultaneous holding of form and content, and of the embodied expression of the divine through word, symbol and performance. A new grammar of perception arises, in this instance, which places the body central to the Christian story and which refuses any binary, dualism or negation.",
      "cited_by_count": 6,
      "type": "dissertation",
      "source": {
        "name": "Apollo (University of Cambridge)",
        "type": "repository",
        "issn": null
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "green",
        "oa_url": "https://www.repository.cam.ac.uk/handle/1810/308301"
      },
      "topics": [
        "Language, Metaphor, and Cognition",
        "Religious Tourism and Spaces"
      ],
      "referenced_works_count": 45,
      "url": "https://openalex.org/W3081259023"
    },
    {
      "openalex_id": "W2309056208",
      "doi": "10.3758/s13423-016-1028-3",
      "title": "On Staying Grounded and Avoiding Quixotic Dead Ends",
      "authors": [
        {
          "name": "Lawrence W. Barsalou",
          "openalex_id": "A5078508282",
          "orcid": "https://orcid.org/0000-0002-1232-3152",
          "institutions": [
            "University of Glasgow"
          ]
        }
      ],
      "publication_year": 2016,
      "publication_date": "2016-04-25",
      "abstract": "The 15 articles in this special issue on The Representation of Concepts illustrate the rich variety of theoretical positions and supporting research that characterize the area. Although much agreement exists among contributors, much disagreement exists as well, especially about the roles of grounding and abstraction in conceptual processing. I first review theoretical approaches raised in these articles that I believe are Quixotic dead ends, namely, approaches that are principled and inspired but likely to fail. In the process, I review various theories of amodal symbols, their distortions of grounded theories, and fallacies in the evidence used to support them. Incorporating further contributions across articles, I then sketch a theoretical approach that I believe is likely to be successful, which includes grounding, abstraction, flexibility, explaining classic conceptual phenomena, and making contact with real-world situations. This account further proposes that (1) a key element of grounding is neural reuse, (2) abstraction takes the forms of multimodal compression, distilled abstraction, and distributed linguistic representation (but not amodal symbols), and (3) flexible context-dependent representations are a hallmark of conceptual processing.",
      "cited_by_count": 327,
      "type": "review",
      "source": {
        "name": "Psychonomic Bulletin & Review",
        "type": "journal",
        "issn": [
          "1069-9384",
          "1531-5320"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "hybrid",
        "oa_url": "https://link.springer.com/content/pdf/10.3758/s13423-016-1028-3.pdf"
      },
      "topics": [
        "Action Observation and Synchronization",
        "Neurobiology of Language and Bilingualism",
        "Child and Animal Learning Development"
      ],
      "referenced_works_count": 178,
      "url": "https://openalex.org/W2309056208"
    },
    {
      "openalex_id": "W2169571673",
      "doi": "10.17705/1jais.00129",
      "title": "The Anatomy of a Design Theory",
      "authors": [
        {
          "name": "David Jones",
          "openalex_id": "A5057961129",
          "orcid": "https://orcid.org/0000-0001-5743-8562",
          "institutions": [
            "Central Queensland University"
          ]
        },
        {
          "name": "Shirley Gregor",
          "openalex_id": "A5065050260",
          "orcid": "https://orcid.org/0000-0002-0686-8674",
          "institutions": [
            "Australian National University"
          ]
        },
        {
          "name": "Shirley Gregor",
          "openalex_id": "",
          "institutions": [
            "Australian National University"
          ]
        },
        {
          "name": "The Australian National University, Australia",
          "openalex_id": ""
        }
      ],
      "publication_year": 2007,
      "publication_date": "2007-05-01",
      "abstract": "Design work and design knowledge in Information Systems (IS) is important for both research and practice. Yet there has been comparatively little critical attention paid to the problem of specifying design theory so that it can be communicated, justified, and developed cumulatively. In this essay we focus on the structural components or anatomy of design theories in IS as a special class of theory. In doing so, we aim to extend the work of Walls, Widemeyer and El Sawy (1992) on the specification of information systems design theories (ISDT), drawing on other streams of thought on design research and theory to provide a basis for a more systematic and useable formulation of these theories. We identify eight separate components of design theories: (1) purpose and scope, (2) constructs, (3) principles of form and function, (4) artifact mutability, (5) testable propositions, (6) justificatory knowledge (kernel theories), (7) principles of implementation, and (8) an expository instantiation. This specification includes components missing in the Walls et al. adaptation of Dubin (1978) and Simon (1969) and also addresses explicitly problems associated with the role of instantiations and the specification of design theories for methodologies and interventions as well as for products and applications. The essay is significant as the unambiguous establishment of design knowledge as theory gives a sounder base for arguments for the rigor and legitimacy of IS as an applied discipline and for its continuing progress. A craft can proceed with the copying of one example of a design artifact by one artisan after another. A discipline cannot.",
      "cited_by_count": 1317,
      "type": "article",
      "source": {
        "name": "Journal of the Association for Information Systems",
        "type": "journal",
        "issn": [
          "1536-9323"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "bronze",
        "oa_url": "https://aisel.aisnet.org/cgi/viewcontent.cgi?article=1413&context=jais"
      },
      "topics": [
        "Information Systems Theories and Implementation",
        "Usability and User Interface Design",
        "Business Process Modeling and Analysis"
      ],
      "referenced_works_count": 102,
      "url": "https://openalex.org/W2169571673"
    },
    {
      "openalex_id": "W2111977473",
      "doi": "10.3389/fpsyg.2013.00058",
      "title": "Embodied Cognition is Not What you Think it is",
      "authors": [
        {
          "name": "Andrew D. Wilson",
          "openalex_id": "A5045741071",
          "orcid": "https://orcid.org/0000-0002-0459-0728",
          "institutions": [
            "Leeds Beckett University"
          ]
        },
        {
          "name": "Sabrina Golonka",
          "openalex_id": "A5015081811",
          "institutions": [
            "Leeds Beckett University"
          ]
        }
      ],
      "publication_year": 2013,
      "publication_date": "2013-01-01",
      "abstract": "The most exciting hypothesis in cognitive science right now is the theory that cognition is embodied. Like all good ideas in cognitive science, however, embodiment immediately came to mean six different things. The most common definitions involve the straight-forward claim that \"states of the body modify states of the mind.\" However, the implications of embodiment are actually much more radical than this. If cognition can span the brain, body, and the environment, then the \"states of mind\" of disembodied cognitive science won't exist to be modified. Cognition will instead be an extended system assembled from a broad array of resources. Taking embodiment seriously therefore requires both new methods and theory. Here we outline four key steps that research programs should follow in order to fully engage with the implications of embodiment. The first step is to conduct a task analysis, which characterizes from a first person perspective the specific task that a perceiving-acting cognitive agent is faced with. The second step is to identify the task-relevant resources the agent has access to in order to solve the task. These resources can span brain, body, and environment. The third step is to identify how the agent can assemble these resources into a system capable of solving the problem at hand. The last step is to test the agent's performance to confirm that agent is actually using the solution identified in step 3. We explore these steps in more detail with reference to two useful examples (the outfielder problem and the A-not-B error), and introduce how to apply this analysis to the thorny question of language use. Embodied cognition is more than we think it is, and we have the tools we need to realize its full potential.",
      "cited_by_count": 762,
      "type": "article",
      "source": {
        "name": "Frontiers in Psychology",
        "type": "journal",
        "issn": [
          "1664-1078"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "gold",
        "oa_url": "https://www.frontiersin.org/articles/10.3389/fpsyg.2013.00058/pdf"
      },
      "topics": [
        "Action Observation and Synchronization",
        "Child and Animal Learning Development",
        "Embodied and Extended Cognition"
      ],
      "referenced_works_count": 134,
      "url": "https://openalex.org/W2111977473"
    },
    {
      "openalex_id": "W2062819913",
      "doi": "10.3389/fpsyg.2010.00242",
      "title": "On the need for Embodied and Dis-Embodied Cognition",
      "authors": [
        {
          "name": "Guy Dove",
          "openalex_id": "A5022478700",
          "orcid": "https://orcid.org/0000-0003-0470-7006",
          "institutions": [
            "University of Louisville"
          ]
        }
      ],
      "publication_year": 2011,
      "publication_date": "2011-01-01",
      "abstract": "This essay proposes and defends a pluralistic theory of conceptual embodiment. Our concepts are represented in at least two ways: (i) through sensorimotor simulations of our interactions with objects and events and (ii) through sensorimotor simulations of natural language processing. Linguistic representations are \"dis-embodied\" in the sense that they are dynamic and multimodal but, in contrast to other forms of embodied cognition, do not inherit semantic content from this embodiment. The capacity to store information in the associations and inferential relationships among linguistic representations extends our cognitive reach and provides an explanation of our ability to abstract and generalize. This theory is supported by a number of empirical considerations, including the large body of evidence from cognitive neuroscience and neuropsychology supporting a multiple semantic code explanation of imageability effects.",
      "cited_by_count": 232,
      "type": "article",
      "source": {
        "name": "Frontiers in Psychology",
        "type": "journal",
        "issn": [
          "1664-1078"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "gold",
        "oa_url": "https://www.frontiersin.org/articles/10.3389/fpsyg.2010.00242/pdf"
      },
      "topics": [
        "Language, Metaphor, and Cognition",
        "Action Observation and Synchronization",
        "Language and cultural evolution"
      ],
      "referenced_works_count": 210,
      "url": "https://openalex.org/W2062819913"
    },
    {
      "openalex_id": "W2142401744",
      "doi": "10.1016/j.ijproman.2006.08.006",
      "title": "Rethinking Project Management: Researching the actuality of projects",
      "authors": [
        {
          "name": "Svetlana Cicmil",
          "openalex_id": "A5040534023",
          "institutions": [
            "University of the West of England"
          ]
        },
        {
          "name": "Terry Williams",
          "openalex_id": "A5091164492",
          "orcid": "https://orcid.org/0000-0001-5177-7926",
          "institutions": [
            "University of Southampton"
          ]
        },
        {
          "name": "Janice Thomas",
          "openalex_id": "A5027357155",
          "orcid": "https://orcid.org/0000-0001-6866-6747",
          "institutions": [
            "Athabasca University"
          ]
        },
        {
          "name": "Damian Hodgson",
          "openalex_id": "A5007560752",
          "orcid": "https://orcid.org/0000-0002-9292-5945"
        }
      ],
      "publication_year": 2006,
      "publication_date": "2006-11-01",
      "abstract": null,
      "cited_by_count": 650,
      "type": "article",
      "source": {
        "name": "International Journal of Project Management",
        "type": "journal",
        "issn": [
          "0263-7863",
          "1873-4634"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "bronze",
        "oa_url": "https://www.sciencedirect.com/science/article/pii/S0263786306001244"
      },
      "topics": [
        "Construction Project Management and Performance",
        "Management and Organizational Studies",
        "Innovation and Knowledge Management"
      ],
      "referenced_works_count": 42,
      "url": "https://openalex.org/W2142401744"
    },
    {
      "openalex_id": "W2413144050",
      "doi": "10.3758/s13423-015-0860-1",
      "title": "The poverty of embodied cognition",
      "authors": [
        {
          "name": "Stephen D. Goldinger",
          "openalex_id": "A5015496789",
          "orcid": "https://orcid.org/0000-0001-9080-2602",
          "institutions": [
            "Arizona State University"
          ]
        },
        {
          "name": "Megan H. Papesh",
          "openalex_id": "A5032656732",
          "orcid": "https://orcid.org/0000-0002-9950-4369",
          "institutions": [
            "Louisiana State University"
          ]
        },
        {
          "name": "Anthony S. Barnhart",
          "openalex_id": "A5054636483",
          "orcid": "https://orcid.org/0000-0003-1366-1580",
          "institutions": [
            "Carthage College"
          ]
        },
        {
          "name": "Whitney A. Hansen",
          "openalex_id": "A5109225723",
          "institutions": [
            "Arizona State University"
          ]
        },
        {
          "name": "Michael C. Hout",
          "openalex_id": "A5105779430",
          "orcid": "https://orcid.org/0009-0002-8992-0577",
          "institutions": [
            "New Mexico State University"
          ]
        }
      ],
      "publication_year": 2016,
      "publication_date": "2016-06-09",
      "abstract": null,
      "cited_by_count": 314,
      "type": "article",
      "source": {
        "name": "Psychonomic Bulletin & Review",
        "type": "journal",
        "issn": [
          "1069-9384",
          "1531-5320"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "bronze",
        "oa_url": "https://link.springer.com/content/pdf/10.3758/s13423-015-0860-1.pdf"
      },
      "topics": [
        "Action Observation and Synchronization",
        "Embodied and Extended Cognition",
        "Psychology of Moral and Emotional Judgment"
      ],
      "referenced_works_count": 174,
      "url": "https://openalex.org/W2413144050"
    },
    {
      "openalex_id": "W2119540646",
      "doi": "10.1093/ejil/chn043",
      "title": "Human Dignity and Judicial Interpretation of Human Rights",
      "authors": [
        {
          "name": "Christopher McCrudden",
          "openalex_id": "A5042795061",
          "orcid": "https://orcid.org/0009-0001-2280-0426",
          "institutions": [
            "Lincoln College",
            "University of Oxford",
            "University of Michigan–Ann Arbor"
          ]
        }
      ],
      "publication_year": 2008,
      "publication_date": "2008-09-01",
      "abstract": "The Universal Declaration on Human Rights was pivotal in popularizing the use of ‘dignity’ or ‘human dignity’ in human rights discourse. This article argues that the use of ‘dignity’, beyond a basic minimum core, does not provide a universalistic, principled basis for judicial decision-making in the human rights context, in the sense that there is little common understanding of what dignity requires substantively within or across jurisdictions. The meaning of dignity is therefore context-specific, varying significantly from jurisdiction to jurisdiction and (often) over time within particular jurisdictions. Indeed, instead of providing a basis for principled decision-making, dignity seems open to significant judicial manipulation, increasing rather than decreasing judicial discretion. That is one of its significant attractions to both judges and litigators alike. Dignity provides a convenient language for the adoption of substantive interpretations of human rights guarantees which appear to be intentionally, not just coincidentally, highly contingent on local circumstances. Despite that, however, I argue that the concept of ‘human dignity’ plays an important role in the development of human rights adjudication, not in providing an agreed content to human rights but in contributing to particular methods of human rights interpretation and adjudication.",
      "cited_by_count": 950,
      "type": "article",
      "source": {
        "name": "European Journal of International Law",
        "type": "journal",
        "issn": [
          "0938-5428",
          "1464-3596"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "bronze",
        "oa_url": "https://academic.oup.com/ejil/article-pdf/19/4/655/1000936/chn043.pdf"
      },
      "topics": [
        "International Law and Human Rights",
        "Judicial and Constitutional Studies",
        "Ombudsman and Human Rights"
      ],
      "referenced_works_count": 31,
      "url": "https://openalex.org/W2119540646"
    },
    {
      "openalex_id": "W1966612647",
      "doi": "10.3758/bf03196865",
      "title": "Putting words in perspective",
      "authors": [
        {
          "name": "Anna M. Borghi",
          "openalex_id": "A5020756269",
          "orcid": "https://orcid.org/0000-0001-9455-8408",
          "institutions": [
            "University of Bologna",
            "University of Wisconsin–Madison"
          ]
        },
        {
          "name": "Arthur M. Glenberg",
          "openalex_id": "A5056425006",
          "orcid": "https://orcid.org/0000-0002-9281-3687",
          "institutions": [
            "University of Wisconsin–Madison"
          ]
        },
        {
          "name": "Michael P. Kaschak",
          "openalex_id": "A5090542048",
          "orcid": "https://orcid.org/0000-0002-7704-4904",
          "institutions": [
            "University of Wisconsin–Madison"
          ]
        }
      ],
      "publication_year": 2004,
      "publication_date": "2004-09-01",
      "abstract": null,
      "cited_by_count": 250,
      "type": "article",
      "source": {
        "name": "Memory & Cognition",
        "type": "journal",
        "issn": [
          "0090-502X",
          "1532-5946"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "bronze",
        "oa_url": "https://link.springer.com/content/pdf/10.3758/BF03196865.pdf"
      },
      "topics": [
        "Action Observation and Synchronization",
        "Language, Metaphor, and Cognition",
        "Child and Animal Learning Development"
      ],
      "referenced_works_count": 63,
      "url": "https://openalex.org/W1966612647"
    },
    {
      "openalex_id": "W2166756161",
      "doi": "10.1146/annurev-psych-010814-015044",
      "title": "Motivation and Cognitive Control: From Behavior to Neural Mechanism",
      "authors": [
        {
          "name": "Matthew Botvinick",
          "openalex_id": "A5083771180",
          "orcid": "https://orcid.org/0000-0001-7758-6896",
          "institutions": [
            "Princeton University"
          ]
        },
        {
          "name": "Todd S. Braver",
          "openalex_id": "A5012830013",
          "orcid": "https://orcid.org/0000-0002-2631-3393",
          "institutions": [
            "Washington University in St. Louis"
          ]
        }
      ],
      "publication_year": 2014,
      "publication_date": "2014-09-24",
      "abstract": "Research on cognitive control and executive function has long recognized the relevance of motivational factors. Recently, however, the topic has come increasingly to center stage, with a surge of new studies examining the interface of motivation and cognitive control. In the present article we survey research situated at this interface, considering work from cognitive and social psychology and behavioral economics, but with a particular focus on neuroscience research. We organize existing findings into three core areas, considering them in the light of currently vying theoretical perspectives. Based on the accumulated evidence, we advocate for a view of control function that treats it as a domain of reward-based decision making. More broadly, we argue that neuroscientific evidence plays a critical role in understanding the mechanisms by which motivation and cognitive control interact. Opportunities for further cross-fertilization between behavioral and neuroscientific research are highlighted.",
      "cited_by_count": 899,
      "type": "review",
      "source": {
        "name": "Annual Review of Psychology",
        "type": "journal",
        "issn": [
          "0066-4308",
          "1545-2085"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "bronze",
        "oa_url": "https://www.annualreviews.org/doi/pdf/10.1146/annurev-psych-010814-015044"
      },
      "topics": [
        "Neural and Behavioral Psychology Studies",
        "Decision-Making and Behavioral Economics",
        "Behavioral Health and Interventions"
      ],
      "referenced_works_count": 220,
      "url": "https://openalex.org/W2166756161"
    },
    {
      "openalex_id": "W2801662618",
      "doi": "10.1086/696691",
      "title": "Gender as “Ebola from Brussels”: The Anticolonial Frame and the Rise of Illiberal Populism",
      "authors": [
        {
          "name": "Elżbieta Korolczuk",
          "openalex_id": "A5086856279",
          "orcid": "https://orcid.org/0000-0002-8263-5530"
        },
        {
          "name": "Agnieszka Graff",
          "openalex_id": "A5018131335",
          "orcid": "https://orcid.org/0000-0003-0468-0376",
          "institutions": [
            "University of Warsaw"
          ]
        }
      ],
      "publication_year": 2018,
      "publication_date": "2018-05-11",
      "abstract": "This article examines the recent wave of grassroots mobilizations opposing gender equality, LGBT rights and sex education, which vilify the term gender in public debates and policy document. The anti-gender movement emerged simultaneously in various locations after 2010. We argue that it is not just another wave of anti-feminist backlash, or a new tactic of the Vatican in its ongoing efforts to undermine gender equality, but a new ideological and political configuration, which emerged in response to global economic crisis of 2008 and the ongoing crisis of liberal democracy. The backlash of the 80s and 90s combined neo-conservatism with market fundamentalism (which is to some extent still the case with neoconservative Christian fundamentalists in the US and elsewhere), while the new movement – though in many ways a continuation of earlier trends – tends to combine gender conservatism with a critique of neoliberalism and globalization. Liberal elites are presented as “colonizers”; “genderism” is demonized as an ideology imposed by the world’s rich on the poor. Thanks to the anti-colonial frame, anti-genderism has remarkable ideological coherence and great mobilizing power: right-wing populists have captured the imagination and hearts of large portions of local populations more effectively than progressive movements have managed to do. The article examines the basic tenets of anti-genderism, shedding light on how this ideological construct contributes to the contemporary transnational resurgence of illiberal populism. We argue that today’s global right, while selectively borrowing from liberal-left and feminist discourses, is in fact constructing a new universalism, an illiberal one. While the examples discussed are mostly from Poland, the pattern is transnational, and our conclusions may have serious implications for feminist theory and activism.",
      "cited_by_count": 496,
      "type": "article",
      "source": {
        "name": "Signs",
        "type": "journal",
        "issn": [
          "0097-9740",
          "1545-6943"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "bronze",
        "oa_url": "https://www.journals.uchicago.edu/doi/epdf/10.1086/696691"
      },
      "topics": [
        "Populism, Right-Wing Movements",
        "Gender Politics and Representation",
        "Religion and Society Interactions"
      ],
      "referenced_works_count": 43,
      "url": "https://openalex.org/W2801662618"
    },
    {
      "openalex_id": "W602440937",
      "doi": "10.26530/oapen_606390",
      "title": "Media and Participation: A site of ideological-democratic struggle",
      "authors": [
        {
          "name": "Nico Carpentier",
          "openalex_id": "A5049960351",
          "orcid": "https://orcid.org/0000-0002-8996-4636",
          "institutions": [
            "North Carolina Exploring Cultural Heritage Online"
          ]
        }
      ],
      "publication_year": 2011,
      "publication_date": "2011-01-01",
      "abstract": "Participation has become fashionable again, but at the same time it has always played a crucial role in our contemporary societies, and it has been omnipresent in a surprisingly large number of societal fields. In the case of the media sphere, the present-day media conjuncture is now considered to be the most participatory ever, but media participation has had a long and intense history. To deal with these paradoxes, this book looks at participation as a structurally unstable concept and as the object of a political-ideological struggle that makes it oscillate between minimalist and maximalist versions. This struggle is analysed in theoretical reflections in five fields (democracy, arts, development, spatial planning and media) and in eight different cases of media practice. These case studies also show participation’s close connection to power, identity, organization, technology and quality.",
      "cited_by_count": 553,
      "type": "book",
      "source": {
        "name": "Intellect Ltd. eBooks",
        "type": "ebook platform",
        "issn": null
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "hybrid",
        "oa_url": "https://library.oapen.org/bitstream/20.500.12657/32743/1/606390.pdf"
      },
      "topics": [
        "Cultural Industries and Urban Development",
        "Cultural, Media, and Literary Studies"
      ],
      "referenced_works_count": 415,
      "url": "https://openalex.org/W602440937"
    },
    {
      "openalex_id": "W1980449029",
      "doi": "10.1207/s15516709cog2302_3",
      "title": "Are Theories of Imagery Theories of Imagination? An Active Perception Approach to Conscious Mental Content",
      "authors": [
        {
          "name": "Nigel J. T. Thomas",
          "openalex_id": "A5030481948",
          "institutions": [
            "California State University, Fullerton"
          ]
        }
      ],
      "publication_year": 1999,
      "publication_date": "1999-04-01",
      "abstract": "Can theories of mental imagery, conscious mental contents, developed within cognitive science throw light on the obscure (but culturally very significant) concept of imagination? Three extant views of mental imagery are considered: quasi‐pictorial, description, and perceptual activity theories. The first two face serious theoretical and empirical difficulties. The third is (for historically contingent reasons) little known, theoretically underdeveloped, and empirically untried, but has real explanatory potential. It rejects the “traditional” symbolic computational view of mental contents, but is compatible with recent situated cognition and active vision approaches in robotics. This theory is developed and elucidated. Three related key aspects of imagination (non‐discursiveness, creativity, and seeing as) raise difficulties for the other theories. Perceptual activity theory presents imagery as non‐discursive and relates it closely to seeing as. It is thus well placed to be the basis for a general theory of imagination and its role in creative thought.",
      "cited_by_count": 284,
      "type": "article",
      "source": {
        "name": "Cognitive Science",
        "type": "journal",
        "issn": [
          "0364-0213",
          "1551-6709"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "bronze",
        "oa_url": "https://onlinelibrary.wiley.com/doi/pdfdirect/10.1207/s15516709cog2302_3"
      },
      "topics": [
        "Visual perception and processing mechanisms",
        "Action Observation and Synchronization",
        "Face Recognition and Perception"
      ],
      "referenced_works_count": 252,
      "url": "https://openalex.org/W1980449029"
    },
    {
      "openalex_id": "W1982067825",
      "doi": "10.3758/s13423-015-0825-4",
      "title": "Three symbol ungrounding problems: Abstract concepts and the future of embodied cognition",
      "authors": [
        {
          "name": "Guy Dove",
          "openalex_id": "A5022478700",
          "orcid": "https://orcid.org/0000-0003-0470-7006",
          "institutions": [
            "University of Louisville",
            "University of Louisville Hospital"
          ]
        }
      ],
      "publication_year": 2015,
      "publication_date": "2015-04-02",
      "abstract": null,
      "cited_by_count": 199,
      "type": "review",
      "source": {
        "name": "Psychonomic Bulletin & Review",
        "type": "journal",
        "issn": [
          "1069-9384",
          "1531-5320"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "bronze",
        "oa_url": "https://link.springer.com/content/pdf/10.3758/s13423-015-0825-4.pdf"
      },
      "topics": [
        "Action Observation and Synchronization",
        "Embodied and Extended Cognition",
        "Child and Animal Learning Development"
      ],
      "referenced_works_count": 194,
      "url": "https://openalex.org/W1982067825"
    },
    {
      "openalex_id": "W2114713121",
      "doi": "10.1093/geront/43.6.787",
      "title": "Self, Society, and the \"New Gerontology\"",
      "authors": [
        {
          "name": "Martha Holstein",
          "openalex_id": "A5027403893",
          "institutions": [
            "DePaul University"
          ]
        },
        {
          "name": "Meredith Minkler",
          "openalex_id": "A5076417281",
          "orcid": "https://orcid.org/0000-0002-7269-1221",
          "institutions": [
            "University of California, Berkeley"
          ]
        }
      ],
      "publication_year": 2003,
      "publication_date": "2003-12-01",
      "abstract": "The \"new gerontology,\" built on the concept of successful aging, sets forth the preconditions for and the end product of the process of aging successfully. Focused on health and active participation in life, it vests largely within individuals the power to achieve this normatively desirable state. While acknowledging the contributions of the scientific base for Rowe and Kahn's successful aging model, we emphasize the need for a more careful examination of the model itself. Using critical gerontology as a primary filter, we critique this normative vision by focusing on its unarticulated (and perhaps unexplored) values, assumptions, and consequences. We argue that these unexamined features may further harm older people, particularly older women, the poor, and people of color who are already marginalized. We conclude by suggesting forms of resistance to this univocal standard.",
      "cited_by_count": 485,
      "type": "article",
      "source": {
        "name": "The Gerontologist",
        "type": "journal",
        "issn": [
          "0016-9013",
          "1758-5341"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "bronze",
        "oa_url": "https://academic.oup.com/gerontologist/article-pdf/43/6/787/2565934/787.pdf"
      },
      "topics": [
        "Aging and Gerontology Research",
        "Health disparities and outcomes",
        "Psychological Well-being and Life Satisfaction"
      ],
      "referenced_works_count": 71,
      "url": "https://openalex.org/W2114713121"
    },
    {
      "openalex_id": "W1497823852",
      "doi": null,
      "title": "Reclaiming the Epistemological Other: Narrative and the Social Constitution of Identity",
      "authors": [
        {
          "name": "Margaret R. Somers",
          "openalex_id": "A5075342025",
          "orcid": "https://orcid.org/0000-0003-4751-6808"
        },
        {
          "name": "Gloria D. Gibson",
          "openalex_id": "A5081165150"
        }
      ],
      "publication_year": 1993,
      "publication_date": "1993-05-01",
      "abstract": "Also CSST Working Paper #94.",
      "cited_by_count": 480,
      "type": "article",
      "source": {
        "name": "Deep Blue (University of Michigan)",
        "type": "repository",
        "issn": null
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "green",
        "oa_url": "https://hdl.handle.net/2027.42/51265"
      },
      "topics": [
        "Social and Cultural Dynamics",
        "Rhetoric and Communication Studies",
        "Educator Training and Historical Pedagogy"
      ],
      "referenced_works_count": 93,
      "url": "https://openalex.org/W1497823852"
    }
  ],
  "count": 30,
  "errors": []
}
