{
  "status": "success",
  "source": "philpapers_via_brave",
  "query": "conceptual role semantics",
  "results": [
    {
      "title": "Daniel Whiting, Conceptual role semantics",
      "url": "https://philpapers.org/rec/UNKCRS",
      "philpapers_id": "UNKCRS",
      "snippet": "In the philosophy of language, conceptual role semantics (hereafter CRS) is a theory of what constitutes the meanings possessed by expressions of natural languages, or the propositions expressed by their utterance. ...",
      "page_age": null
    },
    {
      "title": "Ned Block, Semantics, conceptual role",
      "url": "https://philpapers.org/rec/BLOSCR",
      "philpapers_id": "BLOSCR",
      "snippet": "According to Conceptual Role Semantics (&quot;CRS&quot;), the meaning of a representation is the role of that representation in the cognitive life of the agent, e.g. in perception, thought and decision-making.",
      "page_age": null
    },
    {
      "title": "Gilbert Harman, (Nonsolipsistic) conceptual role semantics",
      "url": "https://philpapers.org/rec/HARNCR",
      "philpapers_id": "HARNCR",
      "snippet": "CRS says that the meanings of expressions of a language or other symbol system or the contents of mental states are determined and explained by the way symbols are used in ...",
      "page_age": null
    },
    {
      "title": "Ned Block, Conceptual Role Semantics",
      "url": "https://philpapers.org/rec/BLOCRS-2",
      "philpapers_id": "BLOCRS",
      "snippet": "According to Conceptual Role Semantics, the meaning of a representation is the role of that representation in the cognitive life of the agent, e.g. in perception, thought and decision-making.",
      "page_age": null
    },
    {
      "title": "Gilbert Harman, Conceptual Role Semantics",
      "url": "https://philpapers.org/rec/HARCRS-4",
      "philpapers_id": "HARCRS",
      "snippet": "Conceptual role semantics.Gilbert Harman - 1982 - Notre Dame Journal of Formal Logic 28 (2):242-56.",
      "page_age": null
    },
    {
      "title": "Arvid Båve, Conceptual Role Semantics",
      "url": "https://philpapers.org/rec/BVECRS",
      "philpapers_id": "BVECRS",
      "snippet": "Conceptual Role Semantics and Naturalizing Meaning.Gábor Forrai - 2008 - Croatian Journal of Philosophy 8 (24):337-348.",
      "page_age": null
    },
    {
      "title": "William J. Rapaport, Holism, conceptual-role semantics, and syntactic semantics",
      "url": "https://philpapers.org/rec/RAPHCS",
      "philpapers_id": "RAPHCS",
      "snippet": "Here, I argue that syntactic semantics (which is internal and first-person) is what has been called a conceptual-role semantics: The meaning of any expression is the role that it plays in the complete system of expressions.",
      "page_age": null
    },
    {
      "title": "Eric Dalton, Analyticity, Holism, and Conceptual-Role Semantics",
      "url": "https://philpapers.org/rec/DALAHA",
      "philpapers_id": "DALAHA",
      "snippet": "The basic claim of conceptual-role semantics is that the meaning of a sentence is its conceptual, or functional, role within the language. Roughly, this role consists in the inferential relations to ...",
      "page_age": null
    },
    {
      "title": "Neil Sinclair, Conceptual Role Semantics and the Reference of Moral Concepts",
      "url": "https://philpapers.org/rec/SINCRS",
      "philpapers_id": "SINCRS",
      "snippet": "It is argued that the most plausible version of conceptual role semantics for moral concepts involves only ‘narrow’ conceptual roles, where these include connections to motivational, desire-like, states.",
      "page_age": null
    },
    {
      "title": "Ralph Wedgwood, Conceptual role semantics for moral terms",
      "url": "https://philpapers.org/rec/WEDCRS",
      "philpapers_id": "WEDCRS",
      "snippet": "This paper outlines a new approach to the task of giving an account of the meaning of moral statements: a sort of &quot;conceptual role semantics&quot;, according to which the meaning of moral terms is given by their role in practical reasoning.",
      "page_age": null
    },
    {
      "title": "Brian Loar, Conceptual role and truth-conditions: comments on Harman's paper: \"Conceptual role semantics\"",
      "url": "https://philpapers.org/rec/LOACRA",
      "philpapers_id": "LOACRA",
      "snippet": "Conceptual Role and Truth-Conditions: Comments on Harman&#x27;s Paper: &quot;Conceptual Role Semantics&quot;.Brian Loar - 1982 - Notre Dame Journal of Formal Logic 23 (3):272-283.",
      "page_age": null
    },
    {
      "title": "Carsten Hansen, Conceptual role semantics and verification-transcendent truth",
      "url": "https://philpapers.org/rec/HANCRS",
      "philpapers_id": "HANCRS",
      "snippet": "In Dunja Jutronic (ed.), The Maribor Papers in Naturalized Semantics. Maribor. pp. 43 (1997) ... This article has no associated abstract. (fix it) ... This entry has no external links. Add one. Setup an account with your affiliations in order to access resources via your University&#x27;s proxy server · Sign in / register and customize your OpenURL resolver ... Anti-Realism and Speaker Knowledge.Dorit Bar-On - 1996 - Synthese 106 (2):139 - 166. Conceptual Role and Truth-Conditions: Comments on Harman&#x27;s Paper: &quot;Conceptual Role Semantics&quot;.Brian Loar - 1982 - Notre Dame Journal of Formal Logic 23 (July):272-83.",
      "page_age": null
    },
    {
      "title": "Ray Jackendoff, Conceptual semantics and its implications for philosophy of language",
      "url": "https://philpapers.org/rec/JACCSA-10",
      "philpapers_id": "JACCSA",
      "snippet": "Do all languages share the same conceptual structure?Mario Bacelar Valente - 2022 - Cognitive Semantics 8 (2):159-180. Why meaning (probably) isn&#x27;t conceptual role.Jerry Fodor &amp; Ernest Lepore - 1991 - Mind and Language 6 (4):328-43.",
      "page_age": null
    },
    {
      "title": "James L. D. Brown, Conceptual Role Expressivism and Defective Concepts",
      "url": "https://philpapers.org/rec/BROCRE-5",
      "philpapers_id": "BROCRE",
      "snippet": "This paper examines the general prospects for conceptual role expressivism, expressivist theories that embrace conceptual role semantics. It has two main aims. The first aim is to provide a general characterisation ...",
      "page_age": null
    },
    {
      "title": "Blouw Peter, Inferential Role Semantics for Natural Language",
      "url": "https://philpapers.org/rec/BLOIRS",
      "philpapers_id": "BLOIRS",
      "snippet": "To describe this semantics, I take advantage of recently developed techniques in the field of natural language processing. I introduce a model that assigns inferential roles to arbitrary linguistic expressions by learning from examples of how sentences are distributed as premises and conclusions in a space of possible inferences.",
      "page_age": null
    },
    {
      "title": "Ray Jackendoff, Conceptual semantics",
      "url": "https://philpapers.org/rec/NAGCS",
      "philpapers_id": "NAGCS",
      "snippet": "The approach can be characterized at two somewhat independent levels. The first is the overall framework for the theory of meaning, and how this framework is integrated into linguistics, philosophy of ...",
      "page_age": null
    },
    {
      "title": "Urpo Nikanne, Conceptual semantics: a micro-modular approach",
      "url": "https://philpapers.org/rec/NIKCSA-2",
      "philpapers_id": "NIKCSA",
      "snippet": "The book details particulars in the development of generative grammar and the relation of Conceptual Semantics to this development, and then introduces the micro-modular approach and shows its usefulness for the description of language generally by not only using examples from English, but also, and in particular, by applying the micro-modular approach of Conceptual Semantics to data from Finnish. ... Setup an account with your affiliations in order to access resources via your University&#x27;s proxy server · Sign in / register and customize your OpenURL resolver ... Conceptual role semantics for moral terms.Ralph Wedgwood - 2001 - Philosophical Review 110 (1):1-30.",
      "page_age": null
    }
  ],
  "count": 17,
  "errors": []
}
