{
  "status": "success",
  "source": "philpapers_via_brave",
  "query": "theories of meaning",
  "results": [
    {
      "title": "Jeff Speaks, Theories of meaning (Stanford Encyclopedia of Philosophy)",
      "url": "https://philpapers.org/rec/SPETOM",
      "philpapers_id": "SPETOM",
      "snippet": "Theories of Meaning.Jeff Speaks - forthcoming - Stanford Encyclopedia of Philosophy.",
      "page_age": null
    },
    {
      "title": "Michael Dummett, What Is a Theory of Meaning?",
      "url": "https://philpapers.org/rec/DUMWIA-5",
      "philpapers_id": "DUMWIA",
      "snippet": "To know the meaning of a sentence is to know its truth‐conditions. Yet, in what does the knowledge of truth‐conditions consist? In many cases, it consists in knowing the way in ...",
      "page_age": null
    },
    {
      "title": "Mark Textor, The use theory of meaning and semantic stipulation",
      "url": "https://philpapers.org/rec/TEXTUT",
      "philpapers_id": "TEXTUT",
      "snippet": "Since a word’s meaning is constituted by its (basic) underived acceptance property, this decision endows the word with a meaning. The use-theoretic account of semantic stipulation contrasts with the standard view that semantic stipulation proceeds by assigning the meaning (reference) to W that makes a certain set of sentences express true propositions.",
      "page_age": null
    },
    {
      "title": "Wang Lu, Theories of meaning",
      "url": "https://philpapers.org/rec/LUTOM",
      "philpapers_id": "LUTOM",
      "snippet": "Research into logical syntax provides us the knowledge of the structure of sentences, while logical semantics provides a window into uncovering the truth of sentences. Therefore, it is natural to make ...",
      "page_age": null
    },
    {
      "title": "Lawrence J. Kaye, A scientific psychologistic foundation for theories of meaning",
      "url": "https://philpapers.org/rec/KAYASP",
      "philpapers_id": "KAYASP",
      "snippet": "I propose, develop and defend the view that theories of meaning — for instance, a theory specifying the logical form or truth conditions of natural language sentences — should be naturalized to scientific psychological inquiry.",
      "page_age": null
    },
    {
      "title": "Charles Taylor, Theories of meaning",
      "url": "https://philpapers.org/rec/TAYTOM",
      "philpapers_id": "TAYTOM",
      "snippet": "Theories of Meaning.Jeff Speaks - forthcoming - Stanford Encyclopedia of Philosophy.",
      "page_age": null
    },
    {
      "title": "Jumbly Grindrod, Distributional Theories of Meaning: Experimental Philosophy of Language",
      "url": "https://philpapers.org/rec/GRIDTO-2",
      "philpapers_id": "GRIDTO",
      "snippet": "I then outline the reasons for and against the claim that distributional semantic models can serve as a theory of meaning, paying special attention to those within the field who have defended this claim. Finally, I conclude by arguing that despite the fact that such models are holistic, they nevertheless avoid the objections raised against holistic theories of meaning, particularly from Fodor &amp; Lepore (1992) (Holism: a shopper’s guide.",
      "page_age": null
    },
    {
      "title": "Marc Staudacher, Use theories of meaning",
      "url": "https://philpapers.org/rec/STAUTO",
      "philpapers_id": "STAUTO",
      "snippet": "This dissertation is a contribution to the philosophy of language. Its central question is: In virtue of which facts do linguistic expressions mean what they do? E.g. why does “apple” mean ...",
      "page_age": null
    },
    {
      "title": "Jeff Speaks, Truth theories, translation manuals, and theories of meaning",
      "url": "https://philpapers.org/rec/SPETTT",
      "philpapers_id": "SPETTT",
      "snippet": "In &quot;Truth and Meaning&quot;, Davidson suggested that a truth theory can do the work of a theory of meaning: it can give the meanings of expressions of a language, and can ...",
      "page_age": null
    },
    {
      "title": "Janet Dean Fodor, Semantics: Theories of Meaning in Generative Grammar",
      "url": "https://philpapers.org/rec/FODSTO-4",
      "philpapers_id": "FODSTO",
      "snippet": "Semantics: theories of meaning in generative grammar.Janet Dean Fodor - 1977 - Hassocks, [Eng.]: Harvester Press.",
      "page_age": null
    },
    {
      "title": "Leopold Hess, Slurs : semantic and pragmatic theories of meaning",
      "url": "https://philpapers.org/rec/HESSS-4",
      "philpapers_id": "HESSS",
      "snippet": "Slurs : semantic and pragmatic theories of meaning.Leopold Hess - 2021 - In Piotr Stalmaszczyk (ed.), Cambridge Handbook of the Philosophy of Language.",
      "page_age": null
    },
    {
      "title": "K. Sterelny, FODOR, J. D., \"Semantics: Theories of Meaning in Generative Grammar\"",
      "url": "https://philpapers.org/rec/STEFJD",
      "philpapers_id": "STEFJD",
      "snippet": "Semantics: Theories of Meaning in Generative Grammar.Janet Dean Fodor - 1977 - Harvester Press.",
      "page_age": null
    },
    {
      "title": "Denis McManus, Boghossian, Miller and Lewis on dispositional theories of meaning",
      "url": "https://philpapers.org/rec/MCMBMA",
      "philpapers_id": "MCMBMA",
      "snippet": "Paul Boghossian has pointed out a ’circularity problem’ for dispositionalist theories of meaning: as a result of the holistic character of belief fixation, one cannot identify someone’s meaning such and such with facts of the form S is disposed to utter P under conditions C, without C involving the semantic and intentional notions that such a theory was to explain.",
      "page_age": null
    }
  ],
  "count": 13,
  "errors": []
}
