{
  "status": "success",
  "source": "philpapers_via_brave",
  "query": "reference semantics",
  "results": [
    {
      "title": "Timothy Williamson, Reference, inference and the semantics of pejoratives",
      "url": "https://philpapers.org/rec/WILRIA-2",
      "philpapers_id": "WILRIA",
      "snippet": "In the crudest version of the contrast, the referentialist account of meaning gives centre stage to the referential semantics for a language, which is then used to explain the inference rules for the language, perhaps as those which preserve truth on that semantics (since a referential semantics for a language determines the truth-conditions of its sentences).",
      "page_age": null
    },
    {
      "title": "Saul A. Kripke, Speaker’s Reference and Semantic Reference",
      "url": "https://philpapers.org/rec/KRISRA-10",
      "philpapers_id": "KRISRA",
      "snippet": "Speaker’s Referent and Semantic Referent in Interpretive Interaction.Palle Leth - 2020 - Studia Semiotyczne 34 (2):65-80.",
      "page_age": null
    },
    {
      "title": "Roger Vergauwen, A Metalogical Theory of Reference: Realism and Essentialism in Semantics",
      "url": "https://philpapers.org/rec/VERAMT",
      "philpapers_id": "VERAMT",
      "snippet": "Roger Vergauwen seeks to provide an answer to the question, &quot;How does language connect to the world?&quot; He begins with the recent developments in formal semantics and from them constructs his own &#x27;theory of reference&#x27; with which he considers the nature of the correspondence of the world.",
      "page_age": null
    },
    {
      "title": "Emar Maier, Reference, Binding, and Presupposition: Three Perspectives on the Semantics of Proper Names",
      "url": "https://philpapers.org/rec/MAIRBA",
      "philpapers_id": "MAIRBA",
      "snippet": "In philosophy, in particular in the tradition of direct reference, the distinction is between reference and description. In linguistics, in particular in the tradition of generative grammar, the distinction is between pronouns and R-expressions. I argue for a third conception, grounded in dynamic semantics, in which the main watershed is between definites, which trigger presuppositions that want to be bound, and indefinites, which set up new discourse referents.",
      "page_age": null
    },
    {
      "title": "Torben Thrane, Referential-Semantic Analysis: Aspects of a Theory of Linguistic Reference",
      "url": "https://philpapers.org/rec/THRRAA",
      "philpapers_id": "THRRAA",
      "snippet": "Dr Thrane makes an original contribution to one of the central topics in syntax and semantics: the nature and mechanisms of reference in natural language. He makes a fundamental distinction between ...",
      "page_age": null
    },
    {
      "title": "Paula Sweeney, Future Contingents, Indeterminacy and Context",
      "url": "https://philpapers.org/rec/SWEFCI",
      "philpapers_id": "SWEFCI",
      "snippet": "In Facing the Future, Belnap et al. reject bivalence and propose double time reference semantics to give a pragmatic response to the following assertion problem: how can we make sense of assertions about future events made at a time when the outcomes of those events are not yet determined?",
      "page_age": null
    },
    {
      "title": "Filipe Martone, Book review: ALMOG, J. Referential Mechanics: Direct Reference and the Foundations of Semantics (Oxford University Press, 2014)",
      "url": "https://philpapers.org/rec/MARBRA-40",
      "philpapers_id": "MARBRA",
      "snippet": "In this review I discuss Joseph Almog&#x27;s book &quot;Referential Mechanics&quot;. The book discusses direct reference as conceived by three of its founding fathers, Kripke, Kaplan and Donnellan, and introduces Almog&#x27;s ambitious project of providing a referential semantics to all subject-phrases.",
      "page_age": null
    },
    {
      "title": "Edouard Machery, Ron Mallon, Shaun Nichols & Stephen Stich, Semantics, cross-cultural style",
      "url": "https://philpapers.org/rec/MACSCS",
      "philpapers_id": "MACSCS",
      "snippet": "In light of these findings on cultural differences, two experiments were conducted which explored intuitions about reference in Westerners and East Asians. Both experiments indicate that, for certain central cases, Westerners are more likely than East Asians to report intuitions that are consistent with the causal-historical view. These results constitute prima facie evidence that semantic intuitions vary from culture to culture, and the paper argues that this fact raises questions about the nature of the philosophical enterprise of developing a theory of reference",
      "page_age": null
    },
    {
      "title": "Sergey Pavlov, Semantics with Only One Bedeutung",
      "url": "https://philpapers.org/rec/PAVSWO",
      "philpapers_id": "PAVSWO",
      "snippet": "The modification of sentential logic interpretation will consist in change of semantic rules: a) every formula A stands either for truth or falsity, b.1) the formula A has value T iff the formula A stands for truth, b.2) the formula A has value F iff the formula A stands for falsity. Let’s change rules a) and b.2) on: a*) every formula A either stands or doesn&#x27;t stand for truth, b.2*) the formula A has value F iff the formula A doesn&#x27;t stand for truth. So, we have only one reference but still two values.",
      "page_age": null
    },
    {
      "title": "Simon Blackburn (ed.), Meaning, Reference and Necessity: New Studies in Semantics",
      "url": "https://philpapers.org/rec/BLAMRA-7",
      "philpapers_id": "BLAMRA",
      "snippet": "A volume of studies in philosophical logic by a group of younger philosophers in the UK. There is a core of problems in the theory of meaning which have been accorded ...",
      "page_age": null
    },
    {
      "title": "Kenneth R. Westphal, ‘Hegel’s Semantics of Singular Cognitive Reference, Newton’s Methodological Rule 4 and Scientific Realism Today’",
      "url": "https://philpapers.org/rec/WESHSO-2",
      "philpapers_id": "WESHSO",
      "snippet": "One resource is the constraints upon specifically cognitive reference to particulars, first identified by Kant (and later by Evans). The second is William Harper’s (2011) brilliant re-analysis and defence of Newton’s Principia, which shows that, and how, Newton justified his realism about gravitational force. One surprise is that Kant’s semantics of singular cognitive reference (examined in §3) directly and strongly supports Newton’s Rule 4 of scientific method (§4), which strongly supports his realism about gravitational force (summarised in §2).",
      "page_age": null
    },
    {
      "title": "Jakub Rudnicki, Can the reference of a use of “That” change? Assessing nonstandard approaches to the semantics of demonstratives",
      "url": "https://philpapers.org/rec/RUDCTR",
      "philpapers_id": "RUDCTR",
      "snippet": "This idea is handled formally by the addition of a parameter of the index of evaluation that represents the referentially relevant aspects of the state of the discourse. Also, I provide reasons for preferring my view over two rival positions: one by Palle Leth, and one that I adjust to the demands of the semantics of demonstratives from the theory that Kai von Fintel and Anthony Gillies offer for epistemic modals, and from Laura Delgado&#x27;s polyreferentialism for proper names.",
      "page_age": null
    },
    {
      "title": "Kent Bach, The Semantics and Pragmatics of Reference",
      "url": "https://philpapers.org/rec/BACTSA-5",
      "philpapers_id": "BACTSA",
      "snippet": "Semantics Versus Pragmatics.Zoltan Gendler Szabo (ed.) - 2004 - Oxford, GB: Oxford University Press UK. Thought and Reference by Kent Bach. [REVIEW]William W.",
      "page_age": null
    },
    {
      "title": "Howard K. Wettstein, Has semantics rested on a mistake?: and other essays",
      "url": "https://philpapers.org/rec/WETHSR-2",
      "philpapers_id": "WETHSR",
      "snippet": "The nature of reference, or the relation of a word to the object to which it refers, has been perhaps the dominant concern of twentieth-century analytic philosophy. Extremely influential arguments by ...",
      "page_age": null
    },
    {
      "title": "Genoveva Marti, Reference and Experimental Semantics",
      "url": "https://philpapers.org/rec/MARRAE-13",
      "philpapers_id": "MARRAE",
      "snippet": "Experimental semanticists have concluded that there is wide variation in referential intuitions among speakers, for it appears that some speakers display referential intuitions that are in line with descriptivism, whereas other ...",
      "page_age": null
    },
    {
      "title": "M. Monroy, An Introduction to Fregean Semantics",
      "url": "https://philpapers.org/rec/MONAIT-6",
      "philpapers_id": "MONAIT",
      "snippet": "In the semantics elaborated by G. Frege the most important notion, according to his logical concerns, is that of reference –“Bedeutung”. However, no less important are the notions of sense –“Sinn”– ...",
      "page_age": null
    }
  ],
  "count": 16,
  "errors": []
}
