{
  "status": "success",
  "source": "philpapers_via_brave",
  "query": "symbol grounding problem critique",
  "results": [
    {
      "title": "Stevan Harnad, The symbol grounding problem",
      "url": "https://philpapers.org/rec/HARTSG",
      "philpapers_id": "HARTSG",
      "snippet": "How can the meanings of the meaningless ... in anything but other meaningless symbols? The problem is analogous to trying to learn Chinese from a Chinese/Chinese dictionary alone....",
      "page_age": null
    },
    {
      "title": "Jianhui Li & Haohao Mao, The Difficulties in Symbol Grounding Problem and the Direction for Solving It",
      "url": "https://philpapers.org/rec/LITDI-3",
      "philpapers_id": "LITDI",
      "snippet": "We therefore argue that the SGP can be regarded as a general problem of how an AI system can have intentionality, and develop a theoretical direction for its solution. ... Setup an account with your affiliations in order to access resources ...",
      "page_age": null
    },
    {
      "title": "Stevan Harnad, Symbol‐grounding Problem",
      "url": "https://philpapers.org/rec/HARSP-2",
      "philpapers_id": "HARSP",
      "snippet": "The symbol grounding problem has been solved. So what&#x27;s next?Luc Steels - 2008 - In Manuel de Vega, Arthur Glenberg &amp; Arthur Graesser, Symbols and embodiment: debates on meaning and cognition. New York: Oxford University Press.",
      "page_age": null
    },
    {
      "title": "Luc Steels, The symbol grounding problem has been solved. So what's next?",
      "url": "https://philpapers.org/rec/STETSG",
      "philpapers_id": "STETSG",
      "snippet": "An embodied cognition perspective on symbols, gesture and grounding instruction.Mitchell J. Nathan - 2008 - In Manuel de Vega, Arthur Glenberg &amp; Arthur Graesser, Symbols and embodiment: debates on meaning and cognition.",
      "page_age": null
    },
    {
      "title": "Paul Vogt, The physical symbol grounding problem",
      "url": "https://philpapers.org/rec/VOGTPS",
      "philpapers_id": "VOGTPS",
      "snippet": "This paper presents an approach to solve the symbol grounding problem within the framework of embodied cognitive science. It will be argued that symbolic structures can be used within the paradigm ...",
      "page_age": null
    },
    {
      "title": "Stevan Harnad, Symbol grounding and the origin of language",
      "url": "https://philpapers.org/rec/HARSGA",
      "philpapers_id": "HARSGA",
      "snippet": "Solving the symbol grounding problem: a critical review of fifteen years of research.Mariarosaria Taddeo &amp; Luciano Floridi - unknown",
      "page_age": null
    },
    {
      "title": "Stevan Harnad, Symbol grounding is an empirical problem: Neural nets are just a candidate component",
      "url": "https://philpapers.org/rec/HARSGI",
      "philpapers_id": "HARSGI",
      "snippet": "Solving the symbol grounding problem: a critical review of fifteen years of research.Mariarosaria Taddeo &amp; Luciano Floridi - unknown",
      "page_age": null
    },
    {
      "title": "Mariarosaria Taddeo & Luciano Floridi, Solving the symbol grounding problem: a critical review of fifteen years of research",
      "url": "https://philpapers.org/rec/TADSTS",
      "philpapers_id": "TADSTS",
      "snippet": "This article reviews eight proposed strategies for solving the Symbol Grounding Problem (SGP), which was given its classic formulation in Harnad (1990). After a concise introduction, we provide an analysis of the requirement that must be satisfied by any hypothesis seeking to solve the SGP, the zero semantical commitment condition.",
      "page_age": null
    },
    {
      "title": "Milan Rokso, The World as Mirror and Recursion – A Solution to the Symbol Grounding Problem",
      "url": "https://philpapers.org/rec/ROKTWA",
      "philpapers_id": "ROKTWA",
      "snippet": "This work introduces a structural resolution to the Symbol Grounding Problem by uncovering a constraint implicit in all self-modeling symbolic systems. We show that any system capable of constructing a symbolic ...",
      "page_age": null
    },
    {
      "title": "Vincent C. Müller, Which symbol grounding problem should we try to solve?",
      "url": "https://philpapers.org/rec/MLLWSG-2",
      "philpapers_id": "MLLWSG",
      "snippet": "On the basis of a proper understanding of computing, I come to the conclusion that the only sensible ground-ing problem is how we can explain and re-produce the behavioral ability and function of meaning in artificial computational agents ... Vincent C. Müller ... symbol grounding Floridi Taddeo Steels zero semantic commitment grounding Chinese room Searle goals syntactic computation",
      "page_age": null
    },
    {
      "title": "H. H. Pattee, Symbol Grounding Precedes Interpretation",
      "url": "https://philpapers.org/rec/PATSGP",
      "philpapers_id": "PATSGP",
      "snippet": "Deacon speculates on the origin of interpretation of signs using autocatalytic origin of life models and Peircean terminology. I explain why interpretation evolved only later as a triadic intervention between symbols ...",
      "page_age": null
    },
    {
      "title": "Christophe Menant, Turing Test, Chinese Room Argument, Symbol Grounding Problem. Meanings in Artificial Agents (APA 2013)",
      "url": "https://philpapers.org/rec/MENTTC-2",
      "philpapers_id": "MENTTC",
      "snippet": "The Turing Test (TT), the Chinese Room Argument (CRA), and the Symbol Grounding Problem (SGP) are about the question “can machines think?” We propose to look at these approaches to Artificial ...",
      "page_age": null
    },
    {
      "title": "Paul Vogt & Federico Divina, Social symbol grounding and language evolution",
      "url": "https://philpapers.org/rec/VOGSSG",
      "philpapers_id": "VOGSSG",
      "snippet": "This project has the objective of evolving a cultural society and, in doing so, the agents have to evolve a communication system that is grounded in their interactions with their virtual environment and with other individuals. A preliminary experiment is presented in which we investigate the effect of a number of learning mechanisms. The results show that the social symbol grounding problem is a particularly hard one; however, we provide an ideal platform to study this problem.",
      "page_age": null
    },
    {
      "title": "Ilexa Yardley, The Grounding Problem",
      "url": "https://philpapers.org/rec/YARTGP-4",
      "philpapers_id": "YARTGP",
      "snippet": "The ‘genesis’ of ‘information’ (conservation of an uber-simple circle) solves the ‘universal’ grounding problem. Addressing all of the so-called ‘issues’ in post-humanism and post-structuralism (trans-humanism). Integrating all disciplines (and sub-disciplines) (including ...",
      "page_age": null
    },
    {
      "title": "Vincent C. Müller, The hard and easy grounding problems (Comment on A. Cangelosi)",
      "url": "https://philpapers.org/rec/MLLTHA-2",
      "philpapers_id": "MLLTHA",
      "snippet": "I see four symbol grounding problems: 1) How can a purely computational mind acquire meaningful symbols? 2) How can we get a computational robot to show the right linguistic behavior? These two are misleading.",
      "page_age": null
    },
    {
      "title": "Stevan Harnad, Minds, machines and Searle",
      "url": "https://philpapers.org/rec/HARMMA-3",
      "philpapers_id": "HARMMA",
      "snippet": "Other bodies, other minds: A machine incarnation of an old philosophical problem. [REVIEW]Stevan Harnad - 1991 - Minds and Machines 1 (1):43-54. Meaning in Artificial Agents: The Symbol Grounding Problem Revisited.Dairon Rodríguez, Jorge Hermosillo &amp; Bruno Lara - 2012 - Minds and Machines ...",
      "page_age": null
    },
    {
      "title": "Angelo Cangelosi, Alberto Greco & Stevan Harnad, Symbol grounding and the symbolic theft hypothesis",
      "url": "https://philpapers.org/rec/CANSGA",
      "philpapers_id": "CANSGA",
      "snippet": "Symbol systems are advantageous as they are easily studied through computer simulation (a computer program is a symbol system itself), and this is why language is often studied using computational models. ... Setup an account with your affiliations in order to access resources via your University&#x27;s proxy server · Sign in / register and customize your OpenURL resolver ... An Embodied Model for Sensorimotor Grounding and Grounding Transfer: Experiments With Epigenetic Robots.Angelo Cangelosi &amp; Thomas Riga - 2006 - Cognitive Science 30 (4):673-689.",
      "page_age": null
    }
  ],
  "count": 17,
  "errors": []
}
