{
  "status": "success",
  "source": "philpapers_via_brave",
  "query": "intentionality mental content",
  "results": [
    {
      "title": "Brian Loar, Phenomenal intentionality as the basis of mental content",
      "url": "https://philpapers.org/rec/LOAPIA",
      "philpapers_id": "LOAPIA",
      "snippet": "Intentionality, content, and primitive mental directedness.Richard E.",
      "page_age": null
    },
    {
      "title": "Jeff Speaks, Is mental content prior to linguistic meaning?: Stalnaker on intentionality",
      "url": "https://philpapers.org/rec/SPEIMC",
      "philpapers_id": "SPEIMC",
      "snippet": "Since the 1960&#x27;s, work in the analytic tradition on the nature of mental and linguistic content has converged on the views that social facts about public language meaning are derived from facts about the thoughts of individuals, and that these thoughts are constituted by properties of the internal states of agents. I give a two-part argument against this picture of intentionality: first, that if mental content is prior to public language meaning, then a view of mental content much like the causal-pragmatic theory presented by Robert Stalnaker in Inquiry must be correct; second, that the causal-pragmatic theory is false.",
      "page_age": null
    },
    {
      "title": "Angela A. Mendelovici, The Phenomenal Basis of Intentionality",
      "url": "https://philpapers.org/rec/MENTPB",
      "philpapers_id": "MENTPB",
      "snippet": "In responding to these challenges, this book proposes a novel version of PIT, on which all intentionality is phenomenal intentionality, though we in some sense represent many non-phenomenal contents by ascribing them to ourselves. This book further argues that phenomenal consciousness is an intrinsic feature of mental life, resulting in a view that is radically internalistic in spirit: Our phenomenally represented contents are literally in our heads, and any non-phenomenal contents we in some sense represent are expressly targeted by us.",
      "page_age": null
    },
    {
      "title": "Pierre Steiner, Content, Mental Representation and Intentionality",
      "url": "https://philpapers.org/rec/STECMR-5",
      "philpapers_id": "STECMR",
      "snippet": "Dress Rehearsals, Previews, and Encores: A New Account of Mental Representation.Nancy Salay - 2014 - Theoria 80 (1):84-97. Added to PP 2019-08-17 Downloads 13 (#760,514) 6 months 1 (#419,510) ... Untangling the Knot of Intentionality: Between Directedness, Reference, and Content.Pierre Steiner - 2019 - Studia Semiotyczne 33 (1):83-104.",
      "page_age": null
    },
    {
      "title": "Sam Coleman, Intentionality, Qualia, and the Stream of Unconsciousness",
      "url": "https://philpapers.org/rec/COLIQA",
      "philpapers_id": "COLIQA",
      "snippet": "Other philosophers have emphasized the phenomenal-qualitative aspect of conscious experiences as core to the mind. A recent philosophical wave – the ‘phenomenal intentionality programme’ – seeks to unite these conceptions in the idea that mental content is grounded in phenomenal qualities.",
      "page_age": null
    },
    {
      "title": "Tobias Schlicht, Does Separating Intentionality From Mental Representation Imply Radical Enactivism?",
      "url": "https://philpapers.org/rec/SCHDSI-15",
      "philpapers_id": "SCHDSI",
      "snippet": "Traditionally, intentionality is regarded as that feature of all and only mental states – paradigmatically beliefs and desires – in virtue of which they are directed at or are about something.",
      "page_age": null
    },
    {
      "title": "Peter Schulte, Mental content",
      "url": "https://philpapers.org/rec/SCHMCD",
      "philpapers_id": "SCHMCD",
      "snippet": "After clarifying central concepts ... accounts of the nature of mental content (or mental representation), which include causal, informational, teleological and structuralist approaches, alongside the phenomenal intentionality approach and the intentional stance ...",
      "page_age": null
    },
    {
      "title": "Thomas David Bontly, Intentionality, Analysis, and Naturalism: An Essay on Metaphilosophy and Mind",
      "url": "https://philpapers.org/rec/BONIAA-5",
      "philpapers_id": "BONIAA",
      "snippet": "Naturalism is currently popular in the philosophy of mind, as in epistemology and ethics. One example of the naturalistic trend concerns the intentionality of mental states: the property by which they are directed at, or about, objects and states of affairs. Attempts to naturalize intentionality--to give an account of it in naturalistic terms--abound, but rarely do philosophers stop to ask questions like: What is the epistemic status of naturalizations?",
      "page_age": null
    },
    {
      "title": "Amir Horowitz, On the Very Idea of (Real) Content Derivation",
      "url": "https://philpapers.org/rec/HOROTV-2",
      "philpapers_id": "HOROTV",
      "snippet": "According to an idea which is widespread among philosophers, linguistic entities derive their intentionality from the intentionality of mental entities by virtue of some relation between them. Typically, it is some kind of intention on the speaker’s part – e.g., an intention to produce in the hearer a belief with a certain content – that is supposed to endow words with content.",
      "page_age": null
    },
    {
      "title": "Edward N. Zalta, The Intentional Stance",
      "url": "https://philpapers.org/rec/ZALTIS",
      "philpapers_id": "ZALTIS",
      "snippet": "In this book, Dennett determines ... by the fact that they have content in virtue of being about, or directed towards, the world at large. Intentionality is characteristic of such states as belief and desire, since all belief ...",
      "page_age": null
    },
    {
      "title": "Laura Danón, Neo-Pragmatism, Primitive Intentionality and Animal Minds",
      "url": "https://philpapers.org/rec/DANNPI-2",
      "philpapers_id": "DANNPI",
      "snippet": "Thus, their proposal ends up being insufficient to help neo-Pragmatist approaches to overcome the problem of animal minds. Finally, I will suggest that overcoming this objection requires attributing to non-human animals some basic, yet content involving, kinds of intentional mental states.",
      "page_age": null
    },
    {
      "title": "John R. Searle, Intentionality: An Essay in the Philosophy of Mind",
      "url": "https://philpapers.org/rec/SEAIAE-4",
      "philpapers_id": "SEAIAE",
      "snippet": "The present book is concerned with ... phenomenon, and its analysis involves wide-ranging discussions of perception, action, causation, meaning, and reference....",
      "page_age": null
    }
  ],
  "count": 12,
  "errors": []
}
