{
  "status": "success",
  "source": "philpapers_via_brave",
  "query": "inferentialism Brandom",
  "results": [
    {
      "title": "Robert Brandom, Inferentialism and Some of Its Challenges",
      "url": "https://philpapers.org/rec/BRAIAS",
      "philpapers_id": "BRAIAS",
      "snippet": "Of Whales and Pendulums: A Reply to Brandom.Mark Wilson - 2010 - Philosophy and Phenomenological Research 82 (1):202-211. Articulating Reasons: An Introduction to Inferentialism.Steven Gross - 2002 - Philosophical Review 111 (2):284.",
      "page_age": null
    },
    {
      "title": "Robert Brandom, Articulating Reasons: An Introduction to Inferentialism",
      "url": "https://philpapers.org/rec/BRAARA-2",
      "philpapers_id": "BRAARA",
      "snippet": "Robert Brandom, Articulating Reasons: An Introduction to Inferentialism Reviewed by.Timothy Schroeder - 2001 - Philosophy in Review 21 (4):235-237.",
      "page_age": null
    },
    {
      "title": "Robert B. Brandom, Robert B. Brandom, Articulating Reasons (An Introduction to Inferentialism)",
      "url": "https://philpapers.org/rec/BRAAR-2",
      "philpapers_id": "BRAAR",
      "snippet": "Articulating reasons: An introduction to inferentialism.F. MacBride - 2002 - Australasian Journal of Philosophy 80 (2):237 – 238. Inferencjalizm semantyczny Roberta B. Brandoma = The semantic inferentialism of Robert B.",
      "page_age": null
    },
    {
      "title": "Giacomo Turbanti, Robert Brandom's Normative Inferentialism",
      "url": "https://philpapers.org/rec/TURRBN",
      "philpapers_id": "TURRBN",
      "snippet": "The philosophy of language of Robert ... the normative analysis of linguistic practices, the inferential characterization of conceptual contents and the expressive articulation of the relations between the former two...",
      "page_age": null
    },
    {
      "title": "Jerry Fodor & Ernie Lepore, Brandom's Burdens: Compositionality and Inferentialism",
      "url": "https://philpapers.org/rec/FODBBC-2",
      "philpapers_id": "FODBBC",
      "snippet": "Robert Brandom has it in mind to run a ‘pragmatist’ theory of content. That is, he wants to reconstruct notions like saying such and such or believing such and such in terms of a distinctive kind of “knowing how or being able to do something”. ... Setup an account with your affiliations in order to access resources via your University&#x27;s proxy server · Sign in / register and customize your OpenURL resolver ... Inferentialism...",
      "page_age": null
    },
    {
      "title": "Tom Rockmore, Brandom, Hegel and inferentialism",
      "url": "https://philpapers.org/rec/ROCBHA",
      "philpapers_id": "ROCBHA",
      "snippet": "In the course of developing a semantics with epistemological intent, Brandom claims that his inferentialism is Hegelian. This paper argues that, even on a charitable reading, Brandom is an anti-Hegelian.",
      "page_age": null
    },
    {
      "title": "David L. Marshall, The implications of Robert Brandom's inferentialism for intellectual history",
      "url": "https://philpapers.org/rec/MARTIO-30",
      "philpapers_id": "MARTIO",
      "snippet": "It shows how Brandom’s work emerged out of the broad shift in the philosophy of language from semantics to pragmatics that also informed speech act theory. The article then goes on to unpack the rich implications of Brandom’s inferentialism for the theory and practice of intellectual history.",
      "page_age": null
    },
    {
      "title": "Jaroslav Peregrin, What is inferentialism?",
      "url": "https://philpapers.org/rec/PERWII",
      "philpapers_id": "PERWII",
      "snippet": "Inferentialism is the conviction that to be meaningful in the distinctively human way, or to have a &#x27;conceptual content&#x27;, is to be governed by a certain kind of inferential rules.",
      "page_age": null
    },
    {
      "title": "Robert Brandom, Inferentialism (Cambridge, Mass.: Harvard University Press, 2000), 230 pp",
      "url": "https://philpapers.org/rec/BRAICM",
      "philpapers_id": "BRAICM",
      "snippet": "Articulating Reasons: An Introduction to Inferentialism.F.",
      "page_age": null
    },
    {
      "title": "Edgar Andrade-Lotero & Catarina Dutilh Novaes, A Contentious Trinity: Levels of Entailment in Brandom’s Pragmatist Inferentialism",
      "url": "https://philpapers.org/rec/ANDACT-2",
      "philpapers_id": "ANDACT",
      "snippet": "We investigate the relations among Brandom’s three dimensions of semantic inferential articulation, namely, incompatibility entailments, committive consequences, and permissive consequences. In his unpublished manuscript “Conceptual Content and Discursive Practice” Brandom argues ...",
      "page_age": null
    },
    {
      "title": "Timothy Schroeder, Robert Brandom, Articulating Reasons: An Introduction to Inferentialism Reviewed by",
      "url": "https://philpapers.org/rec/SCHRBA-2",
      "philpapers_id": "SCHRBA",
      "snippet": "Brandom - 2001 - Erkenntnis 55 (1):121-127. Articulating reasons: An introduction to inferentialism.",
      "page_age": null
    },
    {
      "title": "Daniel Laurier, Making \"Reasons\" Explicit: How Normative is Brandom's Inferentialism",
      "url": "https://philpapers.org/rec/LAUMRE",
      "philpapers_id": "LAUMRE",
      "snippet": "I show that Brandom&#x27;s claim that these concepts are analogous to the concepts of obligation and permission cannot be right, and argue that the normative character of the concept of commitment is dubious. This leads me to replace Brandom&#x27;s conception of inferential relations as relations between deontic statuses with one according to which they are to be seen as relations between entitlements and acknowledgements of commitments",
      "page_age": null
    },
    {
      "title": "José L. Zalabardo, Inferentialism and knowledge: Brandom’s arguments against reliabilism",
      "url": "https://philpapers.org/rec/ZALIAK",
      "philpapers_id": "ZALIAK",
      "snippet": "I take issue with Robert Brandom’s claim that on an analysis of knowledge based on objective probabilities it is not possible to provide a stable answer to the question whether a ...",
      "page_age": null
    },
    {
      "title": "Ernie Lepore Jerry Fodor, Brandom’s Burdens: Compositionality and Inferentialism",
      "url": "https://philpapers.org/rec/JERBBC",
      "philpapers_id": "JERBBC",
      "snippet": "Robert Brandom has it in mind to run a ‘pragmatist’ theory of content. That is, he wants to reconstruct notions like saying such and such or believing such and such in terms of a distinctive kind of “knowing how or being able to do something”. ... Setup an account with your affiliations in order to access resources via your University&#x27;s proxy server · Sign in / register and customize your OpenURL resolver ... Inferentialism, compositionality and the thickness of meaning.Dongho Choi - 2008 - Proceedings of the Xxii World Congress of Philosophy 39:335-344.",
      "page_age": null
    },
    {
      "title": "John MacFarlane, Pragmatism and inferentialism",
      "url": "https://philpapers.org/rec/MACPAI",
      "philpapers_id": "MACPAI",
      "snippet": "I’ll argue that pragmatism, as Brandom initially describes it—the view that “semantics must answer to pragmatics”—does not favor an inferentialist approach to semantics over a truth-conditional one.",
      "page_age": null
    },
    {
      "title": "Robert B. Brandom & Ivan Ivashchenko, The Commitment to Inference",
      "url": "https://philpapers.org/rec/BRATCT-7",
      "philpapers_id": "BRATCT",
      "snippet": "In this conversation, American philosopher Robert Brandom talks about the historical background of his inferentialism, reconstructing the influence of his teachers Wilfrid Sellars and Richard Rorty.",
      "page_age": null
    },
    {
      "title": "Robb Edward Eason, Robert Brandom and the history of philosophy: On the advantages and disadvantages of history for pragmatic inferentialism",
      "url": "https://philpapers.org/rec/EASRBA",
      "philpapers_id": "EASRBA",
      "snippet": "Inferentialist Philosophy of Language and the Historiography of Philosophy.Kevin J. Harrelson - 2014 - British Journal for the History of Philosophy 22 (3):582-603. Added to PP 2009-01-28 Downloads 149 (#153,093) 6 months 3 (#1,481,767) ... No citations found. ... 3. Reason, Expression, and the Philosophic Enterprise.Robert Brandom - 2001 - In Anne Applebaum (ed.), What is Philosophy?",
      "page_age": null
    },
    {
      "title": "William Child, Articulating reasons: An introduction to inferentialism. Robert B. Brandom",
      "url": "https://philpapers.org/rec/CHIARA",
      "philpapers_id": "CHIARA",
      "snippet": "Brandom, Robert B. Articulating Reasons: An Introduction to Inferentialism.Christopher B.",
      "page_age": null
    },
    {
      "title": "Robert B. Brandom, Pragmatism, inferentialism, and modality in Sellars's arguments against empiricism",
      "url": "https://philpapers.org/rec/BRAPIA-2",
      "philpapers_id": "BRAPIA",
      "snippet": "A Kantian Rationalist Pragmatism: Pragmatism, Inferentialism, and Modality in Sellars’s Arguments against Empiricism.Robert B. Brandom - 2011 - In Perspectives on pragmatism: classical, recent, and contemporary. Cambridge: Harvard University Press.",
      "page_age": null
    },
    {
      "title": "Julien Murzi & Florian Steinberger, Inferentialism",
      "url": "https://philpapers.org/rec/MURIGK",
      "philpapers_id": "MURIGK",
      "snippet": "It discusses some of the benefits of logical inferentialism, chiefly with regard to the epistemology of logic, and considers a number of objections. The chapter critically examines Robert Brandom&#x27;s inferentialism about linguistic and conceptual content in general.",
      "page_age": null
    }
  ],
  "count": 20,
  "errors": []
}
