{
  "status": "success",
  "source": "philpapers_via_brave",
  "query": "teleosemantics Millikan",
  "results": [
    {
      "title": "Ruth Garrett Millikan, Neuroscience and teleosemantics",
      "url": "https://philpapers.org/rec/MILNAT-2",
      "philpapers_id": "MILNAT",
      "snippet": "Correctly understood, teleosemantics is the claim that “representation” is a function term. Things are called “representations” if they have a certain kind of function or telos and perform it in a certain kind of way.",
      "page_age": null
    },
    {
      "title": "Ruth Garrett Millikan, An Input Condition for Teleosemantics? Reply to Shea (and Godfrey-Smith)",
      "url": "https://philpapers.org/rec/AIC",
      "philpapers_id": "AIC",
      "snippet": "Shea proposes to &quot;add an input condition to teleosemantics,&quot; requiring that simple representations must carry &quot;correlational information.&quot; I am grateful to Shea for his paper, as it presents me with an opportunity to clarify two fairly central features of my position on intentional content, one of which seems to have been overlooked in the literature (Millikan 1993a), the other of which I have stated previously only in a confusing way (Millikan 2004, Chapters 3-4).",
      "page_age": null
    },
    {
      "title": "Ruth Garrett Millikan, Teleosemantics and the frogs",
      "url": "https://philpapers.org/rec/MILTAT-29",
      "philpapers_id": "MILTAT",
      "snippet": "Pushmi-pullyu representations.Ruth Garrett Millikan - 1995 - Philosophical Perspectives 9:185-200. Teleosemantics, selection and novel contents.Justin Garson &amp; David Papineau - 2019 - Biology and Philosophy 34 (3):36.",
      "page_age": null
    },
    {
      "title": "Carolyn Price, Teleosemantics re-examined: content, explanation and norms: Dan Ryder, Justine Kingsbury and Kenneth Williford : Millikan and Her critics. Wiley-Blackwell, Chichester, 2013, 297 pp",
      "url": "https://philpapers.org/rec/PRITRC",
      "philpapers_id": "PRITRC",
      "snippet": "I highlight and briefly discuss three issues that crop up repeatedly though the collection: (1) Millikan’s externalism (and in particular, her emphasis on how intentional states are used, rather than how they are produced); (2) the nature of intentional explanation; and (3) the normativity of meaning",
      "page_age": null
    },
    {
      "title": "Ruth Garrett Millikan, Compare and contrast Dretske, Fodor, and Millikan on teleosemantics",
      "url": "https://philpapers.org/rec/MILCAC",
      "philpapers_id": "MILCAC",
      "snippet": "White Queen Psychology and Other Essays for Alice.Ruth Garrett Millikan - 1993 - MIT Press. Teleosemantics without natural selection.Marshall Abrams - 2005 - Biology and Philosophy 20 (1):97-116.",
      "page_age": null
    },
    {
      "title": "Brian Leahy, Teleosemantics: Intentionality, Productivity, and the Theory of Meaning",
      "url": "https://philpapers.org/rec/LEATIP",
      "philpapers_id": "LEATIP",
      "snippet": "Since the publication of Ruth Millikan&#x27;s Language, Thought, and Other Biological Categories in 1984, a great deal of literature has discussed her so-called teleosemantic or biosemantic solution to the problem of intentionality. Only recently, though, has much attention been paid to her co-ordinated solution to the problem of productivity.",
      "page_age": null
    },
    {
      "title": "Karl Gustav Bergman, Teleosemantics and universal hybridity",
      "url": "https://philpapers.org/rec/BERTAU",
      "philpapers_id": "BERTAU",
      "snippet": "According to Ruth Millikan, some representations are hybrid: they have both descriptive and directive content, both mind-to-world and world-to-mind direction of fit. Millikan calls them “pushmi-pullyu representations,” and they play an ...",
      "page_age": null
    },
    {
      "title": "Justine Margaret Joy Kingsbury, Content and Function: A Defense of Millikanian Teleosemantics",
      "url": "https://philpapers.org/rec/KINCAF-2",
      "philpapers_id": "KINCAF",
      "snippet": "A teleological theory of content is one which accounts for the content of mental states in terms of the functions of either the mental states themselves or the mechanisms which produce them.",
      "page_age": null
    },
    {
      "title": "Peter Schulte, How Frogs See the World: Putting Millikan’s Teleosemantics to the Test",
      "url": "https://philpapers.org/rec/SCHHFS",
      "philpapers_id": "SCHHFS",
      "snippet": "I then focus on the most prominent version of teleosemantics, Ruth Millikan’s consumer-oriented approach, and argue that it fails the empirical test in the frog case, since it yields a content ascription that (i) does not include properties that should be included (namely, being small, dark and moving ) and (ii) includes a property that should not be included (namely, being frog food ).",
      "page_age": null
    },
    {
      "title": "Ruth Garrett Millikan, Pushmi-pullyu representations",
      "url": "https://philpapers.org/rec/MILPR",
      "philpapers_id": "MILPR",
      "snippet": "Millikan on Honeybee Navigation and Communication.Michael Rescorla - 2012 - In Dan Ryder, Justine Kingsbury &amp; Kenneth Williford, Millikan and her critics. Malden, MA: Wiley. pp. 87–106. Teleosemantics and universal hybridity.Karl Gustav Bergman - forthcoming - Erkenntnis:1-26.",
      "page_age": null
    },
    {
      "title": "Karen Neander, Toward an Informational Teleosemantics",
      "url": "https://philpapers.org/rec/NEATAI",
      "philpapers_id": "NEATAI",
      "snippet": "In Dan Ryder, Justine Kingsbury &amp; Kenneth Williford, Millikan and her critics. Malden, MA: Wiley. pp. 21--40 (2012) ... This chapter contains section titles: Introduction Response Functions Information and Singular Causation The Functions of Sensory Representations The Contents of Sensory Representations: The Problem of Error The Contents of Sensory Representation: The Distality Problem. ... Distality problem Informational teleosemantics ...",
      "page_age": null
    },
    {
      "title": "David Papineau, Teleosemantics and indeterminacy",
      "url": "https://philpapers.org/rec/PAPTAI",
      "philpapers_id": "PAPTAI",
      "snippet": "Content and Function: A Defense of Millikanian Teleosemantics.Justine Margaret Joy Kingsbury - 1999 - Dissertation, Rutgers the State University of New Jersey - New Brunswick",
      "page_age": null
    },
    {
      "title": "Sören Häggqvist, Teleosemantics: Etiological Foundations",
      "url": "https://philpapers.org/rec/HGGTEF",
      "philpapers_id": "HGGTEF",
      "snippet": "Teleosemantics is a naturalistic research programme in the philosophy of mind and language. Its ambition is to achieve a reduction, first, of mental content to teleological function; second, of teleological function to non‐teleological notions.",
      "page_age": null
    },
    {
      "title": "Paul Sheldon Davies, The Excesses of Teleosemantics",
      "url": "https://philpapers.org/rec/DAVTEO-42",
      "philpapers_id": "DAVTEO",
      "snippet": "An Input Condition for Teleosemantics? Reply to Shea (and Godfrey-Smith).Ruth Garrett Millikan - 2007 - Philosophy and Phenomenological Research 75 (2):436-455.",
      "page_age": null
    },
    {
      "title": "David Papineau & Nicholas Shea, Ruth Millikan’s On Clear and Confused Ideas",
      "url": "https://philpapers.org/rec/DAVRMO",
      "philpapers_id": "DAVRMO",
      "snippet": "Those who know Millikan only for her teleosemantics will find the themes in this book new. And those who think of Millikan as primarily concerned with empirical questions of biology and psychology may be surprised by her range of influences. The book features figures like Wilfred Sellars, P.",
      "page_age": null
    },
    {
      "title": "Marshall Abrams, Teleosemantics without natural selection",
      "url": "https://philpapers.org/rec/ABRTWN",
      "philpapers_id": "ABRTWN",
      "snippet": "Ruth Millikan and others advocate theories which attempt to naturalize wide mental content (e.g. beliefs ... Setup an account with your affiliations in order to access resources via your University&#x27;s proxy server · Sign in / register and customize your OpenURL resolver ... Evolutionary Causation and Teleosemantics.Tiago Rama - forthcoming - In MInd &amp; Life.",
      "page_age": null
    },
    {
      "title": "Justin Garson & David Papineau, Teleosemantics, selection and novel contents",
      "url": "https://philpapers.org/rec/GARTSA-12",
      "philpapers_id": "GARTSA",
      "snippet": "Language, Thought, and Other Biological Categories.Ruth Garrett Millikan - 1984 - Behaviorism 14 (1):51-56.",
      "page_age": null
    },
    {
      "title": "Ulrich E. Stegmann, A consumer‐based teleosemantics for animal signals",
      "url": "https://philpapers.org/rec/STEACT-2",
      "philpapers_id": "STEACT",
      "snippet": "In this article I first assess whether Ruth Millikan’s teleosemantic theory accounts for the content of animal signals. I conclude that it does not, because many signals do not exhibit the required sort of cooperation between signal‐producing and signal‐consuming devices.",
      "page_age": null
    }
  ],
  "count": 18,
  "errors": []
}
