{
  "status": "success",
  "source": "philpapers_via_brave",
  "query": "Chinese room Searle",
  "results": [
    {
      "title": "J. R. Searle, The Chinese room revisited",
      "url": "https://philpapers.org/rec/SEATCR",
      "philpapers_id": "SEATCR",
      "snippet": "J. R. Searle · Behavioral and Brain Sciences 5 (2):345-348 (1982) ... This article has no associated abstract. (fix it) ... Setup an account with your affiliations in order to access resources via your University&#x27;s proxy server · Sign in / register and customize your OpenURL resolver ... The Chinese room revisited : artificial intelligence and the nature of mind.Rodrigo Gonzalez - 2007 - Dissertation, Ku Leuven",
      "page_age": null
    },
    {
      "title": "Larry Hauser, Chinese room argument",
      "url": "https://philpapers.org/rec/HAUCRA",
      "philpapers_id": "HAUCRA",
      "snippet": "The Chinese room argument is a thought experiment of John Searle (1980a) and associated (1984) derivation. It is one of the best known and widely credited counters to claims of artificial intelligence (AI)—that is, to claims that computers ...",
      "page_age": null
    },
    {
      "title": "Robert I. Damper, The logic of Searle’s Chinese room argument",
      "url": "https://philpapers.org/rec/DAMTLO",
      "philpapers_id": "DAMTLO",
      "snippet": "John Searle’s Chinese room argument is a celebrated thought experiment designed to refute the hypothesis, popular among artificial intelligence scientists and philosophers of mind, that “the appropriately programmed computer really is a mind”. ...",
      "page_age": null
    },
    {
      "title": "John R. Searle, Twenty-one years in the chinese room",
      "url": "https://philpapers.org/rec/SEATYI",
      "philpapers_id": "SEATYI",
      "snippet": "John R. Searle · In John Mark Bishop &amp; John Preston, Views Into the Chinese Room: New Essays on Searle and Artificial Intelligence.",
      "page_age": null
    },
    {
      "title": "Larry Hauser, Searle's Chinese Box: Debunking the Chinese Room Argument",
      "url": "https://philpapers.org/rec/HAUSCB-2",
      "philpapers_id": "HAUSCB",
      "snippet": "John Searle&#x27;s Chinese room argument is perhaps the most influential andwidely cited argument against artificial intelligence (AI). Understood astargeting AI proper – claims that computers can think or do think– Searle&#x27;s argument, despite ...",
      "page_age": null
    },
    {
      "title": "John Mark Bishop & John Preston (eds.), Views Into the Chinese Room: New Essays on Searle and Artificial Intelligence",
      "url": "https://philpapers.org/rec/PREVIT",
      "philpapers_id": "PREVIT",
      "snippet": "The most famous challenge to computational cognitive science and artificial intelligence is the philosopher John Searle&#x27;s &quot;Chinese Room&quot; argument.",
      "page_age": null
    },
    {
      "title": "John McCarthy, John Searle's chinese room argument",
      "url": "https://philpapers.org/rec/MCCJSC",
      "philpapers_id": "MCCJSC",
      "snippet": "Strong AI is rather easy to refute and the basic argument can be summarized in one sentence: {it a system, me for example, could implement a program for understanding Chinese, for example, without understanding any Chinese at all.} This idea, when developed, became known as the Chinese Room Argument.&#x27;&#x27; &quot; The Chinese Room Argument can be refuted in one sentence ... This entry has no external links. Add one. Setup an account with your affiliations in order to access resources via your University&#x27;s proxy server · Only published works are available at libraries. ... Searle&#x27;s experiments with thought.William J.",
      "page_age": null
    },
    {
      "title": "Dale Jacquette, Fear and loathing (and other intentional states) in Searle's chinese room",
      "url": "https://philpapers.org/rec/JACFAL",
      "philpapers_id": "JACFAL",
      "snippet": "John R. Searle&#x27;s problem of the Chinese Room poses an important philosophical challenge to the foundations of strong artificial intelligence, and functionalist, cognitivist, and computationalist theories of mind. Searle has recently ...",
      "page_age": null
    },
    {
      "title": "David J. Chalmers, Subsymbolic computation and the chinese room",
      "url": "https://philpapers.org/rec/CHASCA-2",
      "philpapers_id": "CHASCA",
      "snippet": "With his now famous _Chinese Room_ argument, Searle claimed to show that despite the best efforts of AI researchers, a computer could never recreate such vital properties of human mentality as intentionality, subjectivity, and understanding.",
      "page_age": null
    },
    {
      "title": "Georges Rey, What’s Really Going On in Searle’s “Chinese room‘",
      "url": "https://philpapers.org/rec/REYWRG",
      "philpapers_id": "REYWRG",
      "snippet": "Fear and loathing (and other intentional states) in Searle&#x27;s chinese room.Dale Jacquette - 1990 - Philosophical Psychology 3 (2 &amp; 3):287-304.",
      "page_age": null
    },
    {
      "title": "Larry Hauser, Searle's Chinese Box: The Chinese Room Argument and Artificial Intelligence",
      "url": "https://philpapers.org/rec/HAUSCB",
      "philpapers_id": "HAUSCB",
      "snippet": "The apparently intelligent doings of computers occasion philosophical debate about artificial intelligence . Evidence of AI is not bad; arguments against AI are: such is the case for. One argument against AI--currently, perhaps, the most influential--is considered in detail: John Searle&#x27;s Chinese room argument .",
      "page_age": null
    },
    {
      "title": "Stevan Harnad, What's wrong and right about Searle's chinese room argument?",
      "url": "https://philpapers.org/rec/HARWWA",
      "philpapers_id": "HARWWA",
      "snippet": "Searle&#x27;s Chinese Room Argument showed a fatal flaw in computationalism (the idea that mental states are just computational states) and helped usher in the era of situated robotics and symbol grounding (although Searle himself thought neuroscience was the only correct way to understand the mind)",
      "page_age": null
    },
    {
      "title": "Paul Thagard, The emergence of meaning: how to escape Searle's Chinese room",
      "url": "https://philpapers.org/rec/THATEO-6",
      "philpapers_id": "THATEO",
      "snippet": "John Searle&#x27;s chinese room argument.John McCarthy - manuscript",
      "page_age": null
    },
    {
      "title": "Cutrona Jr, Zombies in Searle's chinese room: Putting the Turing test to bed",
      "url": "https://philpapers.org/rec/CUTZIS",
      "philpapers_id": "CUTZIS",
      "snippet": "Searle’s discussions over the ... they proceed from a correct assertion: “Instantiating a computer program is never by itself a sufficient condition of intentionality;” and an incorrect assertion: “The explanation ...",
      "page_age": null
    },
    {
      "title": "Ronald L. Chrisley, Weak Strong AI: An elaboration of the English Reply to the Chinese Room",
      "url": "https://philpapers.org/rec/CHRWSA-2",
      "philpapers_id": "CHRWSA",
      "snippet": "Searle (1980) constructed the Chinese Room (CR) to argue against what he called \\Strong AI&quot;: the claim that a computer can understand by virtue of running a program of the right sort.",
      "page_age": null
    },
    {
      "title": "Roger Penrose, Consciousness, computation, and the chinese room",
      "url": "https://philpapers.org/rec/PENCCA",
      "philpapers_id": "PENCCA",
      "snippet": "Neural depictions of &quot;world&quot; and &quot;self&quot;: Bringing computational understanding into the chinese room.Igor L. Aleksander - 2002 - In John Mark Bishop &amp; John Preston, Views Into the Chinese Room: New Essays on Searle and Artificial Intelligence.",
      "page_age": null
    },
    {
      "title": "B. Jack Copeland, The chinese room from a logical point of view",
      "url": "https://philpapers.org/rec/COPTCR",
      "philpapers_id": "COPTCR",
      "snippet": "Real robots and the missing thought-experiment in the chinese room dialectic.Selmer Bringsjord &amp; Ron Noel - 2002 - In John Mark Bishop &amp; John Preston, Views Into the Chinese Room: New Essays on Searle and Artificial Intelligence. London: Oxford University Press.",
      "page_age": null
    },
    {
      "title": "Anthony Freeman, The Chinese Room Comes of Age A Review of Preston & Bishop",
      "url": "https://philpapers.org/rec/FRETCR-4",
      "philpapers_id": "FRETCR",
      "snippet": "It was in 1980 that John Searle first opened the door of his Chinese Room, purporting to show that the conscious mind cannot, in principle, work like a digital computer. Searle, who speaks no Chinese, stipulated that locked in this fictitious ...",
      "page_age": null
    }
  ],
  "count": 18,
  "errors": []
}
