{
  "status": "success",
  "source": "semantic_scholar",
  "query": "metasemantics theory content determination",
  "results": [
    {
      "paperId": "33758c43026d658da0a05d232e42d0d7d1c29375",
      "title": "The Bounds of Thought: Prospects for a Norm-Based Metasemantics",
      "authors": [
        {
          "name": "E. V. Tracy",
          "authorId": "146668703"
        }
      ],
      "year": 2019,
      "abstract": null,
      "citationCount": 0,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/33758c43026d658da0a05d232e42d0d7d1c29375",
      "venue": "",
      "journal": null,
      "publicationTypes": null
    },
    {
      "paperId": "a2865ef0ca6abfe40f3e37c707598c2bddbc6b96",
      "title": "Content determination in dreams supports the imagination theory",
      "authors": [
        {
          "name": "Daniel Gregory",
          "authorId": "2330027893"
        }
      ],
      "year": 2024,
      "abstract": null,
      "citationCount": 1,
      "doi": "10.1007/s11098-024-02250-3",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/a2865ef0ca6abfe40f3e37c707598c2bddbc6b96",
      "venue": "Philosophical Studies",
      "journal": {
        "name": "Philosophical Studies",
        "pages": "3037 - 3057",
        "volume": "181"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "c7f8cac649203711640739b43d7592a433228289",
      "title": "Marx and Socially Necessary Labor Time. On the Content and Form of the Quantitative Determination of Value",
      "authors": [
        {
          "name": "G. Caligaris",
          "authorId": "2084053082"
        },
        {
          "name": "Alejandro Fitzsimons",
          "authorId": "2078658049"
        },
        {
          "name": "G. Starosta",
          "authorId": "103972151"
        }
      ],
      "year": 2025,
      "abstract": "This article revisits the debates on socially necessary labor-time (SNLT) in the light of contemporary discussions of Marx´s value-theory, which have tended to move from a rather narrow focus on the explanation of the economic basis of the exploitation of wage-workers, to a wider critical inquiry into the social constitution of alienated forms of mediation that structure capitalist society. Moreover, this re-examination of SNLT draws on a novel reading of the textual evidence offered by the critical edition of the manuscripts for Capital, against the backdrop of a brief overview of the controversies between the three main interpretations which can be found in the literature, and the development of an alternative systematic-dialectical presentation of the constitution of the content and concrete forms of realization of the quantitative determination of value.",
      "citationCount": 0,
      "doi": "10.1177/00368237251334194",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/c7f8cac649203711640739b43d7592a433228289",
      "venue": "Science &amp; Society: A Journal of Marxist Thought and Analysis",
      "journal": {
        "name": "Science & Society",
        "pages": "129 - 152",
        "volume": "89"
      },
      "publicationTypes": [
        "JournalArticle",
        "Review"
      ]
    },
    {
      "paperId": "1b879500c8126bf4d6c1eb7a79bf998d866e4e92",
      "title": "Evaluation of a Multidisciplinary Bachelor Course on Pain with Autonomy-Supportive Teaching Strategies through the Lens of Self-Determination Theory",
      "authors": [
        {
          "name": "A. H. van Houwelingen",
          "authorId": "2061202795"
        },
        {
          "name": "R. Kusurkar",
          "authorId": "4582687"
        },
        {
          "name": "F. Engels",
          "authorId": "2186656"
        }
      ],
      "year": 2021,
      "abstract": "To stimulate learners’ autonomy, autonomy-supportive teaching strategies were included in the design of a multidisciplinary elective course on pain. During this course, students explored pain from different disciplinary angles, i.e., from biomedical, psychological, arts, philosophical, and anthropological perspectives. In the course, autonomy was stimulated by giving students freedom of choice, especially in their final assignments. The aim of this study was to explore students’ freedom of choice and students’ perceptions of the multidisciplinary course on pain, particularly students’ perception of autonomy in the light of self-determination theory (SDT). To address the aim of this study, a mixed methods approach was used. Directed content analysis was conducted on a reflective part of the final individual assignment and was used to find categories fitting within SDT and also outside it. In addition to this, the diversity of topics as well as different disciplines present in the final individual assignments was explored to demonstrate students’ freedom of choice. This study shows that the course setup supported students’ autonomy and relatedness and stimulated students’ interest in and relevance to pain. Moreover, it stimulated students’ freedom of choice and stimulated curiosity towards disciplines such as arts and philosophy. Therefore, it can be concluded that we successfully developed a multidisciplinary course on pain in which students are exposed to different autonomy-supportive teaching strategies based on the SDT framework.",
      "citationCount": 6,
      "doi": "10.3390/pharmacy9010066",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/1b879500c8126bf4d6c1eb7a79bf998d866e4e92",
      "venue": "Pharmacy",
      "journal": {
        "name": "Pharmacy: Journal of Pharmacy Education and Practice",
        "volume": "9"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "8214afc3c14260e3cd6b16d3a7e6f72011f4635e",
      "title": "Words and Meaning in Metasemantics",
      "authors": [
        {
          "name": "J. Colomina-Almiñana",
          "authorId": "1419337700"
        }
      ],
      "year": 2022,
      "abstract": "In Words and Meaning in Metasemantics, Juan José Colomina-Almiñana puts forward a new way of understanding the linguistic and philosophical foundations of the study of language: the Interactive Theory. This theory states that the meaning of our sentences is much more than the truth values their components clauses carry. Since language is a human artifact, Words and Meaning in Metasemantics also explains the role that our reasons, dispositions, inferences, acts, and awareness have in the content-fixing of the sentences speakers employ to refer to the world in which they belong.",
      "citationCount": 0,
      "doi": "10.5040/9781978738263",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/8214afc3c14260e3cd6b16d3a7e6f72011f4635e",
      "venue": "",
      "journal": null,
      "publicationTypes": [
        "Book"
      ]
    },
    {
      "paperId": "86286186820e72054fd848c4237c41f2ec3bfa69",
      "title": "Semantics and Metasemantics in the Brentano School",
      "authors": [
        {
          "name": "D. G. Mironov",
          "authorId": "2124441438"
        }
      ],
      "year": 2022,
      "abstract": "The article analyzes a semantic theory proposed by the main representatives of the Brentano School and clarifies the characteristic features of the Brentanist philosophy of language. The first section identifies the specificity of Brentano’s functional approach to language, and separately examines how Brentano de­fined the communicative meaning of expressions. The second section reproduces the scheme in accordance with which A. Marty studied language communica­tion, and also discusses in detail his method of descriptive analysis of meanings. On the example of the doctrine of the inner linguistic form, it is shown what in­fluence descriptive psychology had on semantic research. On the example of the doctrine of the judgmental content it is demonstrated how Marty explained the representative properties of expressions. In the third section, A. Meinong’s semantic theory is reconstructed. It is discussed how Meinong interpreted the se­miotics of E. Martinak and how he approached the issue of defining the concept of meaning. The problem of the unity of sentences is particularly analyzed and Meinong’s solution is reproduced. It is shown what changes Meinong made to the theory of meaning, and what influence the theory of incomplete objects had on his semantic doctrine. The interpretation and evaluation of Meinong’s late semantic theory is proposed. Finally, in the fourth section, E. Husserl’s the­ory of meaning is analyzed. It is shown that Husserl distinguished several senses of the concept of meaning and considered the main sense to be the one that al­lows identifying the concept of meaning with the concept of content. The clarifi­cations made by Husserl to the thesis of the ideality of meanings are discussed. It is demonstrated that the new concept of meaning analysis associated with the clarified thesis makes it possible to evaluate Husserl's semantic theory as more universal than Meinong’s theory.",
      "citationCount": 0,
      "doi": "10.21146/0042-8744-2022-10-166-175",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/86286186820e72054fd848c4237c41f2ec3bfa69",
      "venue": "Voprosy filosofii",
      "journal": {
        "name": "Voprosy Filosofii"
      },
      "publicationTypes": null
    },
    {
      "paperId": "de4753bf84dc35fe1153d7982a5ae7f589b2c9cb",
      "title": "Marx's Theory of Alienated Labor and Its Contemporary Value",
      "authors": [
        {
          "name": "Ya Zhang",
          "authorId": "2393791694"
        }
      ],
      "year": 2025,
      "abstract": "The theory of \"alienated labor\" is a crucial component of Marx's \"Economic and Philosophical Manuscripts of 1844\". It also provides strong support for analyzing the poverty of workers under the capitalist mode of production. Marx made extensive discussions on \"alienated labor\", constructed a relatively complete conceptual system, and systematically analyzed the fourfold determination of alienated labor as the primary content. On the basis of analyzing the fourfold determination, exploring the hidden relationship between alienated labor and private property, and seeking practical ways to eliminate alienated labor are the key to truly grasping Marx's theory of alienated labor. This theory is not only a major theoretical achievement of Marx's criticism of bourgeois political economy, but also an important breakthrough for the formation of his historical materialism. It can be said that the issue of alienation plays a connecting role in Marxism, especially in Marxist political economy. Considering the current development of China's economy and society in the context of the new era, the new development concept implemented in the development of socialism with Chinese characteristics embodies the practical significance and guiding value of Marx's theory of alienated labor: promoting the construction of a community with a shared future for man and nature through innovative development and green development; advancing the building of harmonious labor relations through shared development and open development; and facilitating the free and all-round development of human beings through coordinated development.",
      "citationCount": 0,
      "doi": "10.62051/ijsspa.v9n1.09",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/de4753bf84dc35fe1153d7982a5ae7f589b2c9cb",
      "venue": "International Journal of Social Sciences and Public Administration",
      "journal": {
        "name": "International Journal of Social Sciences and Public Administration"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "fa47b6c5d0eeccd719fa695cfc564176a10adf63",
      "title": "Robustness, Exploitable Relations and History: Assessing Varitel Semantics as a Hybrid Theory of Representation",
      "authors": [
        {
          "name": "Nicolás Sebastián Sánchez",
          "authorId": "2316805751"
        }
      ],
      "year": 2024,
      "abstract": "A constitutive theory of representation must address two challenges. The content determination challenge requires specifying why a particular state has a given content. The job description challenge requires spelling out the explanatory role that representational notions play in that theory. Recently, Nicholas Shea has advanced varitel semantics as a hybrid approach to representation to answer those challenges, supplementing teleosemantics with non-historical features —namely, exploitable relations and robustness. In this paper, I critically assess the hybrid theory’s answers to both challenges, arguing that their hybrid nature undermines their merits. In each case, I will show that it is hard to establish how the alleged complementariness of the hybrid account components works. I will conclude that internal problems beset Shea’s theory of representation.",
      "citationCount": 0,
      "doi": "10.22201/iifs.18704905e.2024.1571",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/fa47b6c5d0eeccd719fa695cfc564176a10adf63",
      "venue": "Critica",
      "journal": {
        "name": "Crítica (México D. F. En línea)"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "2466a27a11d29a744432de41d3806985fe285160",
      "title": "Theory, philosophy and sociology of Music in Ancient and Modern Confucianism",
      "authors": [
        {
          "name": "Junxi Zhu",
          "authorId": "2347775282"
        }
      ],
      "year": 2025,
      "abstract": "\n Confucian ideas are deeply rooted in Chinese traditional culture, having played a crucial role in the formation and development of China's traditional musical art. This research focuses on the historical evolution and modern transformation of Confucian musical thought, systematically analyzing the philosophical content, social functions and practical value of its theoretical system in the context of various historical eras. The work is developing in three key areas: The first part is devoted to the theoretical system of ancient Confucian music, examining how ancient Confucianism integrated music into the cosmological paradigm of the \"unity of Heaven and man\", forming an ethical and pedagogical system based on the triadic system of interaction \"sound - emotion — virtue\"; the second part is devoted to the Philosophy of Confucian music in the era of modernization, An analysis of the theoretical reconstruction of Confucian musical philosophy in the context of the modernization turn of the New Age, where the traditional \"ritual-musical system\" (礼乐制度) was transformed under the influence of Western rationalism and technocratic civilization into the \"aesthetics of spiritual nature\"; the third part is devoted to practical value in modern society, the study of ways of creative transformation Confucian music theory in the context of globalization and digital technologies through the prism of cultural management, educational practices and environmental ethics. The present study overcomes the one-dimensional historical and philosophical narrativization, revealing the immanent logic of \"variability-immutability\" of Confucian music theory through a triad of methodological perspectives: philosophical ontology, political sociology and cultural praxeology. These conclusions form the theoretical basis for the reinterpretation of traditional cultural resources in the context of modernity, while simultaneously offering epistemological guidelines for the rehabilitation of the humanistic dimension in the era of technological determination.\n",
      "citationCount": 0,
      "doi": "10.25136/2409-8728.2025.2.73435",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/2466a27a11d29a744432de41d3806985fe285160",
      "venue": "Философская мысль",
      "journal": {
        "name": "Философская мысль"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "52f5f469427f4f84c3a883e7c51282e8e1f604bf",
      "title": "Rationalist Metaphysics, Semantics, and Metasemantics",
      "authors": [
        {
          "name": "Mark van Roojen",
          "authorId": "147624137"
        }
      ],
      "year": 2018,
      "abstract": "Rationalism offers an account of moral properties as a subset of the properties which serve to rationalize right actions, and these properties are fit to be the referents of our moral terms. That fitness can be exploited in constructing an externalist theory of reference determination for these terms. The resulting externalist theory draws support from standard responses to Moral Twin-Earth scenarios. The relevance of these responses to moral semantics has recently been vigorously challenged by Dowell and by Schroeter and Schroeter. The social character of meaning relations, which can explain the openness of questions about an analysis, may thereby also make Twin-Earth judgements beside the point. But the resources available to translators go beyond semantic competence and it is these resources that nonetheless make the Moral Twin-Earth responses relevant.",
      "citationCount": 0,
      "doi": "10.1093/oso/9780198797074.003.0008",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/52f5f469427f4f84c3a883e7c51282e8e1f604bf",
      "venue": "Oxford Scholarship Online",
      "journal": {
        "name": "Oxford Scholarship Online"
      },
      "publicationTypes": null
    },
    {
      "paperId": "f44424f4c8a92e9ed4800db63aa5b427aa808e5b",
      "title": "Rise of the swamp creatures: Reflections on a mechanistic approach to content",
      "authors": [
        {
          "name": "Jonny Lee",
          "authorId": "2333791680"
        }
      ],
      "year": 2021,
      "abstract": "ABSTRACT Recent developments in the literature suggest cognitive representation can be conceived of as a kind of mechanism that meets the functional profile set out by the S-representation account. However, this approach is threatened by worries that the S-representation account cannot tell a satisfactory story about content determination at the subpersonal level. One solution is to complement the S-representation account with a traditional etiological theory of content determination. This paper argues such a move is unwarranted and threatens the broader project of understanding representation in mechanism-friendly terms. Once properly situated within a mechanistic framework, the S-representation account can address the issue of content determination without supplementing it with an etiological theory. In turn, this strengthens the notion that combing a mechanistic framework with the S-representation account provides a robust and comprehensive defense of representation’s positive role in cognitive science.",
      "citationCount": 11,
      "doi": "10.1080/09515089.2021.1918658",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/f44424f4c8a92e9ed4800db63aa5b427aa808e5b",
      "venue": "",
      "journal": {
        "name": "Philosophical Psychology",
        "pages": "805 - 828",
        "volume": "34"
      },
      "publicationTypes": null
    },
    {
      "paperId": "30cb2926e07c304186b2f83c998927dce97075e2",
      "title": "Charity Versus Knowledge Maximization",
      "authors": [
        {
          "name": "William Child",
          "authorId": "2403239238"
        }
      ],
      "year": 2025,
      "abstract": null,
      "citationCount": 2,
      "doi": "10.1007/s11245-025-10225-0",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/30cb2926e07c304186b2f83c998927dce97075e2",
      "venue": "Topoi",
      "journal": {
        "name": "Topoi",
        "pages": "1227 - 1239",
        "volume": "44"
      },
      "publicationTypes": null
    },
    {
      "paperId": "d1c761caf8bb5ca0e5c9a9d8388a994df97a68e4",
      "title": "Saving Conceptual Role Expressivism from Defect",
      "authors": [
        {
          "name": "Sebastian Köhler",
          "authorId": "2120382483"
        }
      ],
      "year": 2025,
      "abstract": "Recently, it has been suggested that expressivism’s commitments about normative judgments should be cashed out in terms of conceptual role semantics. However, conceptual role expressivism has a central gap in its theory of content determination: it is unable to explain in virtue of what normative concepts have the kinds of contents that allow them to meaningfully embed in complex thoughts and participate in genuine inference. This paper offers conceptual role expressivists a way to close this gap, by fleshing out the idea that concepts have the relevant sorts of contents just in case and because they could otherwise not play their distinctive function.",
      "citationCount": 1,
      "doi": "10.5840/jphil2025122511",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/d1c761caf8bb5ca0e5c9a9d8388a994df97a68e4",
      "venue": "Journal of Philosophy",
      "journal": {
        "name": "The Journal of Philosophy"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "e7018c570e35e55b817b07b0b205c20ec9d8cac3",
      "title": "Millikan vs. Millikan: biosemantics and the role of the consumer",
      "authors": [
        {
          "name": "Peter Schulte",
          "authorId": "2323886356"
        }
      ],
      "year": 2025,
      "abstract": null,
      "citationCount": 0,
      "doi": "10.1007/s11229-025-05241-x",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/e7018c570e35e55b817b07b0b205c20ec9d8cac3",
      "venue": "Synthese",
      "journal": {
        "name": "Synthese",
        "volume": "206"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "7349ba050d5d432896b53d21bec2c3df96ec57be",
      "title": "Coordination, Content, and Conflation",
      "authors": [
        {
          "name": "Kyle Landrum",
          "authorId": "2154835724"
        }
      ],
      "year": 2022,
      "abstract": "ABSTRACT Coordination is the presumption that distinct representations have the same referential content. Philosophers have discussed ways in which the presence of coordination might bear on the metasemantic determination of content. One test case for exploring the relationship between coordination and content is the phenomenon of conflation—the situation in which representations are about distinct things but are nevertheless coordinated. In this paper, I use observations about conflation to develop an anaphoric metasemantics for some representations in which coordination plays an integral role. I also develop some novel remarks on the problem of misrepresentation.",
      "citationCount": 0,
      "doi": "10.1080/00048402.2022.2034172",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/7349ba050d5d432896b53d21bec2c3df96ec57be",
      "venue": "Australasian Journal of Philosophy",
      "journal": {
        "name": "Australasian Journal of Philosophy",
        "pages": "638 - 652",
        "volume": "101"
      },
      "publicationTypes": null
    },
    {
      "paperId": "e8b9c28033d4fd8d6eae0a1f28f4e6b5507e2f31",
      "title": "Hegel’s Logic as a Theory of Meaning: Material-Conceptual and Structural Aspects",
      "authors": [
        {
          "name": "P. Stekeler-Weithofer",
          "authorId": "2069039994"
        }
      ],
      "year": 2023,
      "abstract": "The paper analyzes main logical categories in Hegel’s Logic from the standpoint of contemporary formal logic and analytic philosophy of language. Hegel is taken as a radical critical philosopher in Kantian sense, who develops Kantian critical philosophy. Hegel’s Logic is portrayed as metaphysics and semantics, for it provides a profound analysis of logical form of main categories and the logical structure of local speech domains. The author considers subjectivity of judgements, constitution of sortal domains and an inferentialist account of predicates within logical universe of discourse. Speech acts are always singular acts that are performed and articulated by speakers. The content of a judgement is constituted due to the intricate genus-species difference system, which is expressed by the concepts of infinite negation and determinate negation. Some speech acts require knowledge not only of generic properties that are inherent to genus of a subject matter, but also contentful determination of difference of the particular individuals in question. Sense of predicates is determined within an inferential system of sentences and their relations of inference and contradiction. The form of inference is defined solely syntactically or logically, however for any particular case is required contentful knowledge, which is based on pre-knowledge and power of judgement. The system of science is a network of material- conceptual truths taken as synthetic judgements a priori. Hegelian concept of “idea” signifies adequate theoretical and shared practical forms that include the ways of evaluation of generic judgements as correct or true ones, which should serve to our orientation in the world. Hence the idea is essentially the same as the personal form of human life.",
      "citationCount": 0,
      "doi": "10.17323/0869-5377-2023-2-39-67",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/e8b9c28033d4fd8d6eae0a1f28f4e6b5507e2f31",
      "venue": "Philosophical Literary Journal Logos",
      "journal": {
        "name": "Philosophical Literary Journal Logos"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "69703a1c0d461d55eb1959ffa615022c06b25c22",
      "title": "The Right to Informational Self-Determination: On the Edge of Public and Private",
      "authors": [
        {
          "name": "E. Talapina",
          "authorId": "2129157341"
        }
      ],
      "year": 2022,
      "abstract": "The right to informational self-determination, as the authority of the individual to decide fundamentally for herself, when and within what limits personal data may be disclosed, was formulated by German jurisprudence and has become a model for many States as well as for European Law in general. It is seen as a necessary tool for maintaining a vibrant democracy, on the basis that privacy is an “integral part” of society. The basis for the judicial decision was the Kantian theory of the moral autonomy of the individual. This explains the close connection of judicial reasoning with human rights and their Public Law protection. At the same time, under Anglo-Saxon influence, a “property approach” to personal data which may become the object of transactions is developing. The “property approach” views personal data as a valuable commodity that can be the object of transactions and operations with other people through licenses. In practice, access to personal data has recently been increasingly provided as a counter performance (compensation) to contracts for the provision of digital content and in exchange for personalized services. The study shows there are many interactions of public and private in the legal protection of data (information self-determination as a subjective public right requires the corresponding obligations of the State to be formalized, there is no unambiguous sector qualification of a person’s consent to data processing, the insufficiency of the principle of confidentiality by default before the potential for harm is noted). Analysis of the evolution of the data legal protection leads to conclude that the public/private distinction is gradually levelling off. It seems that the problem of the circulation and protection of personal data cannot be solved in a sector framework, but only comprehensively, without violating the traditional logic of public and private. This means that the right to information self-determination, due to its complex nature, can be regarded as a principle that has an inter-branch nature extends to both the Public Law data protection and the implementation of subjective civil rights in this area.",
      "citationCount": 0,
      "doi": "10.17323/2713-2749.2022.4.34.51",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/69703a1c0d461d55eb1959ffa615022c06b25c22",
      "venue": "Legal Issues in the Digital Age",
      "journal": {
        "name": "Legal Issues in the Digital Age"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "aa1a0f56425f497fe55e3c8a6fb042395089bb67",
      "title": "Metasemantics and Metaethics",
      "authors": [
        {
          "name": "Laura Schroeter",
          "authorId": "47337078"
        },
        {
          "name": "François Schroeter",
          "authorId": "144682755"
        }
      ],
      "year": 2017,
      "abstract": null,
      "citationCount": 7,
      "doi": "10.4324/9781315213217.CH33",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/aa1a0f56425f497fe55e3c8a6fb042395089bb67",
      "venue": "",
      "journal": {
        "name": "",
        "pages": "519-535",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "a6bc412b0b1e21e76d699a6ed1a30be495881e8f",
      "title": "Christian Foundations of the Idea of Freedom in Philosophy of B. P. Vysheslavtsev",
      "authors": [
        {
          "name": "N. Misyurov",
          "authorId": "120668257"
        }
      ],
      "year": 2025,
      "abstract": "The article examines the problem of the “sovereign rights” of the individual in the philosophy of B. P. Vysheslavtsev.\nThe Fichtean “justification of freedom” is actualised by the need to counteract the transformation of man into a “capitalist function”.\nSuch anthropology is focused on the unity of free human will and the “life-giving goodness” of being: the central metaphysical\nquestion is about the ideal. Religious experience provides the necessary grounds for developing a theory of the world as a single\nwhole. The “universal” idea, which unites the theoretical and practical, as well as the aesthetic content of the concept, is, first of all,\nthe idea of Christian love. Any social (“organic”) function acts normally and abnormally, allowing abuses and generating injustice.\nThe Christian worldview, self-determination of the individual — the realisation of a specific moral ideal, free spiritual creativity allow\nto resist the “philosophical poverty” of industrial culture and “collective impersonality”.",
      "citationCount": 0,
      "doi": "10.36809/2309-9380-2025-46-31-37",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/a6bc412b0b1e21e76d699a6ed1a30be495881e8f",
      "venue": "Review of Omsk State Pedagogical University. Humanitarian research",
      "journal": {
        "name": "Review of Omsk State Pedagogical University. Humanitarian research"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "dd75828286482f3680a1fef7a608b03f251c39d1",
      "title": "CONNECTION BETWEEN DETERMINATION AND NEGATION",
      "authors": [
        {
          "name": "Bhakti Madhava Puri",
          "authorId": "2070529873"
        }
      ],
      "year": 2022,
      "abstract": null,
      "citationCount": 0,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/dd75828286482f3680a1fef7a608b03f251c39d1",
      "venue": "",
      "journal": null,
      "publicationTypes": null
    }
  ],
  "count": 20,
  "errors": []
}
