{
  "status": "success",
  "source": "semantic_scholar",
  "query": "pragmatism meaning grounding semantics",
  "results": [
    {
      "paperId": "7b1d23a8332e98bdb6003fd5749493b8d73b0db3",
      "title": "Social semantics: the organization and grounding of abstract concepts",
      "authors": [
        {
          "name": "P. Pexman",
          "authorId": "3100481"
        },
        {
          "name": "Veronica Diveica",
          "authorId": "2067351859"
        },
        {
          "name": "Richard J. Binney",
          "authorId": "1766568"
        }
      ],
      "year": 2021,
      "abstract": "Abstract concepts, like justice and friendship, are central features of our daily lives. Traditionally, abstract concepts are distinguished from other concepts in that they cannot be directly experienced through the senses. As such, they pose a challenge for strongly embodied models of semantic representation that assume a central role for sensorimotor information. There is growing recognition, however, that it is possible for meaning to be ‘grounded’ via cognitive systems, including those involved in processing language and emotion. In this article, we focus on the specific proposal that social significance is a key feature in the representation of some concepts. We begin by reviewing recent evidence in favour of this proposal from the fields of psycholinguistics and neuroimaging. We then discuss the limited extent to which there is consensus about the definition of ‘socialness’ and propose essential next steps for research in this domain. Taking one such step, we describe preliminary data from an unprecedented large-scale rating study that can help determine how socialness is distinct from other facets of word meaning. We provide a backdrop of contemporary theories regarding semantic representation and social cognition and highlight important predictions for both brain and behaviour. This article is part of the theme issue ‘Concepts in interaction: social engagement and inner experiences’.",
      "citationCount": 35,
      "doi": "10.1098/rstb.2021.0363",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/7b1d23a8332e98bdb6003fd5749493b8d73b0db3",
      "venue": "Philosophical Transactions of the Royal Society of London. Biological Sciences",
      "journal": {
        "name": "Philosophical Transactions of the Royal Society B: Biological Sciences",
        "volume": "378"
      },
      "publicationTypes": [
        "Review",
        "JournalArticle"
      ]
    },
    {
      "paperId": "2a6ea3d8ad7ef4fb1ca0b1568748c284c156eb42",
      "title": "It’s the Meaning That Counts: The State of the Art in NLP and Semantics",
      "authors": [
        {
          "name": "Daniel Hershcovich",
          "authorId": "2307003419"
        },
        {
          "name": "L. Donatelli",
          "authorId": "51225576"
        }
      ],
      "year": 2021,
      "abstract": null,
      "citationCount": 9,
      "doi": "10.1007/s13218-021-00726-6",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/2a6ea3d8ad7ef4fb1ca0b1568748c284c156eb42",
      "venue": "KI - Künstliche Intelligenz",
      "journal": {
        "name": "KI - Künstliche Intelligenz",
        "pages": "255 - 270",
        "volume": "35"
      },
      "publicationTypes": [
        "JournalArticle",
        "Review"
      ]
    },
    {
      "paperId": "77920252a2f8577910d0e07a4b988773f17c3851",
      "title": "Grounding without a Ground: A Peircean Conception of Semiotic Ethics",
      "authors": [
        {
          "name": "Jing Zhou",
          "authorId": "2386034280"
        }
      ],
      "year": 2025,
      "abstract": "Abstract:The fundamental aim of epistemology and moral philosophy is the pursuit of foundational principles. Pragmatism resolves the so-called \"fact-value dichotomy\" by showing how values emerge dynamically through practice, thus establishing a mutually constitutive relationship between knowledge and ethics. Charles S. Peirce's semiotics implicitly outlines an unfinished ethical project: semiotic ethics. When we think with signs that are triadically structured as representamen, object, and interpretant rather than think with concepts that are dyadically structured as meaning and reference, we will have the opportunity to transcend all traditional forms of dualism. Semiosis simultaneously configures the cognitive \"I-World\" relations and the ethical \"I-We\" relations, thereby enacting the dual grounding of epistemology and moral philosophy. A critical engagement with Karl-Otto Apel's transcendental interpretation of Peircean semiotics reveals that such dual grounding can be realized through the dynamic, evolving practices of communities, resulting in a grounding without a metaphysical Ground for epistemology and ethics. The triadic nature of signs, the normative dimensions of communal practices, and an orientation toward future-directed immanent transcendence collectively underpin this dual grounding task, illuminating the interdependence of ethical norms and epistemic construction.",
      "citationCount": 0,
      "doi": "10.2979/csp.00043",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/77920252a2f8577910d0e07a4b988773f17c3851",
      "venue": "Transactions of the Charles S. Peirce Society",
      "journal": {
        "name": "Transactions of the Charles S. Peirce Society: A Quarterly Journal in American Philosophy",
        "pages": "52 - 71",
        "volume": "61"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "2e861d63905f74383a97d4f30e7be843cb17051a",
      "title": "On measuring grounding and generalizing grounding problems",
      "authors": [
        {
          "name": "Daniel Quigley",
          "authorId": "2397382182"
        },
        {
          "name": "Eric Maynard",
          "authorId": "2397387387"
        }
      ],
      "year": 2025,
      "abstract": "The symbol grounding problem asks how tokens like cat can be about cats, as opposed to mere shapes manipulated in a calculus. We recast grounding from a binary judgment into an audit across desiderata, each indexed by an evaluation tuple (context, meaning type, threat model, reference distribution): authenticity (mechanisms reside inside the agent and, for strong claims, were acquired through learning or evolution); preservation (atomic meanings remain intact); faithfulness, both correlational (realized meanings match intended ones) and etiological (internal mechanisms causally contribute to success); robustness (graceful degradation under declared perturbations); compositionality (the whole is built systematically from the parts). We apply this framework to four grounding modes (symbolic; referential; vectorial; relational) and three case studies: model-theoretic semantics achieves exact composition but lacks etiological warrant; large language models show correlational fit and local robustness for linguistic tasks, yet lack selection-for-success on world tasks without grounded interaction; human language meets the desiderata under strong authenticity through evolutionary and developmental acquisition. By operationalizing a philosophical inquiry about representation, we equip philosophers of science, computer scientists, linguists, and mathematicians with a common language and technical framework for systematic investigation of grounding and meaning.",
      "citationCount": 0,
      "doi": null,
      "arxivId": "2512.06205",
      "url": "https://www.semanticscholar.org/paper/2e861d63905f74383a97d4f30e7be843cb17051a",
      "venue": "",
      "journal": null,
      "publicationTypes": null
    },
    {
      "paperId": "2ae7e6970e9731579673f5324fc71ab334067558",
      "title": "Multilevel-Grounded Semantics: Representation, Intension and Referentiality in Music",
      "authors": [
        {
          "name": "Mihailo Antović",
          "authorId": "72590455"
        }
      ],
      "year": 2025,
      "abstract": "The article introduces the author’s model of contextual constraints on the generation of musical meaning in an effort to suggest how the approach may be of interest to philosophers pursuing the problem of representation. Since the model is based on insights of linguistic semantics, representation is defined as an amodal functionalist construct relating music perception to an extramusical experience, which assumes varying degrees of imagistic and/or referential specificity. The theory proposes six such degrees, or “grounding boxes”: perceptual, cross-modal, affective, conceptual, culturally rich, and personal. In doing so, it turns classical dichotomies in musical semantics into continua, which lead the cognizer from more general to more concrete, more intrato more extramusical, more formal to more referential, more perceptual to more conceptual, and finally more ineffable to more representational sets of connotations. The system is illustrated with the analysis of the Ming the Merciless leit-motif from the 1980 science-fiction film Flash Gordon, composed by Freddie Mercury and performed by Queen.",
      "citationCount": 0,
      "doi": "10.5840/bjp20251713",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/2ae7e6970e9731579673f5324fc71ab334067558",
      "venue": "Balkan Journal of Philosophy",
      "journal": {
        "name": "Balkan Journal of Philosophy"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "b8f4ec29b874ad85ce628e1f06fb9f555e365d77",
      "title": "Proof-theoretic Semantics for Second-order Logic",
      "authors": [
        {
          "name": "A. Gheorghiu",
          "authorId": "1998518964"
        },
        {
          "name": "David J. Pym",
          "authorId": "2293720146"
        }
      ],
      "year": 2025,
      "abstract": "We develop a proof-theoretic semantics (P-tS) for second-order logic (S-oL), providing an inferentialist alternative to both full and Henkin model-theoretic interpretations. Our approach is grounded in base-extension semantics (B-eS), a framework in which meaning is determined by inferential roles relative to atomic systems -- collections of rules that encode an agent's pre-logical inferential commitments. We show how both classical and intuitionistic versions of S-oL emerge from this set-up by varying the class of atomic systems. These systems yield modular soundness and completeness results for corresponding Hilbert-style calculi, which we prove equivalent to Henkin's account of S-oL. In doing so, we reframe second-order quantification as systematic substitution rather than set-theoretic commitment, thereby offering a philosophically lightweight yet expressive semantics for higher-order logic. This work contributes to the broader programme of grounding logical meaning in use rather than reference and offers a new lens on the foundations of logic and mathematics.",
      "citationCount": 0,
      "doi": "10.48550/arXiv.2508.07786",
      "arxivId": "2508.07786",
      "url": "https://www.semanticscholar.org/paper/b8f4ec29b874ad85ce628e1f06fb9f555e365d77",
      "venue": "arXiv.org",
      "journal": {
        "name": "ArXiv",
        "volume": "abs/2508.07786"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "8e53bdd4f204aed92a09bd2fed535d0d1a6e728c",
      "title": "Disembodied Meaning? Generative AI and Understanding",
      "authors": [
        {
          "name": "Jordi Vallverdú",
          "authorId": "2351123536"
        },
        {
          "name": "Iván Redondo",
          "authorId": "2351129215"
        }
      ],
      "year": 2025,
      "abstract": "This study explores the cognitive and philosophical implications of Large Language Models (LLMs), focusing on their ability to generate meaning without embodiment. Grounded in the coherence-based semantics framework, the research challenges traditional views that emphasize the necessity of embodied cognition for meaningful language comprehension. Through a theoretical and comparative analysis, this paper examines the limitations of embodied cognition paradigms, such as the symbol grounding problem and critiques like Searle’s Chinese Room, and evaluates the practical capabilities of LLMs. The methodology integrates philosophical inquiry with empirical evidence, including case studies on LLM performance in tasks such as medical licensing exams, multilingual communication, and policymaking. Key findings suggest that LLMs simulate meaning-making processes by leveraging statistical patterns and relational coherence within language, demonstrating a form of operational understanding that rivals some aspects of human cognition. Ethical concerns, such as biases in training data and societal implications of LLM applications, are also analyzed, with recommendations for improving fairness and transparency. By reframing LLMs as disembodied yet effective cognitive systems, this study contributes to ongoing debates in artificial intelligence and cognitive science. It highlights their potential to complement human cognition in education, policymaking, and other fields while advocating for responsible deployment to mitigate ethical risks.",
      "citationCount": 2,
      "doi": "10.30564/fls.v7i3.8060",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/8e53bdd4f204aed92a09bd2fed535d0d1a6e728c",
      "venue": "Forum for Linguistic Studies",
      "journal": {
        "name": "Forum for Linguistic Studies"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "8c7da28b8ceacb2e20f6e3a8a1567d7b20990614",
      "title": "Pragmatism, Meaning and Learning in the Workplace",
      "authors": [
        {
          "name": "P. Gibbs",
          "authorId": "80807773"
        }
      ],
      "year": 2013,
      "abstract": null,
      "citationCount": 0,
      "doi": "10.1007/978-94-007-4759-3_12",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/8c7da28b8ceacb2e20f6e3a8a1567d7b20990614",
      "venue": "",
      "journal": {
        "name": "",
        "pages": "165-175",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "4eadc359402819731dc6314502bb561c27a672ce",
      "title": "From expectation to concepts: Toward multilevel grounding in musical semantics",
      "authors": [
        {
          "name": "Mihailo Antović",
          "authorId": "72590455"
        }
      ],
      "year": 2018,
      "abstract": null,
      "citationCount": 9,
      "doi": "10.1515/cogsem-2016-0005",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/4eadc359402819731dc6314502bb561c27a672ce",
      "venue": "",
      "journal": {
        "name": "Cognitive Semiotics",
        "pages": "105 - 138",
        "volume": "9"
      },
      "publicationTypes": null
    },
    {
      "paperId": "1b26adab948c797d9410a3952bf42a6ffb0cde55",
      "title": "Semantics and symbol grounding in Turing machine processes",
      "authors": [
        {
          "name": "Anna Sarosiek",
          "authorId": "2079469189"
        }
      ],
      "year": 2018,
      "abstract": "The aim of the paper is to present the underlying reason of the unsolved symbol grounding problem. The Church-Turing Thesis states that a physical problem, for which there is an algorithm of solution, can be solved by a Turing machine, but machine operations neglect the semantic relationship between symbols and their meaning. Symbols are objects that are manipulated on rules based on their shapes. The computations are independent of the context, mental states, emotions, or feelings. The symbol processing operations are interpreted by the machine in a way quite different from the cognitive processes. Cognitive activities of living organisms and computation differ from each other, because of the way they act in the real word. The result is the problem of mutual understanding of symbol grounding.",
      "citationCount": 1,
      "doi": "10.15633/SS.2492",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/1b26adab948c797d9410a3952bf42a6ffb0cde55",
      "venue": "Semina Scientiarum",
      "journal": {
        "name": "Semina Scientiarum"
      },
      "publicationTypes": null
    },
    {
      "paperId": "85a751d42db20eef74bb2bbfe711eea0057ca69d",
      "title": "Meaning, Representation and Meaning Grounds",
      "authors": [
        {
          "name": "María Cerezo",
          "authorId": "2322226581"
        }
      ],
      "year": 2024,
      "abstract": "This paper addresses three different themes concerning Zalabardo’s Pragmatist Semantics: Wittgenstein’s representational theory in the Tractatus, with a focus on the Tractarian interpretation of semantic discourses and the concept of elucidation; second, a brief re-examination of the notion of acceptance and the capacity of Zalabardo’s account to clarify the meaning grounds for semantic discourses containing vague predicates; and third, a discussion of the notion of grounding that underlies his account of meaning grounds",
      "citationCount": 0,
      "doi": "10.30827/trif.32783",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/85a751d42db20eef74bb2bbfe711eea0057ca69d",
      "venue": "Teorema. Revista Internacional de Filosofía",
      "journal": {
        "name": "Teorema. Revista Internacional de Filosofía"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "e6dac8d1b4a88eba904523ca68f637fa006aa50d",
      "title": "What is the Difference? Pragmatic Formalization of Meaning",
      "authors": [
        {
          "name": "I. Surov",
          "authorId": "100999096"
        }
      ],
      "year": 2024,
      "abstract": null,
      "citationCount": 0,
      "doi": "10.3103/S0147688224700588",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/e6dac8d1b4a88eba904523ca68f637fa006aa50d",
      "venue": "Scientific and Technical Information Processing",
      "journal": {
        "name": "Scientific and Technical Information Processing",
        "pages": "620 - 628",
        "volume": "51"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "01a95a3150d99f28d45b8039277dea8b34599b06",
      "title": "Grounding Aesthetic Preference in the Bodily Conditions of Meaning Constitution",
      "authors": [
        {
          "name": "A. Scarinzi",
          "authorId": "1846515"
        }
      ],
      "year": 2012,
      "abstract": "Mark Johnson’s work The Meaning of the Body presents John Dewey’s pragmatism and pragmatist aesthetics as the forerunners of the anti-Cartesian embodied enactive approach to human experience and meaning. He rejects the Kantian noncognitive character of aesthetics and emphasizes that aesthetics is the study of the human capacity to experience the bodily conditions of  meaning constitution that grows from our bodily conditions of life. Using Mark Johnson’s view as a starting-point, this paper offers the beginning of an enactive approach to aesthetic preference  contributing to bringing human aesthetic behavior research closer to the enactive approach to human experience. Following enactive studies on bodily sense-making and embodied emotions, I identify the bodily conditions of meaning constitution in which aesthetic preference is grounded with the subject’s self-regulatory visceral embodied constitution of viable degrees of value of the environmental factors according to her bodily structure. Unlike mainstream aesthetic preference research in empirical aesthetics, I claim that the subject’s aesthetic preference constitution requires the lived experience of the bodily conditions of meaning constitution through the conscious experience of the subjectively aroused lived body. The implausibility of the mind/body dichotomy of current aesthetic preference research is highlighted.",
      "citationCount": 5,
      "doi": "10.7146/NJA.V23I43.7499",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/01a95a3150d99f28d45b8039277dea8b34599b06",
      "venue": "",
      "journal": {
        "name": "The Nordic Journal of Aesthetics",
        "volume": "23"
      },
      "publicationTypes": null
    },
    {
      "paperId": "aee52b224deb096458c4391fefa5f9598b8f72e7",
      "title": "The Geometry of Meaning: Semantics Based on Conceptual Spaces",
      "authors": [
        {
          "name": "Peter Gärdenfors",
          "authorId": "2276714189"
        }
      ],
      "year": 2014,
      "abstract": null,
      "citationCount": 392,
      "doi": "10.7551/mitpress/9629.001.0001",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/aee52b224deb096458c4391fefa5f9598b8f72e7",
      "venue": "",
      "journal": {
        "name": "",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "37924bc837372c742645ceee1d698a3dcfe19288",
      "title": "Grounding, Mapping and Acts of Meaning",
      "authors": [
        {
          "name": "Th.A.J.M. Janssen",
          "authorId": "2157783"
        },
        {
          "name": "G. Redeker",
          "authorId": "72898196"
        },
        {
          "name": "M. D. Gruyter",
          "authorId": "2033027"
        },
        {
          "name": "C. Sinha",
          "authorId": "4546943"
        }
      ],
      "year": 1999,
      "abstract": null,
      "citationCount": 90,
      "doi": "10.1515/9783110803464.223",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/37924bc837372c742645ceee1d698a3dcfe19288",
      "venue": "",
      "journal": {
        "name": "",
        "volume": ""
      },
      "publicationTypes": [
        "Review"
      ]
    },
    {
      "paperId": "4369a0a2cc5cfbd49fe8ef0c4fa6186d47cc9f4f",
      "title": "Grounding Cognition: Dynamicity, Fictivity, and Scanning: The Imaginative Basis of Logic and Linguistic Meaning",
      "authors": [
        {
          "name": "R. Langacker",
          "authorId": "2167674"
        }
      ],
      "year": 2005,
      "abstract": null,
      "citationCount": 62,
      "doi": "10.1017/CBO9780511499968.008",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/4369a0a2cc5cfbd49fe8ef0c4fa6186d47cc9f4f",
      "venue": "",
      "journal": {
        "name": "",
        "pages": "164-197",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "62086f817836ccf5eed32c5065ce4929ae086089",
      "title": "Grounding Meaning in Perception",
      "authors": [
        {
          "name": "G. Cottrell",
          "authorId": "48524582"
        },
        {
          "name": "B. Bartell",
          "authorId": "3035187"
        },
        {
          "name": "Christopher Haupt",
          "authorId": "2069142198"
        }
      ],
      "year": 1990,
      "abstract": null,
      "citationCount": 41,
      "doi": "10.1007/978-3-642-76071-6_35",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/62086f817836ccf5eed32c5065ce4929ae086089",
      "venue": "German Workshop on Artificial Intelligence",
      "journal": {
        "pages": "307-321"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "b64aec421f135245abeb1b36483a7a6d9b3b5437",
      "title": "The distinction between semantics and pragmatics: The point of view of semiotics",
      "authors": [
        {
          "name": "C. Paolucci",
          "authorId": "2906465"
        }
      ],
      "year": 2021,
      "abstract": "Abstract In this paper I will try to outline the reasons why, in order to understand the life and the nature of meaning, the semiotic tradition has always thought that it was better not to separate semantics and pragmatics. I will first reconstruct the history of this idea, grounded in Pragmatism and in Structural Linguistics. Later, I will deal with its first formulation in A Theory of Semiotics by Umberto Eco. In the second part of the paper, I will work on the idea by Ferdinand de Saussure that meanings are values, that is, indeterminate entities whose identity is determined only through reciprocal determination. I will claim that this idea is the importation in linguistics of Leibniz’s principles of the differential calculus. In the final part of the paper, I will apply this idea to the distinction between semantics and pragmatics, claiming that meanings are better understood through a theory of modes of existence. If we understand the differential nature of meaning, we can see that meanings live only through the using of the expressions and these variations contribute to offer stability within the transformations, without creating a stable object defined by its properties and endowed with an independent existence split from the relationships that define it.",
      "citationCount": 2,
      "doi": "10.1515/ip-2021-2014",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/b64aec421f135245abeb1b36483a7a6d9b3b5437",
      "venue": "",
      "journal": {
        "name": "Intercultural Pragmatics",
        "pages": "293 - 307",
        "volume": "18"
      },
      "publicationTypes": null
    },
    {
      "paperId": "dc457643590a9c8155a53b31ce278375e785356c",
      "title": "The Geometry of Meaning: Semantics Based on Conceptual Spaces",
      "authors": [],
      "year": 2014,
      "abstract": null,
      "citationCount": 0,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/dc457643590a9c8155a53b31ce278375e785356c",
      "venue": "",
      "journal": {
        "name": "",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "3f4e679de9fbd468cc87fb1d5789af8ba935a36d",
      "title": "Grounding rules and (hyper-)isomorphic formulas",
      "authors": [
        {
          "name": "F. Poggiolesi",
          "authorId": "2612745"
        }
      ],
      "year": 2020,
      "abstract": "\n \n \nAn oft-defended claim of a close relationship between Gentzen inference rules and the meaning of the connectives they introduce and eliminate has given rise to a whole domain called proof-theoretic semantics, see Schroeder- Heister (1991); Prawitz (2006). A branch of proof-theoretic semantics, mainly developed by Dosen (2019); Dosen and Petric (2011), isolates in a precise mathematical manner formulas (of a logic L) that have the same meaning. These isomorphic formulas are defined to be those that behave identically in inferences. The aim of this paper is to investigate another type of recently discussed rules in the literature, namely grounding rules, and their link to the meaning of the connectives they provide the grounds for. In particular, by using grounding rules, we will refine the notion of isomorphic formulas through the notion of hyper-isomorphic formulas. We will argue that it is actually the notion of hyper-isomorphic formulas that identify those formulas that have the same meaning. \n \n \n",
      "citationCount": 4,
      "doi": "10.26686/ajl.v17i1.5694",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/3f4e679de9fbd468cc87fb1d5789af8ba935a36d",
      "venue": "Australasian Journal of Logic",
      "journal": {
        "name": "The Australasian Journal of Logic"
      },
      "publicationTypes": null
    }
  ],
  "count": 20,
  "errors": []
}
