{
  "status": "success",
  "source": "semantic_scholar",
  "query": "phenomenal intentionality consciousness",
  "results": [
    {
      "paperId": "89da4f59a58321c650c6cb3cba68ddcd534ca1ba",
      "title": "Phenomenal intentionality and the sense of togetherness: a defense of the consciousness-first approach to collective intentionality",
      "authors": [
        {
          "name": "Nathan Biglietti",
          "authorId": "2365804730"
        }
      ],
      "year": 2025,
      "abstract": null,
      "citationCount": 1,
      "doi": "10.1007/s11229-025-05055-x",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/89da4f59a58321c650c6cb3cba68ddcd534ca1ba",
      "venue": "Synthese",
      "journal": {
        "name": "Synthese",
        "volume": "205"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "1c69d2e710bd800dcafa4c0c1e302c67092ec5e0",
      "title": "Phenomenal Intentionality and Derived Intentionality A Commentary on David Pitt's The Quality of Thought",
      "authors": [
        {
          "name": "Angela Mendelovici",
          "authorId": "2592261"
        }
      ],
      "year": 2025,
      "abstract": "David Pitt's The Quality of Thought defends a hardcore version of phenomenal intentionalism, the view that at least the most basic kind of intentionality is nothing over and above phenomenal consciousness. The book is focused on the case of thought, advancing the view, roughly,\n that thoughts' contents are identical to their phenomenal characters. But the view is meant to apply more broadly to all intentional states: for Pitt, the content of any intentional state is identical to its phenomenal character. One of the most pressing challenges facing phenomenal\n intentionalism is that of accounting for allegedly intentional unconscious mental states. In response to this challenge, many phenomenal intentionalists develop a two-tiered picture of intentionality, maintaining that the most basic kind of intentionality, original intentionality, is nothing\n over and above phenomenal consciousness but that mental states can have another, less basic, kind of intentionality, derived intentionality, which is derived in some way from actual or possible originally intentional states. Pitt rejects this derivativist picture and maintains a hard-line\n position on which non-phenomenal states cannot have any kind of intentionality. In this symposium contribution, I consider Pitt's arguments against derivativist pictures of intentionality, arguing that the derivativist has a ready response. I suggest that even if derived intentionality belongs\n to a different natural kind than original intentionality, it plays an important role in the mind.",
      "citationCount": 1,
      "doi": "10.53765/20512201.32.3.175",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/1c69d2e710bd800dcafa4c0c1e302c67092ec5e0",
      "venue": "Journal of Consciousness Studies",
      "journal": {
        "name": "Journal of Consciousness Studies"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "83d0c791f1666ec754014487ec1dc0b90f383b2c",
      "title": "Brentano on phenomenal and transitive consciousness, unconscious consciousness, and phenomenal intentionality",
      "authors": [
        {
          "name": "Angela Mendelovici",
          "authorId": "2592261"
        }
      ],
      "year": 2021,
      "abstract": "In Brentano’s Philosophical System: Mind, Being, Value, Uriah Kriegel argues that Brentano’s work forms a “live philosophical program” (p. 14, italics omitted) that contemporary philosophy has much to learn from and that is promising and largely correct. To this end, Kriegel argues that Brentano’s notion of consciousness is the contemporary notion of phenomenal consciousness, that Brentano’s rejection of unconscious mentality is a grave mistake that can be fairly neatly excised from his overall view, and that Brentano’s notion of intentionality is the contemporary notion of phenomenal intentionality. This paper raises some doubts about these claims, suggesting that Brentano’s notion of consciousness might more closely align with the contemporary notion of transitive consciousness than with that of phenomenal consciousness, that Brentano’s rejection of unconscious mentality cannot be so easily excised from his overall view but that it is not such a grave mistake, and that Brentano’s notion of intentionality may not be that of phenomenal intentionality but rather that of generic abountness. I wrap up by considering the extent to which we ∗Forthcoming in a symposium on Uriah Kriegel’s Brentano’s Philosophical System: Mind, Being, Value in European Journal of Philosophy. Uriah Kriegel’s reply: https://philpapers. org/archive/KRIBOC.pdf.",
      "citationCount": 1,
      "doi": "10.1111/ejop.12685",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/83d0c791f1666ec754014487ec1dc0b90f383b2c",
      "venue": "European Journal of Philosophy",
      "journal": {
        "name": "European Journal of Philosophy"
      },
      "publicationTypes": null
    },
    {
      "paperId": "217c71532c8828d86bb00176aec7101459319b93",
      "title": "Tonic immobility and phenomenal consciousness in animals: a review",
      "authors": [
        {
          "name": "Michael L. Woodruff",
          "authorId": "2347991832"
        }
      ],
      "year": 2025,
      "abstract": "Tonic immobility (TI) is an innate, last-resort response to the presence of a predator, commonly referred to as feigning death or thanatosis. However, it is critical to distinguish death feigning from TI; the former encompasses a complex series of behaviors, with TI representing its final aspect. Given this complexity, death feigning is hypothesized to manifest a higher-order intentionality in animals. Considering that third-order and higher intentional states are correlated with some form of phenomenal consciousness, their presence in animals has significant implications for their conscious experiences. This hypothesis surrounding third-order and higher intentional states is subject to dispute, in part due to the lack of sufficient evidence indicating that the behaviors associated with death feigning, aside from TI, serve a protective function against predation. Evidence suggests that TI alone constitutes an effective mechanism for predator defense. It is posited that the cessation of TI by the prey organism signifies the presence of a first-order intentional state. Furthermore, it is proposed that behavioral indicators suggest that the termination of TI by the prey is linked to anoetic and potentially noetic consciousness. The relationship between TI and fear is also examined. It is contended that, within the framework of formulating hypotheses concerning the mechanisms of TI and developing experimental designs to test these hypotheses, fear should be characterized as an intervening variable. The conclusions derived from this analysis indicate that TI can occasionally function as an effective predator defense associated with primal sensory and anoetic consciousness. Its termination may imply the presence of noetic consciousness; however, self-reflective autonoetic consciousness appears to be absent. Finally, the hypothesis suggesting that TI serves as an evolutionary precursor to the theory of mind in humans is discussed, serving as a cautionary note in the interpretation of findings from animal research concerning the evolution of cognitive functions in humans.",
      "citationCount": 2,
      "doi": "10.3389/fpsyg.2025.1509999",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/217c71532c8828d86bb00176aec7101459319b93",
      "venue": "Frontiers in Psychology",
      "journal": {
        "name": "Frontiers in Psychology",
        "volume": "16"
      },
      "publicationTypes": [
        "Review",
        "JournalArticle"
      ]
    },
    {
      "paperId": "609c1e954dc24dc0842aab3ff629c6fc5394a595",
      "title": "Unfolding functional brain geometry across scales: self-intending projection framework for phenomenal consciousness",
      "authors": [
        {
          "name": "R. Poznanski",
          "authorId": "2771895"
        }
      ],
      "year": 2025,
      "abstract": "Consciousness arises from physical and geometric constraints, yet the nature of phenomenality remains unresolved. A conceptual and mechanistic framework links self-intending projection to phenomenal consciousness. Based on Dynamic Organicity Theory, this materialist framework posits that quantum effects underlie phenomenality. Moving beyond representational models, Embedded Quantum Physicalism (EQP) offers a multiscale, non-reductive approach in which consciousness is naturalized through effective processes embedded within the brain’s functional geometry. This geometry evolves through functional interactions that constrain internal states, while its curvature organizes agential holons and intrinsic information into self-referential loops, enabling intentional closure via self-intending projections. Reflexivity alone is insufficient; intrinsic intentionality emerges from these loops and provides the necessary condition for consciousness. Under EQP, phenomenality is not an ontological primitive but a physically instantiated phenomenon. Unlike reductive accounts that reduce consciousness to neural correlates or dismiss it as epiphenomenal, EQP traces phenomenality to thermo-quantum fluctuations in the brain’s biochemistry, which reshape functional geometry. This geometry supports effective processes, including projections, holonomies, and projective closure. Toroidal-like neuropil microcavities enter coherent quasipolaritonic modes through quantum-optical effects, involving delocalized information systems that transform intrinsic information. Phenomenality arises when stable agential holons form self-intending projections with projective closure, embodied in a Weyl-like, non-Euclidean functional geometry shaped by effective quantum potentials acting as lensing mechanisms at small scales in the neuropil.",
      "citationCount": 0,
      "doi": "10.56280/1714720458",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/609c1e954dc24dc0842aab3ff629c6fc5394a595",
      "venue": "Journal of Multiscale Neuroscience",
      "journal": {
        "name": "Journal of Multiscale Neuroscience"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "088b815271cb6181819a34173231cbb3ffce33f1",
      "title": "Phenomenal intentionality, inner awareness, and the given",
      "authors": [
        {
          "name": "D. Smith",
          "authorId": "48898715"
        }
      ],
      "year": 2021,
      "abstract": null,
      "citationCount": 1,
      "doi": "10.1007/s11229-021-03236-y",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/088b815271cb6181819a34173231cbb3ffce33f1",
      "venue": "Synthese",
      "journal": {
        "name": "Synthese",
        "pages": "10059 - 10076",
        "volume": "199"
      },
      "publicationTypes": null
    },
    {
      "paperId": "ad3476eb261a23f27c1ad0cebdf052ad1aeda847",
      "title": "The extended mind argument against phenomenal intentionality",
      "authors": [
        {
          "name": "C. Turner",
          "authorId": "144797441"
        }
      ],
      "year": 2021,
      "abstract": "This paper offers a novel argument against the phenomenal intentionality thesis (or PIT for short). The argument, which I'll call the extended mind argument against phenomenal intentionality, is centered around two claims: the first asserts that some source intentional states extend into the environment, while the second maintains that no conscious states extend into the environment. If these two claims are correct, then PIT is false, for PIT implies that the extension of source intentionality is predicated upon the extension of phenomenal consciousness. The argument is important because it undermines an increasingly prominent account of the nature of intentionality. PIT has entered the philosophical mainstream and is now a serious contender to naturalistic views of intentionality like the tracking theory and the functional role theory (Loar 1987, 2003; Searle 1990; Strawson 1994; Horgan and Tienson 2002; Pitt 2004; Farkas 2008; Kriegel 2013; Montague 2016; Bordini 2017; Forrest 2017; Mendelovici 2018). The extended mind argument against PIT challenges the popular sentiment that consciousness grounds intentionality.",
      "citationCount": 0,
      "doi": "10.1007/s11097-021-09765-8",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/ad3476eb261a23f27c1ad0cebdf052ad1aeda847",
      "venue": "Phenomenology and the Cognitive Sciences",
      "journal": {
        "name": "Phenomenology and the Cognitive Sciences",
        "pages": "747 - 774",
        "volume": "21"
      },
      "publicationTypes": null
    },
    {
      "paperId": "d3b58b8888a6eafc55f331068810a6b602a1e19d",
      "title": "Phenomenal Intentionality : How intentionality arises from phenomenal consciousness",
      "authors": [
        {
          "name": "Angela Mendelovici",
          "authorId": "2592261"
        }
      ],
      "year": 2016,
      "abstract": null,
      "citationCount": 0,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/d3b58b8888a6eafc55f331068810a6b602a1e19d",
      "venue": "",
      "journal": null,
      "publicationTypes": null
    },
    {
      "paperId": "5b3222bbc1a68310842146a1f3ab2f691e887e60",
      "title": "On Computational Mechanisms for Shared Intentionality, and Speculation on Rationality and Consciousness",
      "authors": [
        {
          "name": "J. Rushby",
          "authorId": "6235605"
        }
      ],
      "year": 2023,
      "abstract": "A singular attribute of humankind is our ability to undertake novel, cooperative behavior, or teamwork. This requires that we can communicate goals, plans, and ideas between the brains of individuals to create shared intentionality. Using the information processing model of David Marr, I derive necessary characteristics of basic mechanisms to enable shared intentionality between prelinguistic computational agents and indicate how these could be implemented in present-day AI-based robots. More speculatively, I suggest the mechanisms derived by this thought experiment apply to humans and extend to provide explanations for human rationality and aspects of intentional and phenomenal consciousness that accord with observation. This yields what I call the Shared Intentionality First Theory (SIFT) for rationality and consciousness. The significance of shared intentionality has been recognized and advocated previously, but typically from a sociological or behavioral point of view. SIFT complements prior work by applying a computer science perspective to the underlying mechanisms.",
      "citationCount": 0,
      "doi": "10.48550/arXiv.2306.13657",
      "arxivId": "2306.13657",
      "url": "https://www.semanticscholar.org/paper/5b3222bbc1a68310842146a1f3ab2f691e887e60",
      "venue": "arXiv.org",
      "journal": {
        "name": "ArXiv",
        "volume": "abs/2306.13657"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "4a7a8584766d1fabd799596169b02f8bdc727215",
      "title": "Descartes on Intentionality, Conscientia, and Phenomenal Consciousness",
      "authors": [
        {
          "name": "C. Barth",
          "authorId": "146331208"
        }
      ],
      "year": 2016,
      "abstract": null,
      "citationCount": 0,
      "doi": "10.24894/stph-en.2016.75003",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/4a7a8584766d1fabd799596169b02f8bdc727215",
      "venue": "",
      "journal": {
        "name": "",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "6eb5ed5a6f4a936e17fb4201ec5c390630b40bac",
      "title": "The Phenomenal Intentionality Theory",
      "authors": [
        {
          "name": "Angela Mendelovici",
          "authorId": "2592261"
        }
      ],
      "year": 2018,
      "abstract": "This chapter introduces the phenomenal intentionality theory (PIT), on which all original intentionality arises from phenomenal consciousness. It argues that PIT succeeds precisely where its main competitors, the tracking and functional role theories discussed in previous chapters, fail. The version of PIT that this chapter and the remainder of the book defends is strong identity PIT, on which all intentionality arises from phenomenal consciousness (strong PIT), and (roughly) phenomenal states give rise to intentional states simply by being identical to them (identity PIT). In short, according to strong identity PIT, every intentional state is identical to a phenomenal state. This chapter closes by previewing how later chapters handle certain challenging cases for PIT, including those of thoughts, states with broad or object-involving contents, standing states, and nonconscious occurrent states. The recommended treatment rejects derived intentionality and so qualifies as a version of strong PIT.",
      "citationCount": 15,
      "doi": "10.1093/OSO/9780190863807.003.0005",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/6eb5ed5a6f4a936e17fb4201ec5c390630b40bac",
      "venue": "Oxford Scholarship Online",
      "journal": {
        "name": "Oxford Scholarship Online"
      },
      "publicationTypes": [
        "Review"
      ]
    },
    {
      "paperId": "c0a495dfb10005cab445888ab4837512e34b6e42",
      "title": "Phenomenal Intentionality and a Voluntaristic Theory of Truth and Reference",
      "authors": [
        {
          "name": "Angela Mendelovici",
          "authorId": "2592261"
        }
      ],
      "year": 2019,
      "abstract": null,
      "citationCount": 1,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/c0a495dfb10005cab445888ab4837512e34b6e42",
      "venue": "",
      "journal": null,
      "publicationTypes": null
    },
    {
      "paperId": "8f948099d91f3eca28bdb01e9b2d7633a4f3e9da",
      "title": "What is it like to think about oneself? De Se thought and phenomenal intentionality",
      "authors": [
        {
          "name": "Kyle Banick",
          "authorId": "52192090"
        }
      ],
      "year": 2018,
      "abstract": null,
      "citationCount": 5,
      "doi": "10.1007/S11097-018-9607-6",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/8f948099d91f3eca28bdb01e9b2d7633a4f3e9da",
      "venue": "Phenomenology and the Cognitive Sciences",
      "journal": {
        "name": "Phenomenology and the Cognitive Sciences",
        "pages": "1-14",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "16eb26c36c7178b9669a9aba0775817fdba10170",
      "title": "How to be an adverbialist about phenomenal intentionality",
      "authors": [
        {
          "name": "Kyle Banick",
          "authorId": "52192090"
        }
      ],
      "year": 2018,
      "abstract": null,
      "citationCount": 11,
      "doi": "10.1007/s11229-018-02053-0",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/16eb26c36c7178b9669a9aba0775817fdba10170",
      "venue": "Synthese",
      "journal": {
        "name": "Synthese",
        "pages": "661 - 686",
        "volume": "198"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "439270c0bf1de954a9448700b110c16d3d9f7f00",
      "title": "The epistemic import of phenomenal consciousness",
      "authors": [
        {
          "name": "P. Zięba",
          "authorId": "46188638"
        }
      ],
      "year": 2022,
      "abstract": "This paper controverts the ability of intentionalism about perception to account for unique epistemic signi ﬁ cance of phenomenal consciousness. More speci ﬁ cally, the intentionalist cannot explain the latter without denying two well-founded claims: the transparency of experience, and the possibility of unconscious perception. If they are true, intentionality of perception entails that phenomenal consciousness has no special epistemic role to play. Although some intentionalists are ready to bite this bullet, by doing so they e ﬀ ectively undermine one of the standard motivations of their view, i.e. the claim that perceptual experiences justify beliefs. Consequently, whatever reason might there be to think that phenomenal consciousness has unique epistemic import, it is also a reason to reject intentionalism. I recommend replacing the latter with an unorthodox formulation of relationalism about perception.",
      "citationCount": 1,
      "doi": "10.1080/0020174x.2022.2144441",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/439270c0bf1de954a9448700b110c16d3d9f7f00",
      "venue": "Inquiry",
      "journal": {
        "name": "Inquiry"
      },
      "publicationTypes": null
    },
    {
      "paperId": "c265c94e4c35215573060b1d46b0dc2f77d07a17",
      "title": "What is it like to think about oneself? De Se thought and phenomenal intentionality",
      "authors": [
        {
          "name": "Kyle Banick",
          "authorId": "52192090"
        }
      ],
      "year": 2018,
      "abstract": null,
      "citationCount": 0,
      "doi": "10.1007/s11097-018-9607-6",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/c265c94e4c35215573060b1d46b0dc2f77d07a17",
      "venue": "Phenomenology and the Cognitive Sciences",
      "journal": {
        "name": "Phenomenology and the Cognitive Sciences",
        "pages": "919 - 932",
        "volume": "18"
      },
      "publicationTypes": null
    },
    {
      "paperId": "141e14beb97fe46c8a815a5ddd909ec4b7371882",
      "title": "The Phenomenal Basis of Intentionality by Angela Mendelovici, Oxford: Oxford University Press, 2018, ISBN 9780190863807, 275 Pages",
      "authors": [
        {
          "name": "C. Stratman",
          "authorId": "133799708"
        }
      ],
      "year": 2021,
      "abstract": null,
      "citationCount": 0,
      "doi": "10.1007/s11406-020-00320-4",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/141e14beb97fe46c8a815a5ddd909ec4b7371882",
      "venue": "Philosophia",
      "journal": {
        "name": "Philosophia",
        "pages": "1805 - 1816",
        "volume": "49"
      },
      "publicationTypes": [
        "Review"
      ]
    },
    {
      "paperId": "a0f3268a06435a1ebf8530a64bf1e9c6c8762e6f",
      "title": "Subjective Character as the Origo a Quo of Phenomenal Consciousness",
      "authors": [
        {
          "name": "Kyle Banick",
          "authorId": "52192090"
        }
      ],
      "year": 2021,
      "abstract": "\nThis article contributes to the debate on self-consciousness, inner awareness, and subjective character. Philosophers puzzle over whether subjective character has a monadic or a relational form. But the present article deploys formal ontology to show that this is a false dichotomy. From this vantage, a common objection to non-relational views is deflated. The common objection is that one-level, non-relational views are either unexplanatory or smuggle in resources from higher-order and/or relational views. The author uses an argument from formal ontology to suggest that such objections stem from a category error. The result is that first-order non-relational views need not lapse into higher order or relational views – subjective character can be a structured and intrinsic feature involved in the ontological constitution of mental acts. Ultimately, the author emphasizes the need to conceive of subjective character as the source of intentionality, and not the result of a prior intentional relation.",
      "citationCount": 0,
      "doi": "10.1163/18756735-00000133",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/a0f3268a06435a1ebf8530a64bf1e9c6c8762e6f",
      "venue": "Grazer Philosophische Studien",
      "journal": {
        "name": "Grazer Philosophische Studien"
      },
      "publicationTypes": null
    },
    {
      "paperId": "f130dd316698101ff931c396cf77e77ac6dc526b",
      "title": "The Phenomenal Basis of Intentionality",
      "authors": [
        {
          "name": "Angela Mendelovici",
          "authorId": "2592261"
        }
      ],
      "year": 2018,
      "abstract": "Some mental states seem to be \"of\" or \"about\" things or to \"say\" something. For example, a thought might represent that grass is green, and a visual experience might represent a blue cup. This is intentionality. The aim of this book is to explain this phenomenon. Once we understand intentionality as a phenomenon to be explained, rather than a posit in a theory explaining something else, we can see that there are glaring empirical and in-principle difficulties with currently popular tracking and functional role theories of intentionality, which aim to account for intentionality in terms of tracking relations and functional roles. This book develops an alternative theory, the phenomenal intentionality theory (PIT), on which the source of intentionality is none other than phenomenal consciousness, the subjective, felt, or qualitative aspect of mental life. While PIT avoids the problems that plague tracking and functional role theories, it faces its own challenges in accounting for the rich and complex contents of thoughts and the contents of nonconscious states. In responding to these challenges, this book proposes a novel version of PIT, one on which all intentionality is phenomenal intentionality, though we in some sense represent many non-phenomenal contents by ascribing them to ourselves. This book further argues that phenomenal consciousness is an intrinsic feature of mental life, resulting in a view that is radically internalistic in spirit: Our phenomenally represented contents are literally in our heads, and any non-phenomenal contents we in some sense represent are expressly targeted by us.",
      "citationCount": 123,
      "doi": "10.1093/OSO/9780190863807.001.0001",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/f130dd316698101ff931c396cf77e77ac6dc526b",
      "venue": "Oxford Scholarship Online",
      "journal": {
        "name": "Oxford Scholarship Online"
      },
      "publicationTypes": null
    },
    {
      "paperId": "419c5d5eca726dc17fc706d04aa8d32802d6d6e9",
      "title": "Consciousness and Intentionality",
      "authors": [
        {
          "name": "Angela Mendelovici",
          "authorId": "2592261"
        },
        {
          "name": "D. Bourget",
          "authorId": "3133904"
        }
      ],
      "year": 2020,
      "abstract": "Philosophers traditionally recognize two key features of mental states: intentionality and phenomenal consciousness. To a first approximation, intentionality is the ‘aboutness’ of mental states, and phenomenal consciousness is the felt, experiential, qualitative, or ‘what it’s like’ aspect of mental states. In the past few decades, these features have been widely assumed to be distinct and independent. But several philosophers have recently challenged this assumption, arguing that intentionality and consciousness are importantly related. This chapter overviews the key views on the relationship between consciousness and intentionality and describes our favored view, which is a version of the phenomenal intentionality theory, the view that the most fundamental kind of intentionality arises from phenomenal consciousness.",
      "citationCount": 1,
      "doi": "10.1093/oxfordhb/9780198749677.013.26",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/419c5d5eca726dc17fc706d04aa8d32802d6d6e9",
      "venue": "The Oxford Handbook of the Philosophy of Consciousness",
      "journal": {
        "name": "The Oxford Handbook of the Philosophy of Consciousness"
      },
      "publicationTypes": [
        "Review"
      ]
    },
    {
      "paperId": "350ecc1263397c0a8339e011154301346e8871e1",
      "title": "Consciousness and Intentionality",
      "authors": [
        {
          "name": "D. Pitt",
          "authorId": "2060950435"
        }
      ],
      "year": 2018,
      "abstract": null,
      "citationCount": 68,
      "doi": "10.4324/9781315676982-20",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/350ecc1263397c0a8339e011154301346e8871e1",
      "venue": "",
      "journal": {
        "name": "",
        "pages": "260-270",
        "volume": ""
      },
      "publicationTypes": [
        "Review"
      ]
    },
    {
      "paperId": "9b4be017e54fe4b436cd4145115a57f6a06be628",
      "title": "The Phenomenal Intentionality Research Program",
      "authors": [
        {
          "name": "Uriah Kriegel",
          "authorId": "2986054"
        }
      ],
      "year": 2013,
      "abstract": null,
      "citationCount": 99,
      "doi": "10.1093/acprof:oso/9780199764297.003.0001",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/9b4be017e54fe4b436cd4145115a57f6a06be628",
      "venue": "",
      "journal": {
        "name": "",
        "volume": ""
      },
      "publicationTypes": [
        "Review"
      ]
    },
    {
      "paperId": "b84359883193f8e525f4ff3c0a269fbe6e8e9b12",
      "title": "Phenomenal consciousness, collective mentality, and collective moral responsibility",
      "authors": [
        {
          "name": "Matthew Baddorf",
          "authorId": "134357147"
        }
      ],
      "year": 2017,
      "abstract": null,
      "citationCount": 34,
      "doi": "10.1007/S11098-016-0809-X",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/b84359883193f8e525f4ff3c0a269fbe6e8e9b12",
      "venue": "",
      "journal": {
        "name": "Philosophical Studies",
        "pages": "2769-2786",
        "volume": "174"
      },
      "publicationTypes": null
    },
    {
      "paperId": "ce9fd7f75b3f76d14fe7890e286d7f25730dcd3f",
      "title": "Reflexivity, Intentionality, and the Embodied Subject: A Phenomenological Reflection in Honor of J. N. Mohanty",
      "authors": [
        {
          "name": "Matthew MacKenzie",
          "authorId": "2388058520"
        }
      ],
      "year": 2025,
      "abstract": null,
      "citationCount": 0,
      "doi": "10.1353/pew.2025.a965458",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/ce9fd7f75b3f76d14fe7890e286d7f25730dcd3f",
      "venue": "",
      "journal": {
        "name": "Philosophy East and West",
        "pages": "487 - 509",
        "volume": "75"
      },
      "publicationTypes": null
    },
    {
      "paperId": "ba03f16ca89ea705b5eedb6493b15c7c3e022edb",
      "title": "Phenomenal consciousness, collective mentality, and collective moral responsibility",
      "authors": [
        {
          "name": "Matthew Baddorf",
          "authorId": "134357147"
        }
      ],
      "year": 2016,
      "abstract": null,
      "citationCount": 0,
      "doi": "10.1007/s11098-016-0809-x",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/ba03f16ca89ea705b5eedb6493b15c7c3e022edb",
      "venue": "Philosophical Studies",
      "journal": {
        "name": "Philosophical Studies",
        "pages": "2769 - 2786",
        "volume": "174"
      },
      "publicationTypes": null
    }
  ],
  "count": 25,
  "errors": []
}
