{
  "status": "success",
  "source": "semantic_scholar",
  "query": "theories of meaning semantics",
  "results": [
    {
      "paperId": "916163b1a38fbafe254c52f813f109e3145857df",
      "title": "LANGUAGE AND COGNITION: EXAMINING THE ROLE OF APOHA IN BUDDHIST THEORIES OF MEANING AND SEMANTICS",
      "authors": [
        {
          "name": "Babuli Naik",
          "authorId": "2367081621"
        }
      ],
      "year": 2024,
      "abstract": "The Buddhist theory of Apoha (exclusion) offers a distinct and non-essentialist approach to meaning and cognition by rejecting intrinsic universals and elucidating linguistic categorization through negation. Rooted in the epistemological and logical traditions of Indian Buddhism, Apoha was systematically formulated by Dignāga and Dharmakīrti as a counterargument to realist theories of meaning, which assert the existence of inherent essences corresponding to linguistic categories. Instead of postulating a positive universal, Apoha posits that words acquire meaning by excluding what they do not denote. For instance, the term \"cow\" does not signify an inherent cow-ness but instead differentiates cows from non-cows. This exclusion-based model of meaning challenges ontological realism and presents an alternative perspective in which meaning is derived through negation rather than intrinsic identity.This paper examines Apoha in relation to contemporary cognitive science, particularly in the contexts of category formation, prototype theory, and conceptual blending. Empirical research in cognitive science indicates that human categorization operates through flexible, context-sensitive processes rather than rigid universals, thereby aligning with the Buddhist view that meaning is constructed rather than inherent. Engaging with contemporary debates in the philosophy of language and cognitive semantics, this study positions Apoha in dialogue with alternative theoretical frameworks, including Aristotelian essentialism, Fregean reference theory, and Wittgensteinian perspectives on language. Through this comparative analysis, the paper explores how Apoha challenges foundational assumptions concerning meaning, reference, and conceptual representation.Furthermore, this study critically engages with objections to Apoha, particularly those advanced by the Nyāya School, which argues that exclusion alone is insufficient for a comprehensive account of linguistic meaning. Nyāya philosophers contend that Apoha leads to an infinite regress or circular reasoning, as negation presupposes some form of positive content. By reassessing these critiques within the framework of cognitive science, this paper demonstrates how Apoha can be reinterpreted as a viable model for understanding the construction and communication of meaning, particularly in light of contemporary non-essentialist approaches to language. By integrating Buddhist epistemology with modern linguistic and cognitive theories, this study highlights the enduring significance of Apoha in contemporary discussions on language and cognition. The exclusion-based model of meaning proposed by Apoha aligns with non-essentialist and usage-based linguistic frameworks, offering valuable insights into how meaning is generated through contrast, differentiation, and contextual dependence. In doing so, this research underscores Apoha not only as a pivotal contribution to Indian philosophy but also as a theoretically robust and philosophically compelling framework for modern cognitive and linguistic inquiry.",
      "citationCount": 0,
      "doi": "10.29121/shodhkosh.v5.i1.2024.5446",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/916163b1a38fbafe254c52f813f109e3145857df",
      "venue": "ShodhKosh Journal of Visual and Performing Arts",
      "journal": {
        "name": "ShodhKosh: Journal of Visual and Performing Arts"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "aa542e23badc75156f688df5fc17d1b00587f91d",
      "title": "Split Semantics: Provocations Concerning Theories of Meaning and Philosophy in General",
      "authors": [
        {
          "name": "Rainer Born",
          "authorId": "2069143839"
        }
      ],
      "year": 2018,
      "abstract": null,
      "citationCount": 0,
      "doi": "10.4324/9781351141529-8",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/aa542e23badc75156f688df5fc17d1b00587f91d",
      "venue": "",
      "journal": {
        "name": "",
        "pages": "190-213",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "6592a66529abbe314735318e8cb9b08a2b599eac",
      "title": "Semantics: historical and some contemporary theories of meaning",
      "authors": [
        {
          "name": "Rajiba Lochan Behera",
          "authorId": null
        }
      ],
      "year": 2015,
      "abstract": null,
      "citationCount": 0,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/6592a66529abbe314735318e8cb9b08a2b599eac",
      "venue": "",
      "journal": {
        "name": "",
        "pages": "46-50",
        "volume": "5"
      },
      "publicationTypes": null
    },
    {
      "paperId": "9c591c41f375e042c645213a0e23f4c06e6a464b",
      "title": "Register Here for Full Access to Semantics Theories Of Meaning In",
      "authors": [
        {
          "name": "Franziska Abend",
          "authorId": "52422882"
        }
      ],
      "year": 2016,
      "abstract": null,
      "citationCount": 0,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/9c591c41f375e042c645213a0e23f4c06e6a464b",
      "venue": "",
      "journal": {
        "name": "",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "f677d51a33d8cb944462b6bfd5c5045bda907172",
      "title": "Model‐Based Semantics: Doing Without Meaning Constitution",
      "authors": [
        {
          "name": "Pietro Salis",
          "authorId": "2385864786"
        }
      ],
      "year": 2025,
      "abstract": "This paper introduces a model‐based account of meaning, arguing that meaning properties reside in models rather than in the external world. Building on this view, it explores how such an instrumentalist framework can engage critically with various concerns raised by Wittgenstein, Quine, and Kripke[nstein]—each of whom voiced scepticism toward certain conceptions of semantic theorising and, in some cases, the reification of meaning. While the scope and nature of their respective criticisms may differ, the paper suggests they share a broadly deflationary attitude toward semantic metaphysics. Twentieth‐century challenges to mainstream truth‐conditional semantics, from verificationism, inferentialism, and other alternatives, have further complicated the semantic landscape, prompting a reconsideration of metaphysical assumptions in theories of meaning. In light of both scepticism about meaning and explanatory disagreement in semantics, the paper questions the metaphysical interpretation of theories of meaning and proposes a reoriented understanding of semantic theorising—one that is formally tractable yet philosophically restrained.",
      "citationCount": 0,
      "doi": "10.1111/meta.70018",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/f677d51a33d8cb944462b6bfd5c5045bda907172",
      "venue": "Metaphilosophy",
      "journal": {
        "name": "Metaphilosophy"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "30db64e1f13df0c4d580e71bf651c7af97c6f99d",
      "title": "Theories of Meaning for the Internet of Things",
      "authors": [
        {
          "name": "Michael Färber",
          "authorId": "2051252769"
        },
        {
          "name": "Y. Svetashova",
          "authorId": "26936066"
        },
        {
          "name": "A. Harth",
          "authorId": "1775662"
        }
      ],
      "year": 2021,
      "abstract": "In this chapter, we consider the theoretical foundations for representing knowledge in the Internet of Things context. Specifically, we consider (1) the model-theoretic semantics (i.e., extensional semantics), (2) the possible-world semantics (i.e., intensional semantics), (3) the situation semantics, and (4) the cognitive/distributional semantics. Given the peculiarities of the Internet of Things, we pay particular attention to (a) perception (i.e., how to establish a connection to the world), (b) intersubjectivity (i.e., how to align world representations), and (c) the dynamics of world knowledge (i.e., how to model events). We come to the conclusion that each of the semantic theories helps in modeling specific aspects, but does not sufficiently address all three aspects simultaneously.",
      "citationCount": 4,
      "doi": "10.1007/978-3-030-69823-2_3",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/30db64e1f13df0c4d580e71bf651c7af97c6f99d",
      "venue": "Language, Cognition, and Mind",
      "journal": {
        "name": "Language, Cognition, and Mind"
      },
      "publicationTypes": null
    },
    {
      "paperId": "9dfbe58273b950b8a6fdc745c78cb5cb9e0a9418",
      "title": "Compositionality and Contextuality: The Symbolic and Statistical Theories of Meaning",
      "authors": [
        {
          "name": "Y. Maruyama",
          "authorId": "1797889"
        }
      ],
      "year": 2019,
      "abstract": null,
      "citationCount": 10,
      "doi": "10.1007/978-3-030-34974-5_14",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/9dfbe58273b950b8a6fdc745c78cb5cb9e0a9418",
      "venue": "Context",
      "journal": {
        "pages": "161-174"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "403bfbc00207654875b25269f8ff05520d6ab5bd",
      "title": "Semantic theories, linguistic essences, and knowledge of meaning",
      "authors": [
        {
          "name": "N. Haverkamp",
          "authorId": "2257192"
        },
        {
          "name": "M. Hoeltje",
          "authorId": "32421791"
        }
      ],
      "year": 2021,
      "abstract": "This paper argues, first, that the information problem poses a foundational challenge to mainstream semantics. It proposes, second, to address this problem by drawing on notions from Kit Fine’s essentialist framework. More specifically, it claims that the information problem can be avoided by strengthening standard truth theories, employing an operator expressing the notion of a relative constitutive semantic requirement. As a result, the paper proposes to construe semantic theories as theories of semantic requirements, and semantic knowledge as knowledge of such requirements.",
      "citationCount": 4,
      "doi": "10.1007/s11229-021-03429-5",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/403bfbc00207654875b25269f8ff05520d6ab5bd",
      "venue": "Synthese",
      "journal": {
        "name": "Synthese",
        "pages": "14459 - 14490",
        "volume": "199"
      },
      "publicationTypes": null
    },
    {
      "paperId": "cbdd8ac9452f5531e4c8bba6f6b76c1ce6eaf7fe",
      "title": "Types and the Structure of Meaning",
      "authors": [
        {
          "name": "S. Chatzikyriakidis",
          "authorId": "2136336"
        },
        {
          "name": "Robin Cooper",
          "authorId": "2360728163"
        },
        {
          "name": "E. Gregoromichelaki",
          "authorId": "2120282"
        },
        {
          "name": "Peter Sutton",
          "authorId": "2360649577"
        }
      ],
      "year": 2025,
      "abstract": "Addresses the role of structure in semantic analysis from the perspective of theories of meaning using rich theories of types. Also relates the theory of frames to these type theories as introducing, to some extent, similar structure into semantic analysis. The authors show how a structured approach is necessary to appropriately analyse phenomena in areas as diverse as lexical semantics and the semantics of attitudinal constructions referring to psychological states. In particular, these are: polysemy taken together with copredication, and attitudes such as belief and knowledge. The authors argue that the very same structure required to define a rich system of types enables them to adequately analyse both of these phenomena, thus revealing similarities in two otherwise apparently unrelated topics in semantics. They also argue that such theories facilitate a semantic theory oriented towards a psychological and contextually situated view of meaning. This title is also available as open access on Cambridge Core.",
      "citationCount": 1,
      "doi": "10.1017/9781009285322",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/cbdd8ac9452f5531e4c8bba6f6b76c1ce6eaf7fe",
      "venue": "",
      "journal": null,
      "publicationTypes": null
    },
    {
      "paperId": "28b791523125e60fb9e44e0ebddb7970081cf667",
      "title": "Semantics, Meaning, Truth and Content: Disentangling Linguistic and Philosophical Approaches to the Study of Meaning",
      "authors": [
        {
          "name": "Toby Napoletano",
          "authorId": "1888241"
        }
      ],
      "year": 2017,
      "abstract": null,
      "citationCount": 0,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/28b791523125e60fb9e44e0ebddb7970081cf667",
      "venue": "",
      "journal": {
        "name": "",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "78a735d06aee7bc0288cb3748ef1182960a74f89",
      "title": "On the Computation of Meaning, Language Models and Incomprehensible Horrors",
      "authors": [
        {
          "name": "Michael Timothy Bennett",
          "authorId": "2083547324"
        }
      ],
      "year": 2023,
      "abstract": "We integrate foundational theories of meaning with a mathematical formalism of artificial general intelligence (AGI) to offer a comprehensive mechanistic explanation of meaning, communication, and symbol emergence. This synthesis holds significance for both AGI and broader debates concerning the nature of language, as it unifies pragmatics, logical truth conditional semantics, Peircean semiotics, and a computable model of enactive cognition, addressing phenomena that have traditionally evaded mechanistic explanation. By examining the conditions under which a machine can generate meaningful utterances or comprehend human meaning, we establish that the current generation of language models do not possess the same understanding of meaning as humans nor intend any meaning that we might attribute to their responses. To address this, we propose simulating human feelings and optimising models to construct weak representations. Our findings shed light on the relationship between meaning and intelligence, and how we can build machines that comprehend and intend meaning.",
      "citationCount": 10,
      "doi": "10.1007/978-3-031-33469-6_4",
      "arxivId": "2304.12686",
      "url": "https://www.semanticscholar.org/paper/78a735d06aee7bc0288cb3748ef1182960a74f89",
      "venue": "Artificial General Intelligence",
      "journal": {
        "pages": "32-41"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "42c053bbabb8552342a210961794a921a1a41a6e",
      "title": "The Reality Of The Controversy Surrounding The Concept Of Meaning In Semantics",
      "authors": [
        {
          "name": "Isaac Mhute",
          "authorId": "70053484"
        }
      ],
      "year": 2016,
      "abstract": null,
      "citationCount": 0,
      "doi": "10.19044/ESJ.2016.V12N5P279",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/42c053bbabb8552342a210961794a921a1a41a6e",
      "venue": "",
      "journal": {
        "name": "European Scientific Journal, ESJ",
        "pages": "279",
        "volume": "12"
      },
      "publicationTypes": null
    },
    {
      "paperId": "118ba4759fb364097632bd74ffa5df974190b0b6",
      "title": "Two Versions of Meaning Failure: A Contributing Essay to the Explanation of the Split Between Analytical and Phenomenological Continental philosophy",
      "authors": [
        {
          "name": "L. Vollet",
          "authorId": "2307614852"
        }
      ],
      "year": 2023,
      "abstract": null,
      "citationCount": 0,
      "doi": "10.1007/s10743-023-09336-6",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/118ba4759fb364097632bd74ffa5df974190b0b6",
      "venue": "Husserl Studies",
      "journal": {
        "name": "Husserl Studies",
        "pages": "1 - 23",
        "volume": "40"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "c2ef7e66d57ec65dd08f66189eace6c9c03e5acb",
      "title": "Paraconsistency of Argumentation Semantics for Stepping Theories of Active Logic",
      "authors": [
        {
          "name": "I. Fominykh",
          "authorId": "2756821"
        },
        {
          "name": "Michael Vinkov",
          "authorId": "103352567"
        }
      ],
      "year": 2016,
      "abstract": null,
      "citationCount": 6,
      "doi": "10.1007/978-3-319-33609-1_15",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/c2ef7e66d57ec65dd08f66189eace6c9c03e5acb",
      "venue": "",
      "journal": {
        "name": "",
        "pages": "171-180",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "a73aacc1246f5481c40861e9c8e098d96c9bdfb6",
      "title": "Meaning and Meaning Making in Arabic: Moving from Semantics to Pragmatics to Ka:rmatics",
      "authors": [
        {
          "name": "M. Salim",
          "authorId": "2065948380"
        },
        {
          "name": "Chilukuri Bhuvaneswar",
          "authorId": "2042056750"
        }
      ],
      "year": 2020,
      "abstract": "Ka:rmik Linguistic theory is one of the most revolutionary theories in linguistics which aims to describe language from a causal perspective of WHY giving rise to WHAT through HOW: “As you are, so you think; as you think, so you speak (or act)” (Bhuvaneswar). In an adapted form, it can be modified as: As you are, so you think; as you think, so you mean. In his extension of semantics to ka:rmatics in dealing with proverb-meaning, Bhuvaneswar (2012) has shown a new dimension of meaning and meaning-making, namely, the causal dimension of creation, change, and transformation of meaning in language. According to Bhuvaneswar, if semantics deals with sentence meaning and pragmatics with utterance meaning, ka:rmatics (i.e., experiential pragmatics) explores experiential meaning via dispositional meaning of contextual meaning (pragmatics) of sentential meaning (semantics). What this amounts to is a causal understanding of meaning as it is created, changed, and transformed as languages are evolved and developed: Language is as it is (i.e., lingual meaning is as it is) because of what it is (dispositionally) intended to do (i.e., to mean) what it does (i.e., means). \nIn this paper, an attempt has been made by selecting two sentences used in real life Yemeni Arabic to show how meaning is derived. In the process, it will be shown how semantics becomes pragmatics and pragmatics becomes ka:rmatics.",
      "citationCount": 0,
      "doi": "10.24113/ijellh.v8i11.10833",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/a73aacc1246f5481c40861e9c8e098d96c9bdfb6",
      "venue": "SMART MOVES JOURNAL IJELLH",
      "journal": {
        "name": "SMART MOVES JOURNAL IJELLH"
      },
      "publicationTypes": null
    },
    {
      "paperId": "be64a28f78197b80de0647d541031646ce5cf446",
      "title": "Meaning, modulation, and context: a multidimensional semantics for truth-conditional pragmatics",
      "authors": [
        {
          "name": "Guillermo Del Pinal",
          "authorId": "2305503603"
        }
      ],
      "year": 2018,
      "abstract": null,
      "citationCount": 30,
      "doi": "10.1007/s10988-017-9221-z",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/be64a28f78197b80de0647d541031646ce5cf446",
      "venue": "Linguistics and Philosophy",
      "journal": {
        "name": "Linguistics and Philosophy",
        "pages": "165 - 207",
        "volume": "41"
      },
      "publicationTypes": null
    },
    {
      "paperId": "c4cb1a0a91302d89dcfddb6002513ba7901ec5e5",
      "title": "The semantics-pragmatic interface : propositional content and theories of processing",
      "authors": [],
      "year": 2015,
      "abstract": null,
      "citationCount": 0,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/c4cb1a0a91302d89dcfddb6002513ba7901ec5e5",
      "venue": "",
      "journal": null,
      "publicationTypes": null
    },
    {
      "paperId": "593e4d64b08e1393011bf62f10fb78c2b58649a9",
      "title": "Philosophy of Language in Digital Age: Rethinking Communication and Meaning",
      "authors": [
        {
          "name": "Ramanathan Srinivasan",
          "authorId": "2394657676"
        },
        {
          "name": "P. S. Aithal",
          "authorId": "2392113824"
        }
      ],
      "year": 2025,
      "abstract": "Purpose: The digital age has transformed the way humans use, interpret, and experience language. Traditional philosophical concerns—such as meaning, reference, truth, and communication—must now be re-examined in the context of new linguistic practices shaped by digital technologies. Social media platforms, artificial intelligence, emojis, memes, and algorithm-driven interactions have introduced novel forms of expression that challenge conventional theories of semantics and pragmatics. This paper explores the philosophical implications of digital communication, focusing on how meaning is constructed, negotiated, and altered in virtual spaces. It examines the interplay between brevity and nuance in online discourse, the impact of anonymity and identity fluidity on speech acts, and the ethical dimensions of language mediated by algorithms. \nResults/Analysis: The digital age has not only revolutionized the tools of communication but also redefined the very nature of linguistic interaction. Classical philosophy of language, grounded in speech and text, must now be reinterpreted in light of digital practices that are multimodal, fragmented, and technologically mediated. Meaning today is not limited to words alone; it is constructed through symbols, images, hashtags, and even silence within algorithmically curated platforms.\nMethodology: In this paper, the exploratory qualitative research method is used. The relevant information is collected using keyword-based search in Google search engine, Google Scholar search engine, and AI-driven GPTs. This information is analysed and interpreted as per the objectives of the paper.\nOriginality/Values: The study engages with contemporary questions of authenticity, misinformation, and linguistic creativity in digital environments. By bridging classical philosophy of language with the realities of digital communication, the paper argues for an expanded framework that accounts for multimodal, networked, and technologically mediated forms of meaning-making. Ultimately, rethinking language in the digital age offers not only a deeper understanding of communication but also an opportunity to develop more ethical and inclusive linguistic practices in a rapidly evolving world.",
      "citationCount": 5,
      "doi": "10.64818/pijpl.3107.4634.0015",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/593e4d64b08e1393011bf62f10fb78c2b58649a9",
      "venue": "Poornaprajna International Journal of Philosophy &amp; Languages (PIJPL)",
      "journal": {
        "name": "Poornaprajna International Journal of Philosophy &amp; Languages (PIJPL)"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "b45460085607f3a1a48b9d22ea54cb3c81a231d1",
      "title": "Care-theoretic semantics",
      "authors": [
        {
          "name": "T. Ferguson",
          "authorId": "2262059527"
        },
        {
          "name": "Jitka Kadlečiková",
          "authorId": "73633431"
        }
      ],
      "year": 2024,
      "abstract": "\n This paper argues for two claims, one conservative and the other one less so. First is the thesis that the range of linguistic features that can be considered authentically semantic is far wider in breadth than is typically acknowledged. In particular, linguistic phenomena that are entirely orthogonal to veridical considerations—including ethical matters—are sufficiently robust to support e.g. theories of meaning and inference. Second, we aim to argue that philosophy’s prioritization of truth obscures the existence of an important prior concern for care or the reduction of harm. Specifically, we offer a topic-theoretic interpretation of the bounds consequence reading of sequents put forward by Restall and Ripley. We argue that this reading allows us to provide a rigorous semantics using the newly introduced categories of care and harm. An important objection may be that philosophy requires the centrality and priority of truth above all else insofar as truth-like features are necessary to ground theories of meaning or reasoning. Anticipating such an objection, we will argue that care not only is an authentically semantic feature but also that care is sufficient to ground such theories.",
      "citationCount": 2,
      "doi": "10.1093/logcom/exae070",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/b45460085607f3a1a48b9d22ea54cb3c81a231d1",
      "venue": "Journal of Logic and Computation",
      "journal": {
        "name": "J. Log. Comput.",
        "volume": "35"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "64785394c5073eefb557e6ae2392c2ef0166c30e",
      "title": "The Geometrization of Meaning",
      "authors": [
        {
          "name": "M. Heller",
          "authorId": "145055720"
        }
      ],
      "year": 2021,
      "abstract": "One of the greatest problems in philosophy is that of meaning. The turning point in thinking on meaning was Tarski’s definition of truth, and the rapid development of logical semantics and model theory was a consequence of this achievement. Prhaps less well-known among classical logicians and philosophers is that it is category theory that provides the requisite mathematical tools to study the relationship between the syntax of formalized theories and their semantics. The aim of this article is to change this situation and make a preliminary philosophical analysis of the results obtained so far. They concern formalized algebraic theories with axioms in the form of equational laws, theories based on propositional logic and coherent Boolean logic, as well as decidable logic which is not necessarily Boolean. The syntactic-semantics relation for these theories takes the form of dualisms between the respective syntactic and semantic categories. These dualisms are given by the appropriate adjoint functors. In all the considered cases, the syntax–semantics dualism corresponds to the algebra-geometry dualism. We analyze the philosophical significance of these results. They allow us to look at the problem of meaning in a new light and formulate a criterion distinguishing formal theories from empirical theories. The disputes that were once fought over Tarski’s definition of truth are transferred to a new context. The polemics as to whether Tarski actually succeeded in reducing the problem of meaning to purely syntactic terms has been superseded:",
      "citationCount": 0,
      "doi": null,
      "arxivId": "2104.13288",
      "url": "https://www.semanticscholar.org/paper/64785394c5073eefb557e6ae2392c2ef0166c30e",
      "venue": "",
      "journal": null,
      "publicationTypes": null
    },
    {
      "paperId": "4fe96015f8437cc80ca2d6b94b5505f743536fd0",
      "title": "Meaning and Reference in Programming Languages",
      "authors": [
        {
          "name": "Nicola Angius",
          "authorId": "3144287"
        }
      ],
      "year": 2025,
      "abstract": "This paper provides an analysis of the meaning–reference problem, as traditionally advanced in the philosophy of language, for imperative programming languages. Addressing the problem is relevant for the philosophy of computer science in the context of the debate of whether simulative programs can be considered representational theories of their simulated systems. This paper challenges the thesis that, since programming languages have semantics, they also have reference, presumably to the external world. First, denotational, operational, game theoretic, and axiomatic semantics are epistemologically analysed to provide a theory of meaning for high-level language programs. It is argued that programming language semantics can be seen, to some extent, under the light of Fregean descriptivism, thereby rejecting the view that it is reference that determines meaning. Secondly, descriptivist, causal, character, and intentionalist theories of reference are examined to argue that meaning is not sufficient for programming languages to determine reference, thereby rejecting the view that meaning determines reference. It is argued that it is the intentions of agents that allow programming language semantics to identify referents. The paper concludes that if the semantics of programming languages may determine their reference, the latter is not to the external world but to the internal operations of the implementation executing them. This does not prevent simulative programs from representing empirical systems, but they do so not on the basis of programming language semantics.",
      "citationCount": 0,
      "doi": "10.3390/philosophies10020040",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/4fe96015f8437cc80ca2d6b94b5505f743536fd0",
      "venue": "Philosophies",
      "journal": {
        "name": "Philosophies"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "115487b6f97819089b395598b6418efd099990dd",
      "title": "An Indian Debate on Semantic Internalism and Externalism: Śāntarakṣita’s Tattvasaṃgraha on the Meaning of Words",
      "authors": [
        {
          "name": "L. Sin",
          "authorId": "120630895"
        }
      ],
      "year": 2024,
      "abstract": "The semantic internalist–externalist debate is one of the central themes in contemporary philosophy. The present paper aims to explore the dispute between Śāntarakṣita and his opponents over the meaning of words (śabdārtha) in the śabdārthaparīkṣā chapter from the perspective of the internalist–externalist debate in semantics. The present paper consists of three main parts. In the first part, I will elucidate the internalist character of Śāntarakṣita’s apoha theory and the externalist characters of his opponents’ theories. The second part will be an examination of an Indian Externalist Argument against Śāntarakṣita’s apoha presented in the chapter. In the third part, I will explore how Śāntarakṣita attempts to refute this argument by resorting to the Dharmakīrtian notion of adhyavasāya (false ascertainment). Additionally, to emphasize a contemporary approach, I will offer and highlight the intercultural interpretations of these Indian externalist and internalist arguments.",
      "citationCount": 2,
      "doi": "10.3390/rel15121548",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/115487b6f97819089b395598b6418efd099990dd",
      "venue": "Religions",
      "journal": {
        "name": "Religions"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "b70814fa4c5117bd7ccad7823ce5294eec66c253",
      "title": "Representation, Meaning, and C-Synonymy",
      "authors": [
        {
          "name": "Matthew Simpson",
          "authorId": "2348863235"
        }
      ],
      "year": 2024,
      "abstract": "This paper gives a brief critical discussion of some elements of the pragmatist view of language defended by José Zalabardo in his book Pragmatist Semantics [Zalabardo (2023)]. I argue that Zalabardo’s pragmatist theory is not clearly stronger than the other pragmatist theories already defended in the literature; partly this is because those other theories may be able to explain the same phenomena as Zalabardo’s view, and partly it is because Zalabardo’s view does not obviously explain those phenomena as well as we might hope.",
      "citationCount": 0,
      "doi": "10.30827/trif.32780",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/b70814fa4c5117bd7ccad7823ce5294eec66c253",
      "venue": "Teorema. Revista Internacional de Filosofía",
      "journal": {
        "name": "Teorema. Revista Internacional de Filosofía"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "d7f6174980bb444d40581f0071d8e48d512ac2ec",
      "title": "Semantics, Pragmatics, Philosophy",
      "authors": [
        {
          "name": "K. Jaszczolt",
          "authorId": "118369893"
        }
      ],
      "year": 2023,
      "abstract": "Semantics and pragmatics – the study of meaning, and meaning in context, respectively – are two fundamental areas of linguistics, and as such are crucial to our understanding of how meaning is created. However, their theoretical ideas are often introduced without making clear connections between views, theories, and problems. This pioneering volume is both a textbook and a research guide, taking the reader on a journey through language and ultimately enabling them to think about meaning as linguists and philosophers would. Assuming no prior knowledge of linguistics, it introduces semantics, pragmatics, and the philosophy of language, showing how all three fields can address the 'big questions' that run through the study of meaning. It covers key theories and approaches, while also enabling increasingly more sophisticated questions about the interconnected aspects of meaning, with the end goal of preparing the reader to make their own, original contributions to ideas about meaning.",
      "citationCount": 11,
      "doi": "10.1017/9781108589338",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/d7f6174980bb444d40581f0071d8e48d512ac2ec",
      "venue": "",
      "journal": null,
      "publicationTypes": null
    },
    {
      "paperId": "6c814248bc324d4090088aefa3d85b42a086b4bc",
      "title": "Editorial e Political Turn in Foundational eories of Meaning",
      "authors": [
        {
          "name": "A. Davies",
          "authorId": "2150910997"
        }
      ],
      "year": 2019,
      "abstract": null,
      "citationCount": 0,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/6c814248bc324d4090088aefa3d85b42a086b4bc",
      "venue": "",
      "journal": null,
      "publicationTypes": null
    },
    {
      "paperId": "364136636d66205f17c44cd5eb97b166edc2a463",
      "title": "Introduction to the Science of Meaning",
      "authors": [
        {
          "name": "Derek Ball",
          "authorId": "144740816"
        },
        {
          "name": "B Rabern",
          "authorId": "3004611"
        }
      ],
      "year": 2018,
      "abstract": "This Introduction aims to acquaint the reader with some of the main views on the foundations of natural language semantics, to discuss the type of phenomena semanticists study, and to give some basic technical background in compositional model-theoretic semantics necessary to understand the chapters in this collection. Topics discussed include truth conditions, compositionality, context-sensitivity, dynamic semantics, the relation of formal semantic theories to the theoretical apparatus of reference and propositions current in much philosophy of language, what semantic theories aim to explain, realism, the metaphysics of language and different views of the relation between languages and speakers, and the epistemology of semantics.",
      "citationCount": 16,
      "doi": "10.1093/OSO/9780198739548.003.0015",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/364136636d66205f17c44cd5eb97b166edc2a463",
      "venue": "Oxford Scholarship Online",
      "journal": {
        "name": "Oxford Scholarship Online"
      },
      "publicationTypes": null
    },
    {
      "paperId": "809791e43ac07312cadc73a98d3357c9b0f10174",
      "title": "The Science of Meaning",
      "authors": [
        {
          "name": "B Rabern",
          "authorId": "3004611"
        },
        {
          "name": "Bryan Pickel",
          "authorId": "3269879"
        },
        {
          "name": "J. Dever",
          "authorId": "2300117"
        }
      ],
      "year": 2018,
      "abstract": "Semantics is the systematic study of linguistic meaning. The past fifty years have seen an explosion of research into the semantics of natural languages. There are now sophisticated theories of phenomena that were not even known to exist mere decades ago. Much of the early work in natural language semantics was accompanied by extensive reflection on the aims of semantic theory, and the form a theory must take to meet those aims. But this meta-theoretical reflection has not kept pace with recent theoretical innovations. The aim of this volume is to re-address these questions concerning the foundations of natural language semantics in light of the current state-of-the-art in semantic theorizing. The volume addresses a range of foundational questions about formal semantics: what is the best methodology for semantic theorizing, and should experimental techniques play a crucial role? How should we understand the use of formal tools such as model theory, and are there better formal alternatives? How should we think about compositionality? What does semantic theory tell us about the language faculty or linguistic competence? What are the advantages of dynamic semantics? How do formal semantic theories relate to philosophical notions of context, content, interpretation, and propositions?",
      "citationCount": 11,
      "doi": "10.1093/oso/9780198739548.001.0001",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/809791e43ac07312cadc73a98d3357c9b0f10174",
      "venue": "Oxford Scholarship Online",
      "journal": {
        "name": "Oxford Scholarship Online"
      },
      "publicationTypes": null
    },
    {
      "paperId": "c3ff1a6f8a7f44684f48413b7ab14e3298a2cfbd",
      "title": "Perception-Need Theory of Meaning: Definition and Demonstration",
      "authors": [
        {
          "name": "Etienne Mupemba Kabwe Kantanda",
          "authorId": "112964613"
        }
      ],
      "year": 2018,
      "abstract": "There are many theories of meaning such as semantic theories (Rusellianism, fregeanism, Possible World Semantics, Davidsonianism, Internalist theories, etc and foundational theories of meaning (Gricean Program, interpretational theories, etc). Philosophers of language such as Russell, Frege, Grice, Davidson, and Chomskyan internalists have constructed theories of meaning by focusing on the following elements as meaning determiners: referent, property, thought, circumstances, truth-condition, intention, language faculty, interpretation, causes, use, representations, and idea. None of these philosophers of language has thought of “speaker’s need” which is the core element on which the above elements are based in order to state what determines meaning. Therefore, the objective of this article is to demonstrate how the perception of the speaker’s need by the listener or hearer determines meaning in a linguistic communication. This demonstration is based on the results of a research conducted in Bonzola Hospital (a hospital in Mbujimayi City in Democratic Republic of Congo. The data in this study were collected through observation and interview. The observation consisted in attending the interaction between doctors and patients so as to listen to their utterances and watch their gestures, facial expressions, actions and whatever can occur during their communication. As far as the analysis of data is concerned, the Conversation Analysis was used so as to analyze the utterances, facial expressions, actions, gestures, and other elements that can occur in communication between doctors and patients. The results show clearly that the conveyance and reception of meaning does not depend mainly on referent, property, thought, circumstances, truth-condition, intention, language faculty, interpretation, causes, use, representations, and idea but the conveyance and reception of meaning depend on the perception of the speaker’s need by the listener or hearer. The interpretation of the results led to the conclusion that meaning is determined by the perception of the speaker’s need by the listener or hearer.",
      "citationCount": 0,
      "doi": "10.11648/j.cls.20180402.13",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/c3ff1a6f8a7f44684f48413b7ab14e3298a2cfbd",
      "venue": "",
      "journal": {
        "name": "",
        "pages": "37",
        "volume": "4"
      },
      "publicationTypes": null
    },
    {
      "paperId": "4dfdc34f308451e83ef58e0e00263cc3bf2dc348",
      "title": "What can polysemy tell us about theories of explanation?",
      "authors": [
        {
          "name": "Maria Serban",
          "authorId": "22749592"
        }
      ],
      "year": 2017,
      "abstract": "Philosophical accounts of scientific explanation are broadly divided into ontic and epistemic views. This paper explores the idea that the lexical ambiguity of the verb to explain and its nominalisation supports an ontic conception of explanation (Salmon 1989; Craver 2007). I analyse one argument which challenges this strategy by criticising the claim that explanatory talk is lexically ambiguous (Wright, European Journal of Philosophy of Science 2(3), 375–394, 2012). I propose that the linguistic mechanism of transfer of meaning (Nunberg, Journal of Semantics 12(2), 109–132, 1995) provides a better account of the lexical alternations that figure in the systematic polysemy of explanatory talk, and evaluate the implications of this proposal for the debate between ontic and epistemic conceptions of scientific explanation.",
      "citationCount": 5,
      "doi": "10.1007/S13194-016-0142-4",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/4dfdc34f308451e83ef58e0e00263cc3bf2dc348",
      "venue": "",
      "journal": {
        "name": "European Journal for Philosophy of Science",
        "pages": "41-56",
        "volume": "7"
      },
      "publicationTypes": null
    },
    {
      "paperId": "450458e329afd9a85125036c551d978bb4840e08",
      "title": "To the epistemological foundation of the theory of meaning",
      "authors": [
        {
          "name": "A. E. Bochkarev",
          "authorId": "89968014"
        }
      ],
      "year": 2016,
      "abstract": null,
      "citationCount": 0,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/450458e329afd9a85125036c551d978bb4840e08",
      "venue": "",
      "journal": {
        "name": "RUDN Journal of Language Studies, Semiotics and Semantics",
        "pages": "7-16",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "41f17552c2e0ad7ac2a2b8cfc0119937d83f270b",
      "title": "Algorithmic Theory of Meaning",
      "authors": [
        {
          "name": "Jakub Szymanik",
          "authorId": "2325493"
        }
      ],
      "year": 2016,
      "abstract": null,
      "citationCount": 0,
      "doi": "10.1007/978-3-319-28749-2_1",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/41f17552c2e0ad7ac2a2b8cfc0119937d83f270b",
      "venue": "",
      "journal": {
        "name": "",
        "pages": "3-8",
        "volume": ""
      },
      "publicationTypes": [
        "Review"
      ]
    },
    {
      "paperId": "34baa56ac1c5d8491adb370eb9d7ac2038f8288c",
      "title": "Does the use theory of meaning entail legal realism",
      "authors": [
        {
          "name": "S. Sajama",
          "authorId": "113570712"
        }
      ],
      "year": 2016,
      "abstract": null,
      "citationCount": 0,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/34baa56ac1c5d8491adb370eb9d7ac2038f8288c",
      "venue": "",
      "journal": {
        "name": "",
        "volume": "9"
      },
      "publicationTypes": null
    },
    {
      "paperId": "d65816b0c8472a8aa8efd44155ee0eb678262677",
      "title": "Legal Positivism and the Pragmatics of Meaning and Morality",
      "authors": [
        {
          "name": "R. Charnock",
          "authorId": "52107467"
        }
      ],
      "year": 2016,
      "abstract": null,
      "citationCount": 1,
      "doi": "10.1007/978-3-319-30385-7_8",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/d65816b0c8472a8aa8efd44155ee0eb678262677",
      "venue": "",
      "journal": {
        "name": "",
        "pages": "159-184",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "b97d2726488f9e9efc9b0cd3aeee830dca1811f9",
      "title": "What can polysemy tell us about theories of explanation?",
      "authors": [
        {
          "name": "Maria Serban",
          "authorId": "22749592"
        }
      ],
      "year": 2016,
      "abstract": "Philosophical accounts of scientific explanation are broadly divided into ontic and epistemic views. This paper explores the idea that the lexical ambiguity of the verb to explain and its nominalisation supports an ontic conception of explanation (Salmon 1989; Craver 2007). I analyse one argument which challenges this strategy by criticising the claim that explanatory talk is lexically ambiguous (Wright, European Journal of Philosophy of Science 2(3), 375–394, 2012). I propose that the linguistic mechanism of transfer of meaning (Nunberg, Journal of Semantics 12(2), 109–132, 1995) provides a better account of the lexical alternations that figure in the systematic polysemy of explanatory talk, and evaluate the implications of this proposal for the debate between ontic and epistemic conceptions of scientific explanation.",
      "citationCount": 0,
      "doi": "10.1007/s13194-016-0142-4",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/b97d2726488f9e9efc9b0cd3aeee830dca1811f9",
      "venue": "European Journal for Philosophy of Science",
      "journal": {
        "name": "European Journal for Philosophy of Science",
        "pages": "41 - 56",
        "volume": "7"
      },
      "publicationTypes": null
    },
    {
      "paperId": "ffca881f4b1afca6d3fada68d8d42f3713bbbdf2",
      "title": "Against ‘Interpretation’: Quantum Mechanics Beyond Syntax and Semantics",
      "authors": [
        {
          "name": "R. Arroyo",
          "authorId": "118326744"
        },
        {
          "name": "Gilson Olegario da Silva",
          "authorId": "2129798992"
        }
      ],
      "year": 2021,
      "abstract": null,
      "citationCount": 10,
      "doi": "10.1007/s10516-021-09579-y",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/ffca881f4b1afca6d3fada68d8d42f3713bbbdf2",
      "venue": "Axiomathes",
      "journal": {
        "name": "Axiomathes",
        "pages": "1243-1279",
        "volume": "32"
      },
      "publicationTypes": null
    },
    {
      "paperId": "6860c0ceb049aff9d4bbe24354a51d128e0fb93f",
      "title": "SPEECH ACTS, VERBS AND THE PARADIGMATIC VS. SYNTAGMATIC MEANING REVISITED",
      "authors": [
        {
          "name": "Angel S. Angelov",
          "authorId": "2142347181"
        }
      ],
      "year": 2022,
      "abstract": "This paper re-examines some classical theories of the meaning and the embedding of verbs (words for acts) both outside and within context. F. de Saussure’s dichotomy concerning paradigmatic/syntagmatic aspects of meaning finds its further interpretation in various theoretical models, especially in the field of pragmatics and the philosophy of language. Among them the works of M.A.K. Halliday and R. Hassan, as well as of P. Ricoeur could serve as a point of departure in explaining some newer and sophisticated cases of grammaticalization. The paper focuses on examples of the exchange of mental patterns, clichés and frozen expressions due to contemporary language contacts. Keywords: verb semantics, clause predicate semantics, paradigmatic vs. syntagmatic meaning, lexical taxonomies, cross-lingual exchange of conceptualizations and grammaticalization patterns",
      "citationCount": 0,
      "doi": "10.47810/bl.69.22.pr.07",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/6860c0ceb049aff9d4bbe24354a51d128e0fb93f",
      "venue": "Journal of Bulgarian Language",
      "journal": {
        "name": "Journal of Bulgarian Language"
      },
      "publicationTypes": null
    },
    {
      "paperId": "ff2e4dc32a9c441ecec3d5c1b23791188168f670",
      "title": "Perspectives on meaning and interpretation",
      "authors": [
        {
          "name": "Chris Potts",
          "authorId": "2314372642"
        },
        {
          "name": "B. Partee",
          "authorId": "39340971"
        }
      ],
      "year": 2022,
      "abstract": null,
      "citationCount": 0,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/ff2e4dc32a9c441ecec3d5c1b23791188168f670",
      "venue": "",
      "journal": null,
      "publicationTypes": null
    },
    {
      "paperId": "659a6cc60a68a7203afd9c06aae12fc0929494c4",
      "title": "Updating Data Semantics",
      "authors": [
        {
          "name": "A. Gillies",
          "authorId": "1857656"
        }
      ],
      "year": 2018,
      "abstract": "\n This paper has three main goals. First, to motivate a puzzle about how ignorance-expressing terms like maybe and if interact: they (surprisingly) iterate, and when they do they exhibit scopelessness. Second, to argue that there is an ambiguity in our theoretical toolbox, and that exposing that opens the door to a solution to the puzzle. And third, to explore the reach of that solution (it turns out to do work in unexpected places). Along the way, the paper highlights a number of pleasing properties of two elegant semantic theories (data semantics and update semantics), explores some meta-theoretic properties of dynamic notions of meaning, dips its toe into some hazardous waters (epistemic contradictions and presupposition projection), and offers characterization theorems for the space of meanings an indicative conditional can have.",
      "citationCount": 16,
      "doi": "10.1093/MIND/FZY008",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/659a6cc60a68a7203afd9c06aae12fc0929494c4",
      "venue": "Mind",
      "journal": {
        "name": "Mind"
      },
      "publicationTypes": null
    },
    {
      "paperId": "57d78988a8275e589e59539d8d3b0b986d419d6d",
      "title": "From compositional semantics to Bayesian pragmatics via logical inference",
      "authors": [
        {
          "name": "Julian Grove",
          "authorId": "39821060"
        },
        {
          "name": "Jean-Philippe Bernardy",
          "authorId": "2065998688"
        },
        {
          "name": "S. Chatzikyriakidis",
          "authorId": "2136336"
        }
      ],
      "year": 2021,
      "abstract": null,
      "citationCount": 1,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/57d78988a8275e589e59539d8d3b0b986d419d6d",
      "venue": "NALOMA",
      "journal": null,
      "publicationTypes": null
    },
    {
      "paperId": "f92b569eb46715311219e32979975f91851d3ae6",
      "title": "Semantics, Metasemantics, Aboutness",
      "authors": [
        {
          "name": "Ori Simchen",
          "authorId": "2638318"
        }
      ],
      "year": 2017,
      "abstract": null,
      "citationCount": 15,
      "doi": "10.1093/acprof:oso/9780198792147.001.0001",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/f92b569eb46715311219e32979975f91851d3ae6",
      "venue": "",
      "journal": {
        "name": "",
        "volume": ""
      },
      "publicationTypes": null
    }
  ],
  "count": 40,
  "errors": []
}
