{
  "status": "success",
  "source": "semantic_scholar",
  "query": "teleosemantics Millikan mental content",
  "results": [
    {
      "paperId": "4bbcfc07de8b16604393b3e63f3afda74be8e573",
      "title": "Mental Content, Teleological Theories of",
      "authors": [
        {
          "name": "R. Millikan",
          "authorId": "34999744"
        }
      ],
      "year": 2006,
      "abstract": null,
      "citationCount": 2,
      "doi": "10.1002/0470018860.S00128",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/4bbcfc07de8b16604393b3e63f3afda74be8e573",
      "venue": "",
      "journal": {
        "name": "",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "8f4b7664f696d09a39dcac162f1a33e3bedc43c9",
      "title": "Mythological content: a problem for Millikan's teleosemantics",
      "authors": [
        {
          "name": "T. Zawidzki",
          "authorId": "48179092"
        }
      ],
      "year": 2003,
      "abstract": null,
      "citationCount": 3,
      "doi": "10.1080/0951508032000121832",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/8f4b7664f696d09a39dcac162f1a33e3bedc43c9",
      "venue": "",
      "journal": {
        "name": "Philosophical Psychology",
        "pages": "535 - 547",
        "volume": "16"
      },
      "publicationTypes": [
        "Review"
      ]
    },
    {
      "paperId": "4dbcc94b4878b6d3b233ea136e9cd17b850b570f",
      "title": "Teleosemantics and productivity",
      "authors": [
        {
          "name": "Manolo Martínez",
          "authorId": "48901674"
        }
      ],
      "year": 2013,
      "abstract": null,
      "citationCount": 8,
      "doi": "10.1080/09515089.2011.625115",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/4dbcc94b4878b6d3b233ea136e9cd17b850b570f",
      "venue": "",
      "journal": {
        "name": "Philosophical Psychology",
        "pages": "47 - 68",
        "volume": "26"
      },
      "publicationTypes": null
    },
    {
      "paperId": "4ac401216d84ede5ab613bf44676b3a968dcab83",
      "title": "Large language models and linguistic intentionality",
      "authors": [
        {
          "name": "J. Grindrod",
          "authorId": "32861975"
        }
      ],
      "year": 2024,
      "abstract": "Do large language models like Chat-GPT or Claude meaningfully use the words they produce? Or are they merely clever prediction machines, simulating language use by producing statistically plausible text? There have already been some initial attempts to answer this question by showing that these models meet the criteria for entering meaningful states according to metasemantic theories of mental content. In this paper, I will argue for a different approach—that we should instead consider whether language models meet the criteria given by our best metasemantic theories of linguistic content. In that vein, I will illustrate how this can be done by applying two such theories to the case of language models: Gareth Evans’ (1982) account of naming practices and Ruth Millikan’s (1984, 2004, 2005) teleosemantics. In doing so, I will argue that it is a mistake to think that the failure of LLMs to meet plausible conditions for mental intentionality thereby renders their outputs meaningless, and that a distinguishing feature of linguistic intentionality—dependency on a pre-existing linguistic system—allows for the plausible result that LLM outputs are meaningful.",
      "citationCount": 15,
      "doi": "10.1007/s11229-024-04723-8",
      "arxivId": "2404.09576",
      "url": "https://www.semanticscholar.org/paper/4ac401216d84ede5ab613bf44676b3a968dcab83",
      "venue": "Synthese",
      "journal": {
        "name": "Synthese",
        "volume": "204"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "6800f11a80397788f26f691aa1f2bb0d39ab5a10",
      "title": "Teleosemantics: Etiological Foundations",
      "authors": [
        {
          "name": "Sören Häggqvist",
          "authorId": "69409507"
        }
      ],
      "year": 2013,
      "abstract": null,
      "citationCount": 4,
      "doi": "10.1111/J.1747-9991.2012.00532.X",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/6800f11a80397788f26f691aa1f2bb0d39ab5a10",
      "venue": "",
      "journal": {
        "name": "Philosophy Compass",
        "pages": "73-83",
        "volume": "8"
      },
      "publicationTypes": null
    },
    {
      "paperId": "f271c54d7a251c95fd9387280f34312c2e60f229",
      "title": "Teleosemantics Without Natural Selection",
      "authors": [
        {
          "name": "M. Abrams",
          "authorId": "8387985"
        }
      ],
      "year": 2005,
      "abstract": null,
      "citationCount": 26,
      "doi": "10.1007/S10539-005-0359-7",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/f271c54d7a251c95fd9387280f34312c2e60f229",
      "venue": "",
      "journal": {
        "name": "Biology and Philosophy",
        "pages": "97-116",
        "volume": "20"
      },
      "publicationTypes": null
    },
    {
      "paperId": "f8e76cd6ab039062b09cc9ea82ad8d2a72124521",
      "title": "Troubles with Plantinga’s Reading of Millikan",
      "authors": [
        {
          "name": "R. Millikan",
          "authorId": "34999744"
        }
      ],
      "year": 2013,
      "abstract": null,
      "citationCount": 0,
      "doi": "10.1111/J.1933-1592.2011.00571.X",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/f8e76cd6ab039062b09cc9ea82ad8d2a72124521",
      "venue": "",
      "journal": {
        "name": "Philosophy and Phenomenological Research",
        "pages": "454-456",
        "volume": "87"
      },
      "publicationTypes": null
    },
    {
      "paperId": "8c56cec2add9622898fce5a8f1df6ea8bc6c724a",
      "title": "What does a bee know? A teleosemantic framework for cognitive ethologist",
      "authors": [
        {
          "name": "Petar Nurkić",
          "authorId": "1572572466"
        },
        {
          "name": "Ivan Umeljić",
          "authorId": "1475313911"
        }
      ],
      "year": 2022,
      "abstract": "Naturalistic epistemology is usually associated with Quine?s turn from an a\n priori and traditional to a descriptive understanding of knowledge. In this\n paper, however, we will look at theories developed from Quine?s ideas -\n Millikan?s teleosemantics and Kornblith?s cognitive ethology. We will answer\n three questions: (i) Can a bee know?; (ii) What can a bee know?; and (iii)\n Does the bee know? First, we will answer the question of animal cognitive\n capacities using Kornblith?s understanding of the epistemic environment and\n the basic features of cognitive ethology. We will then set up teleosemantics\n as a framework in which Millikanin attempts to naturalize intentional states\n and answer the question of the knowledge content in animals. By\n understanding natural signs and considering the non-propositional content of\n mental representations in animals, we will answer the third question and\n show how Kornblith and cognitive ethologists attempt to track the processes\n of forming reliable true beliefs in different kinds of organisms. We will\n answer each of the three questions above by drawing on the research of\n apiologists and cognitive ethologists to provide empirical support for the\n theses of our work and so that we do not remain only on attempts, possible\n introductions, and anecdotes of naturalistic conceptions of knowledge, but\n provide concrete descriptions of the world and the place of knowledge in it.",
      "citationCount": 0,
      "doi": "10.2298/theo2204033n",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/8c56cec2add9622898fce5a8f1df6ea8bc6c724a",
      "venue": "Theoria Beograd",
      "journal": {
        "name": "Theoria, Beograd"
      },
      "publicationTypes": null
    },
    {
      "paperId": "d5bd1a034da75e3dea68981a930a8be2d9e2dc25",
      "title": "Why mental content is not like water: reconsidering the reductive claims of teleosemantics",
      "authors": [
        {
          "name": "Peter Schulte",
          "authorId": "2068646340"
        }
      ],
      "year": 2018,
      "abstract": null,
      "citationCount": 10,
      "doi": "10.1007/s11229-018-1808-6",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/d5bd1a034da75e3dea68981a930a8be2d9e2dc25",
      "venue": "Synthese",
      "journal": {
        "name": "Synthese",
        "pages": "2271 - 2290",
        "volume": "197"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "2fd02cd7ae29c79841ec0543b14af77d75e517f8",
      "title": "The Prospects for Teleosemantics: Can Biological Functions Fix Mental Content?",
      "authors": [
        {
          "name": "J. Kingsbury",
          "authorId": "144136807"
        }
      ],
      "year": 2017,
      "abstract": null,
      "citationCount": 1,
      "doi": "10.4324/9781315764863.CH20",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/2fd02cd7ae29c79841ec0543b14af77d75e517f8",
      "venue": "",
      "journal": {
        "name": "",
        "pages": "282-292",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "b8a2eee595c9c5f091c0be91543326d1c58dde48",
      "title": "Teleosemantics and the hard problem of content",
      "authors": [
        {
          "name": "S. Mann",
          "authorId": "2067987507"
        },
        {
          "name": "R. Pain",
          "authorId": "2069724939"
        }
      ],
      "year": 2021,
      "abstract": "ABSTRACT Hutto and Myin claim that teleosemantics cannot account for mental content. In their view, teleosemantics accounts for a poorer kind of relation between cognitive states and the world but lacks the theoretical tools to account for a richer kind. We show that their objection imposes two criteria on theories of content: a truth-evaluable criterion and an intensionality criterion. For the objection to go through, teleosemantics must be subject to both these criteria and must fail to satisfy them. We argue that teleosemantics meets the truth-evaluable criterion and is not required to meet the intensionality criterion. We conclude that Hutto and Myin’s objection fails.",
      "citationCount": 4,
      "doi": "10.1080/09515089.2021.1942814",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/b8a2eee595c9c5f091c0be91543326d1c58dde48",
      "venue": "Philosophical Psychology",
      "journal": {
        "name": "Philosophical Psychology",
        "pages": "22 - 46",
        "volume": "35"
      },
      "publicationTypes": null
    },
    {
      "paperId": "8f3f363233bed1ac034800883aed10f25194bc56",
      "title": "Teleosemantics, Structural Resemblance and Predictive Processing",
      "authors": [
        {
          "name": "Ross Pain",
          "authorId": "122319793"
        },
        {
          "name": "S. Mann",
          "authorId": "2067987507"
        }
      ],
      "year": 2024,
      "abstract": "We propose a pluralist account of content for predictive processing systems. Our pluralism combines Millikan’s teleosemantics with existing structural resemblance accounts. The paper has two goals. First, we outline how a teleosemantic treatment of signal passing in predictive processing systems would work, and how it integrates with structural resemblance accounts. We show that the core explanatory motivations and conceptual machinery of teleosemantics and predictive processing mesh together well. Second, we argue this pluralist approach expands the range of empirical cases to which the predictive processing framework might be successfully applied. This is because our pluralism is practice-oriented. A range of different notions of content are used in the cognitive sciences to explain behaviour, and some of these cases look to employ teleosemantic notions. As a result, our pluralism gives predictive processing the scope to cover these cases.",
      "citationCount": 1,
      "doi": "10.1007/s10670-024-00819-2",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/8f3f363233bed1ac034800883aed10f25194bc56",
      "venue": "Erkenntnis: An International Journal of Scientific Philosophy",
      "journal": {
        "name": "Erkenntnis",
        "pages": "2523 - 2547",
        "volume": "90"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "547e471126ff692d6fad062ec7e1f53689a31434",
      "title": "Frogs recognize prey: a causal-behavioral teleosemantics",
      "authors": [
        {
          "name": "Esteban Withrington",
          "authorId": "2331544344"
        }
      ],
      "year": 2024,
      "abstract": "I propose a version of teleosemantics for simple animal representations that combines Millikan’s suggestion that they represent the most crucial “normal conditions” required for them to bring about their beneficial behavioral effects with Neander’s suggestion that they represent their “normal causes”. The content of a simple representation is the most crucial among the normal conditions responsible for its tokens having beneficial behavioral effects that also causes such tokens. I argue that this version delivers more plausible contents than other versions of teleosemantics. Frogs’ prey detectors represent the animals they prey on rather than nutritious or small moving things.",
      "citationCount": 1,
      "doi": "10.1007/s10539-024-09967-9",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/547e471126ff692d6fad062ec7e1f53689a31434",
      "venue": "Biology & Philosophy",
      "journal": {
        "name": "Biology & Philosophy",
        "volume": "39"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "b6fd5ef4950b41aa58814a84f7ba90ccb2ee91fc",
      "title": "In Favor of Teleosemantics: A Millikanian Treatment of the Intentional Content of Mental Representation",
      "authors": [
        {
          "name": "Pierre Faye",
          "authorId": "2073444695"
        }
      ],
      "year": 2011,
      "abstract": null,
      "citationCount": 0,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/b6fd5ef4950b41aa58814a84f7ba90ccb2ee91fc",
      "venue": "",
      "journal": {
        "name": "",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "7eb5aaada259d4e3137788c1d1e1bf646761466d",
      "title": "A Mark of the Mental: In Defense of Informational Teleosemantics",
      "authors": [
        {
          "name": "Gary Ostertag",
          "authorId": "46208685"
        }
      ],
      "year": 2019,
      "abstract": "Teleosemantic theories seek to explain mental representation in terms borrowed from the science of natural selection. There is an obvious attraction to the approach, as it has the potential to provide a purely naturalistic explanation of the normativity of mental content. If, as the teleosemanticist claims, the function of a given internal state is to represent the world as being thus-and-so, then for it to misrepresent is for it to fail to do what it is, in effect, supposed to do. Since the notion of a function—of a trait that has a purpose—can be cashed out in terms derived from evolutionary biology, the theory has the potential to make naturalistic sense of a crucial aspect of mental content. There are, of course, other naturalistic approaches to mental representation, but what marks teleosemantics as unique is that its explanation of content normativity flows from its core principle. Karen Neander’s A Mark of the Mental (MM) is a densely argued and comprehensive defense of a particular teleosemantic theory. Its central concern is twofold: (i) to understand the explanatory role of representations—intentional states—in cognitive science, and (ii) to identify the grounds of intentionality—the non-intentional facts on which intentionality ‘constitutively ... depend[s]’ [9]. Neander endorses an aetiological notion of biological function, which identifies the function of an item with what historically explains that item’s existence—with ‘what items of that type were selected to do’ [48–9]. This is wedded to a causal-informational theory of content. While the latter approach is not unique among teleosemanticists, MM is valuable in providing a careful and systematic defence of the view. Moreover, it departs from teleosemanticist orthodoxy in its deployment of what Neander calls ‘response functions’. 628 BOOK REVIEWS",
      "citationCount": 6,
      "doi": "10.1080/00048402.2018.1555267",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/7eb5aaada259d4e3137788c1d1e1bf646761466d",
      "venue": "Australasian Journal of Philosophy",
      "journal": {
        "name": "Australasian Journal of Philosophy",
        "pages": "628 - 631",
        "volume": "97"
      },
      "publicationTypes": [
        "Review"
      ]
    },
    {
      "paperId": "b0de8e3d4308cabcbbff3166ce917c2fd47d9c3d",
      "title": "Review of Karen Neander’s A Mark of the Mental: In Defense of Informational Teleosemantics",
      "authors": [
        {
          "name": "Justin Garson",
          "authorId": "20549506"
        }
      ],
      "year": 2018,
      "abstract": "AMark of the Mental: In Defense of Informational Teleosemantics is Karen Neander’s long-awaited first book. It achieves three main goals. First, it establishes teleosemantics as a leading candidate for naturalizing intentionality. Second, it develops a highly original and innovative version of teleosemantics, informational teleosemantics (IT), which stands in contrast to consumer-based accounts. Third, it offers plausible solutions to the various content indeterminacy problems that have historically plagued the topic. Throughout the book, Neander exhibits the deft interweaving of philosophy of biology and philosophy of mind that has marked her career. Stated roughly, IT says that the content of a (sensory-perceptual) representation is whatever is supposed to cause it (149). More precisely, at its most basic, IT holds that a sensory-perceptual representation, R, is about C if there is a mechanism that has the function of producing R’s in response to C’s (151). So, for example, a specificmidbrain activation pattern in a toadmight be about long wriggling things, if there is a mechanism in the toad’s brain that has the function of producing that pattern in response to longwriggling things. In this, IT differs from consumer-oriented views, which hold that a representation’s content depends on the mechanisms that utilize (consume) it. For example, in Millikan’s consumer-based view, a toad’s midbrain activation pattern is about worms because that is what it must correspond to for the consumer",
      "citationCount": 5,
      "doi": "10.1086/698997",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/b0de8e3d4308cabcbbff3166ce917c2fd47d9c3d",
      "venue": "Philosophia Scientiæ",
      "journal": {
        "name": "Philosophy of Science",
        "pages": "726 - 734",
        "volume": "85"
      },
      "publicationTypes": [
        "Review"
      ]
    },
    {
      "paperId": "2c368d976b760b5e8bbc9617bdc5ec8846ea787f",
      "title": "Mental Representations and Millikan's Theory of Intentional Content: Does Biology Chase Causality?",
      "authors": [
        {
          "name": "Robert D. Rupert",
          "authorId": "2961334"
        }
      ],
      "year": 1999,
      "abstract": null,
      "citationCount": 4,
      "doi": "10.1111/J.2041-6962.1999.TB00860.X",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/2c368d976b760b5e8bbc9617bdc5ec8846ea787f",
      "venue": "",
      "journal": {
        "name": "Southern Journal of Philosophy",
        "pages": "113-140",
        "volume": "37"
      },
      "publicationTypes": null
    },
    {
      "paperId": "9bfef365448f9f5667f788962664e66479127e81",
      "title": "The Dilemma of Ahistorical Teleosemantics",
      "authors": [
        {
          "name": "F. Hundertmark",
          "authorId": "1936727"
        }
      ],
      "year": 2023,
      "abstract": "Abstract Teleosemantic theories aim to naturalize mental representation through the use of functions, typically based on past selection processes. However, the historical dependence of these theories has faced severe criticism, leading some philosophers to develop ahistorical alternatives. This article presents a new dilemma for all ahistorical teleosemantic theories, focusing in particular on the theories proposed by Timothy Schroeder and Bence Nanay. These theories require certain dispositions in the producers or consumers of mental representations, but the appeal to dispositions puts the proponents in an undesirable position: mental content is either overly dependent on current circumstances or ultimately dependent on historical factors.",
      "citationCount": 1,
      "doi": "10.1017/psa.2023.98",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/9bfef365448f9f5667f788962664e66479127e81",
      "venue": "Philosophia Scientiæ",
      "journal": {
        "name": "Philosophy of Science",
        "pages": "58 - 71",
        "volume": "91"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "7d56ed55fe1512ff2db1b70b3d216f96aaf2e45f",
      "title": "Does Phenomenology Ground Mental Content?",
      "authors": [
        {
          "name": "A. Pau",
          "authorId": "2028968488"
        }
      ],
      "year": 2014,
      "abstract": null,
      "citationCount": 0,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/7d56ed55fe1512ff2db1b70b3d216f96aaf2e45f",
      "venue": "",
      "journal": null,
      "publicationTypes": null
    },
    {
      "paperId": "cf846bc8f9df2dfe0187b539a4df119796f9d806",
      "title": "An Input Condition for Teleosemantics? Reply to Shea (and Godfrey‐Smith)1",
      "authors": [
        {
          "name": "R. Millikan",
          "authorId": "34999744"
        }
      ],
      "year": 2007,
      "abstract": null,
      "citationCount": 24,
      "doi": "10.1111/J.1933-1592.2007.00083.X",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/cf846bc8f9df2dfe0187b539a4df119796f9d806",
      "venue": "",
      "journal": {
        "name": "Philosophy and Phenomenological Research",
        "pages": "436-455",
        "volume": "75"
      },
      "publicationTypes": null
    },
    {
      "paperId": "257593595e9976a02e99976f2fdca6fb735593bf",
      "title": "Indeterminacy, Uselessness, and Abstraction. Problems Posed by Teleological Theories of Mental Content",
      "authors": [
        {
          "name": "A. Jaume",
          "authorId": "90568024"
        }
      ],
      "year": 2013,
      "abstract": null,
      "citationCount": 0,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/257593595e9976a02e99976f2fdca6fb735593bf",
      "venue": "",
      "journal": {
        "name": "Ideas Y Valores",
        "pages": "35-52",
        "volume": "62"
      },
      "publicationTypes": null
    },
    {
      "paperId": "233a0e5bc47d040120392e1d6b5941d3d0c0de25",
      "title": "Causal Theories of Mental Content",
      "authors": [
        {
          "name": "Robert D. Rupert",
          "authorId": "2961334"
        }
      ],
      "year": 2008,
      "abstract": null,
      "citationCount": 63,
      "doi": "10.1111/J.1747-9991.2008.00130.X",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/233a0e5bc47d040120392e1d6b5941d3d0c0de25",
      "venue": "",
      "journal": {
        "name": "Philosophy Compass",
        "pages": "353-380",
        "volume": "3"
      },
      "publicationTypes": [
        "Review"
      ]
    },
    {
      "paperId": "79cae9e0ff684182740443d845ea7a863c33ce04",
      "title": "Teleosemantics re-examined: content, explanation and norms",
      "authors": [
        {
          "name": "C. Price",
          "authorId": "40495940"
        }
      ],
      "year": 2014,
      "abstract": null,
      "citationCount": 5,
      "doi": "10.1007/S10539-014-9431-5",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/79cae9e0ff684182740443d845ea7a863c33ce04",
      "venue": "",
      "journal": {
        "name": "Biology & Philosophy",
        "pages": "587-596",
        "volume": "29"
      },
      "publicationTypes": [
        "Review"
      ]
    },
    {
      "paperId": "cbda5b21b2eb0df5239a95f12b82482e97d763cb",
      "title": "Teleosemantics re-examined: content, explanation and norms",
      "authors": [
        {
          "name": "C. Price",
          "authorId": "40495940"
        }
      ],
      "year": 2014,
      "abstract": null,
      "citationCount": 0,
      "doi": "10.1007/s10539-014-9431-5",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/cbda5b21b2eb0df5239a95f12b82482e97d763cb",
      "venue": "Biology & Philosophy",
      "journal": {
        "name": "Biology & Philosophy",
        "pages": "587 - 596",
        "volume": "29"
      },
      "publicationTypes": [
        "Review"
      ]
    },
    {
      "paperId": "82ec7433d7e3cbccdf402a1209f1df32bba42518",
      "title": "[Book Review] Teleosemantics re-examined: content, explanation and norms",
      "authors": [
        {
          "name": "C. Price",
          "authorId": "40495940"
        }
      ],
      "year": 2014,
      "abstract": null,
      "citationCount": 0,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/82ec7433d7e3cbccdf402a1209f1df32bba42518",
      "venue": "",
      "journal": {
        "name": "",
        "volume": ""
      },
      "publicationTypes": [
        "Review"
      ]
    }
  ],
  "count": 25,
  "errors": []
}
