{
  "status": "success",
  "source": "semantic_scholar",
  "query": "use theory meaning Wittgenstein",
  "results": [
    {
      "paperId": "91e6b425171a13358a338eaf4173478462404fb9",
      "title": "Rule Following: A Criterion for Wittgenstein’s meaning as Use Theory",
      "authors": [
        {
          "name": "Tano Benjamin Kamota",
          "authorId": "2329293777"
        },
        {
          "name": "George Ndemo",
          "authorId": "2185892794"
        }
      ],
      "year": 2024,
      "abstract": "Since the publication of Wittgenstein on Rules and Private Language by Saul Kripke, there have been controversial interpretations of what it means by ‘rule following’ with regard to the question of meaning. Kripke maintains that Wittgenstein’s paradox of rule following demands us to consider what mental or behavioral items could constitute meaning. This boils down, according to Kripke, to the conclusion that either of the choice ends up with a dilemma which calls for a solution yet again to yield another sceptical solution. Rivals to Kripke like McDowell and Wright have argued that if we seriously read Wittgenstein we realise that a dispositional choice is plausible. Others like Patrizio Lo Presti, for example, have defended Wittgenstein by positing that there is no need to separate mental and behvioral items in the first place and that Wittgenstein is misinterpreted. Following this line of thinking, this paper contends that rule following is an essential criteria for Wittgenstein theory of meaning as use. It takes the view that if the paradox forces us to make a choice then it is plausible to choose behavioral items as satisfying rule following and so meaning. The paper thus adopts the position that, when discussing the concept of language game to the conclusion that the meaning of a word is but its use, Wittgenstein successfully uses the concept of rule following to reach this conclusion. Simply, meaning as use is realized when people follow the rules of language. They are neither written rules nor syntactical rules but semantic rules of language based on context. Thus, in our daily conversations and practical life humans tend to follow rules, sometimes without being familiar with that, to successfully understand each other and take actions on various issues at hand. This begins right from the moment we learn language.",
      "citationCount": 0,
      "doi": "10.47191/ijsshr/v7-i10-95",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/91e6b425171a13358a338eaf4173478462404fb9",
      "venue": "International journal of social science and human research",
      "journal": {
        "name": "International Journal of Social Science and Human Research"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "a96f082d4339376702d3ea8ddda13ab97b03de90",
      "title": "A Comparative Study Between Wittgenstein's Meaning Use Theory and Systemic Functional Linguistics",
      "authors": [
        {
          "name": "Tian Huajin",
          "authorId": "117885685"
        }
      ],
      "year": 2015,
      "abstract": null,
      "citationCount": 0,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/a96f082d4339376702d3ea8ddda13ab97b03de90",
      "venue": "",
      "journal": {
        "name": "Journal of Henan Polytechnic University",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "67b87ccc51ce95fa358fde36287d41fedce1cf5d",
      "title": "Russell’s Use Theory of Meaning",
      "authors": [
        {
          "name": "N. Griffin",
          "authorId": "143884004"
        }
      ],
      "year": 2020,
      "abstract": "Russell is often accused of having a naive ‘Fido’–Fido theory of meaning of the sort Wittgenstein attacked at the beginning of the Philosophical Investigations. In this paper I argue that he never held such a theory though I concede that, prior to 1918, he said various things that might lead a very careless reader to suppose that he had. However, in The Analysis of Mind (1921), a book which (from the work of Garth Hallett) we know Wittgenstein studied closely, Russell put forward an account of understanding an utterance which clearly anticipates the use theory of meaning usually attributed to Wittgenstein. The paper concludes with some problems for understanding the use theory of meaning as presented by both Russell and, derivatively, Wittgenstein.",
      "citationCount": 3,
      "doi": "10.15173/jhap.v8i3.4142",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/67b87ccc51ce95fa358fde36287d41fedce1cf5d",
      "venue": "",
      "journal": {
        "name": "",
        "volume": "8"
      },
      "publicationTypes": null
    },
    {
      "paperId": "34baa56ac1c5d8491adb370eb9d7ac2038f8288c",
      "title": "Does the use theory of meaning entail legal realism",
      "authors": [
        {
          "name": "S. Sajama",
          "authorId": "113570712"
        }
      ],
      "year": 2016,
      "abstract": null,
      "citationCount": 0,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/34baa56ac1c5d8491adb370eb9d7ac2038f8288c",
      "venue": "",
      "journal": {
        "name": "",
        "volume": "9"
      },
      "publicationTypes": null
    },
    {
      "paperId": "a5491e868e90cfa0d594d0a777bb697bb49c4e7e",
      "title": "Wittgenstein and Husserl: Context Meaning Theory",
      "authors": [
        {
          "name": "S. Chakraborty",
          "authorId": "104383436"
        }
      ],
      "year": 2016,
      "abstract": null,
      "citationCount": 1,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/a5491e868e90cfa0d594d0a777bb697bb49c4e7e",
      "venue": "",
      "journal": {
        "name": "",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "f6b9613608dd1df408cda7cf16ecae838a80c1eb",
      "title": "HATE SPEECH ON SOCIAL MEDIA: WITTGENSTEIN’S LANGUAGE GAMES THEORY",
      "authors": [
        {
          "name": "Rizkia Shafarini",
          "authorId": "2181573212"
        },
        {
          "name": "Dadan Rusmana",
          "authorId": "2082187934"
        }
      ],
      "year": 2022,
      "abstract": "One of the most prevalent concerns on social media is hate speech. Because hate speech is mainly transmitted in text form on social media, linguistic analysis is required to determine the meaning of the hate speech. This study aims to look at the view of hate speech on social media using a literature study technique based on the Wittgenstein language game theory approach. According to Wittgenstein, language does not have a single logical structure but is complicated in its use in human life, which spans a wide range of activities. Previous research has looked at the meaning linked with language use in social media. As Wittgenstein proposes, the finding of the research is That ordinary language collected through social media data may be utilized to offer direct answers to social scientific questions. Online media that allows people to represent themselves and cooperate to share, connect with other users, and form virtual social relationships are referred to as social media. Starting with the presentation of quotes, there will be a \"language game\" with the concept of \"from, by, and for.\" Finally, the author proposes using two markers to analyze hate speech on social media: typology and message content",
      "citationCount": 1,
      "doi": "10.23917/kls.v7i1.15985",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/f6b9613608dd1df408cda7cf16ecae838a80c1eb",
      "venue": "Kajian Linguistik dan Sastra",
      "journal": {
        "name": "Kajian Linguistik dan Sastra"
      },
      "publicationTypes": null
    },
    {
      "paperId": "f91711c842d1c29d1d9e60dd91dd3fc7356fc82c",
      "title": "λεκτόν and Use\n Wittgenstein and the Incorporeal",
      "authors": [
        {
          "name": "Felice Cimatti",
          "authorId": "2083477585"
        }
      ],
      "year": 2022,
      "abstract": "Any theory of language – ancient or contemporary, philosophical or cognitive – faces the same problem, i.e. how to reconcile the unequivocally corporeal character of the speakers and the world they speak of with the somewhat ‘incorporeal’ character of the meanings of linguistic expressions. It is for this reason, for example, that direct-reference theories of language (Stroll 1999) seek to eliminate the Fregean notion of 'sense' (Sinn) from semantics. What is at stake is a completely corporeal account of language. However, such an attempt clashes with the fact that the vast majority of linguistic expressions do not refer either to any objects in the world or to the pre-scientific intuition that words have an autonomous 'meaning' (that is, that the 'sense' of a word does not coincide with the referent, Bedeutung). \nTo solve such a problem, the Stoics introduced in their theory of language the notion of lekton, i.e. what is 'said' or is 'sayable'. Even if the lekton is, properly speaking, incorporeal, at the same time it is the corporeal product of what human speakers do when they utter a verbal utterance. In this paper I propose to compare the notion of lekton to the similar notion of 'use' (Gebrauch), much debated in Ludwig Wittgenstein’s Philosophical Investigations. The thesis of this paper is not that there exists a direct philological connection between the Stoic notion of lekton and the notion of linguistic 'use' in Wittgenstein (even if this cannot be excluded either). Instead, the idea is that when one wants to propose an adequate theory of language, one cannot but introduce a notion such as that of lekton or 'use'.",
      "citationCount": 0,
      "doi": "10.30687/jolma/2723-9640/2022/01/006",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/f91711c842d1c29d1d9e60dd91dd3fc7356fc82c",
      "venue": "JOLMA",
      "journal": {
        "name": "JoLMA"
      },
      "publicationTypes": null
    },
    {
      "paperId": "de9a625aa57655360ae8c88678df455fae9a9e25",
      "title": "Wittgenstein on Freud’s Interpretation of Dreams",
      "authors": [
        {
          "name": "Foivos Syrigos",
          "authorId": "2377372023"
        }
      ],
      "year": 2025,
      "abstract": "Abstract Wittgenstein’s comments on Freud’s work have been widely discussed. Scholars such as Bouveresse (1995) and Cioffi (2009) have explored Wittgenstein’s conception of the unconscious, while McGuinness (2002) examined their intellectual relationship, and Harcourt (2017) addressed Wittgenstein’s ties to psychoanalysis. Despite recent efforts to connect Wittgenstein’s work with psychology, little attention has been given to the subject that intrigued Wittgenstein most: dreams. His interest in hypnotic phenomena and dream interpretation significantly predates his engagement with Freud (cf. Monk 1990; McGuinness 1988). This paper explores Wittgenstein’s engagement with dreams, primarily as reflected in his “Conversations on Freud”. This analysis will address issues related to the philosophy of science—such as evidence, explanation, and justification—as well as key concerns in Wittgenstein’s work, including his concept of meaning as use and his notion of change of aspect. While Wittgenstein ultimately rejected Freud’s theory due to its scientific and philosophical shortcomings, his admiration for it mirrored his regard for Darwin and Copernicus: not flawless, but profoundly generative.",
      "citationCount": 0,
      "doi": "10.1515/witt-2025-0007",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/de9a625aa57655360ae8c88678df455fae9a9e25",
      "venue": "Wittgenstein-Studien",
      "journal": {
        "name": "Wittgenstein-Studien",
        "pages": "147 - 178",
        "volume": "16"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "c1c250cd1a43fad2772e3d4bd19a2788086219ee",
      "title": "Wittgenstein on Truth and Meaning",
      "authors": [
        {
          "name": "P. Horwich",
          "authorId": "1739784"
        }
      ],
      "year": 2018,
      "abstract": "ABSTRACT My topic is Wittgenstein’s eventual abandonment of his Tractatus idea that a sentence is true if and only if it depicts a possible fact that obtains, and his coming (in the Investigations) to replace this with a deflationary view of truth. Three objections to the initial idea that will be discussed here are: (i) that its theory of ‘depiction’ relies on an unexplicated concept of word-object reference; (ii) that its notion of a possible fact obtaining (or existing, or being actual, or agreeing with reality) is also left mysterious; and (iii) that Wittgenstein’s conception of possible atomic facts makes it difficult to see how any of them could fail to be actual. These problems are resolved by deflationism. But that perspective could not have been incorporated into the Tractatus. For the view of ‘meaning qua use’, on which deflationism depends, was the key insight enabling Wittgenstein to appreciate the untenability of his other central Tractarian doctrines. I’ll conclude the paper with an examination of José Zalabardo’s quite different reading of the book, and indicate where and why I’m not persuaded by it.",
      "citationCount": 5,
      "doi": "10.1080/24740500.2019.1655841",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/c1c250cd1a43fad2772e3d4bd19a2788086219ee",
      "venue": "Australasian Philosophical Review",
      "journal": {
        "name": "Australasian Philosophical Review",
        "pages": "285 - 298",
        "volume": "2"
      },
      "publicationTypes": null
    },
    {
      "paperId": "dec110b8450ac60b68d9eb0de87ac09448edf7ca",
      "title": "Language Philosophy and Changes in Meaning in Digital Culture",
      "authors": [
        {
          "name": "Rizka Auliya Jufri",
          "authorId": "2393840663"
        },
        {
          "name": "Hasnah Faizah",
          "authorId": "2393842235"
        },
        {
          "name": "Lisdawati",
          "authorId": "2393840539"
        }
      ],
      "year": 2025,
      "abstract": "This study aims to analyze the semantic shift in language within digital culture through the perspectives of linguistics and the philosophy of language. The focus of the study is directed toward the phenomenon of memes, emojis, abbreviations, and popular expressions that have rapidly developed on social media platforms and often deviate from their standard meanings. The research employs a descriptive qualitative method using content analysis combined with a philosophical literature review. Data were obtained from various digital platforms such as Instagram, TikTok, and Twitter/X, as well as relevant academic sources. The results indicate that semantic shifts in digital language occur through patterns of meaning expansion, metaphorization, polysemy, and linguistic innovation. From the standpoint of the philosophy of language, these findings align with Wittgenstein's meaning is use theory and Austin's speech act theory, both of which emphasize that meaning is determined by the practical use of language and speech acts within social contexts. Thus, the changes in meaning in digital culture are not merely linguistic but also reflect the social, cultural, and technological dynamics that shape modern communication patterns.",
      "citationCount": 0,
      "doi": "10.62951/ijsie.v2i4.426",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/dec110b8450ac60b68d9eb0de87ac09448edf7ca",
      "venue": "International Journal of Studies in International Education",
      "journal": {
        "name": "International Journal of Studies in International Education"
      },
      "publicationTypes": [
        "JournalArticle",
        "Review"
      ]
    },
    {
      "paperId": "28cb5318483ef71860dc22d46dc581f3aed7c866",
      "title": "Wittgenstein’da Anlam ve Mistisizmin İki İslam düşünüründen Hareketle Değerlendirilmesi",
      "authors": [
        {
          "name": "İlyas Özdemir",
          "authorId": "97823068"
        }
      ],
      "year": 2024,
      "abstract": "One of the greatest philosophers in contemporary philosophy, Ludwig Wittgenstein, presents a picture theory of language that describes reality in his work Tractatus Logico-Philosophicus. In this theory, the non-factual is positioned outside the boundaries of language. Wittgenstein takes a mystical stance on the inexpressible and deals with them in terms of a theory of meaning based on depiction. In addition, Wittgenstein reconsiders the problem of meaning in the context of the use of language in his late works and makes some corrections in his views. Wittgenstein, who was previously influenced by the view that only the factual can be meaningful, which was discussed in the Vienna circle, also settles on a position related to mysticism. In the present study, Wittgenstein's views on meaning are compared with those of Ibn Khaldun, and his views on mysticism with those of Ibn Arabi, and it is aimed to determine their similarities.\nKey Words: Wittgenstein, Ibn Khaldun, Ibn Arabi, meaning, mystisicsm, metaphysics",
      "citationCount": 0,
      "doi": "10.52096/usbd.8.36.32",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/28cb5318483ef71860dc22d46dc581f3aed7c866",
      "venue": "International journal of social science",
      "journal": {
        "name": "International Journal of Social Sciences"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "391154b6bc9a9cf3ea13393f79240826138ea4d3",
      "title": "Language and Thought in Wittgenstein",
      "authors": [
        {
          "name": "Anselmo Orlando Pinto",
          "authorId": "2082409063"
        }
      ],
      "year": 2024,
      "abstract": "Language and Thought in Wittgenstein – is the theme of this preparation and aims to highlight the contributions of Ludwig Wittgenstein in the reflection on the philosophy of language. Wittgenstein discusses the problems of language in two important works, (Tratactus and Philosophical Investigations) that comprise the phases of the development of his thought, that is, the First Wittgenstein and the Second Wittgenstein. In the Tractatus, language is analyzed outside the concrete circumstances in which it is used in the context of life, while in the Philosophical Investigations the emphasis is on stating that the meaning of linguistic statements is conferred by their use in the context of social practices. Wittgensteinian thought in its first phase speaks of language as a logical mirror of reality, fixed through elementary propositions that have their foundation in the theory of figuration. The second Wittgenstein conceives language based on its different uses, abandoning the essence of language and, therefore, its limits imposed by the logical world. For Wittgenstein, language fulfills a representative function, because through it people can represent their experiences in different ways, moreover, language is a social practice connected to a form of action in the world. Finally, given the influence of the environment on language, it is no longer separated from human life in its essence of creating, recreating and expressing thought. To carry out this study, the method of bibliographical review was preferred, which allowed us to conclude that the First Wittgenstein (Tratactus) constitutes a way of adapting language to the desire for metaphysical knowledge of reality and, with the Second Wittgenstein (Philosophical Investigations), the Language reveals the complex nature of man's being and his intellectual superiority.",
      "citationCount": 0,
      "doi": "10.14738/assrj.1112.17871",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/391154b6bc9a9cf3ea13393f79240826138ea4d3",
      "venue": "Advances in Social Sciences Research Journal",
      "journal": {
        "name": "Advances in Social Sciences Research Journal"
      },
      "publicationTypes": [
        "JournalArticle",
        "Review"
      ]
    },
    {
      "paperId": "d4e2e2c37d4457d4c0d4b3f28d871ec8f21a7f18",
      "title": "Is there something in common? Forms and the theory of word meaning.",
      "authors": [
        {
          "name": "T. Pritchard",
          "authorId": "91383267"
        }
      ],
      "year": 2017,
      "abstract": null,
      "citationCount": 4,
      "doi": "10.1111/EJOP.12253",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/d4e2e2c37d4457d4c0d4b3f28d871ec8f21a7f18",
      "venue": "",
      "journal": {
        "name": "European Journal of Philosophy",
        "pages": "1675-1694",
        "volume": "25"
      },
      "publicationTypes": null
    },
    {
      "paperId": "7fb2e7b8afabe0e21b94952652f3a7557697a4b4",
      "title": "Classical, non-classical and post-non-classical theories of meaning in mathematics",
      "authors": [
        {
          "name": "Елена Владимировна Косилова",
          "authorId": "2194206082"
        }
      ],
      "year": 2022,
      "abstract": "Неклассическая математика появляется в XIX веке и характеризуется прежде всего тем, что не полагается на созерцание. Соответственно, в теориях понимания математического смысла это изменение отражается в переходе от классических теорий (Э. Гуссерль) к неклассическим (Л. Витгенштейн) и пост-неклассическим (Х. Филд). Для развития пост-неклассической философии математического понимания можно привлечь теорию дискурса Ж. Делеза.\n Non-classical mathematics appears in the 19th century and is characterized primarily by the fact that it does not rely on intuition. Accordingly, in the theories of understanding of the mathematical meaning, this change is reflected in the transition from classical theories (Husserl) to non-classical (Wittgenstein) and post-non-classical (Hartry Field). For the development of post-non-classical philosophy of mathematical understanding, one can use the theory of discourse by Deleuze.",
      "citationCount": 0,
      "doi": "10.52119/lphs.2022.55.77.015",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/7fb2e7b8afabe0e21b94952652f3a7557697a4b4",
      "venue": "Логико-философские штудии",
      "journal": {
        "name": "Логико-философские штудии"
      },
      "publicationTypes": null
    },
    {
      "paperId": "1df43ff88e0b912eaecac89d66c04cb7cd608c87",
      "title": "Wittgenstein’s Bridge\n A Linguistic Account of Visual Representation",
      "authors": [
        {
          "name": "M. Biggs",
          "authorId": "145009784"
        }
      ],
      "year": 2021,
      "abstract": "This paper uses structure-mapping to bridge the divide between the analytical and visual culture traditions of image interpretation. Wittgenstein’s analytic ‘picture theory of meaning’ from his early period, and his cultural theory of ‘meaning as use’ from his later period are used to show that the terms similarity, analogy and metaphor can be applied to both image and linguistic interpretation. As a result, by the mapping of similarity and analogy onto the analytic approach, and by the mapping of metaphor onto the visual culture approach, a common linguistic ground for the comparison of these two approaches to image interpretation can be established.",
      "citationCount": 0,
      "doi": "10.30687/jolma/2723-9640/2021/01/010",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/1df43ff88e0b912eaecac89d66c04cb7cd608c87",
      "venue": "2 | 1 | 2021\n Image/Images: A Debate Between Philosophy and Visual Studies",
      "journal": {
        "name": "2 | 1 | 2021\n Image/Images: A Debate Between Philosophy and Visual Studies"
      },
      "publicationTypes": null
    },
    {
      "paperId": "2e7165723cfa9543dcee6db2c1546b80d391b377",
      "title": "Wittgenstein’s Philosophy of Language The Philosophical Origins of Modern NLP Thinking",
      "authors": [
        {
          "name": "Robert Bain",
          "authorId": "153718379"
        },
        {
          "name": "Andrew Festa",
          "authorId": "2150559839"
        },
        {
          "name": "Ga Young Lee",
          "authorId": "2150561091"
        },
        {
          "name": "A. Zhang",
          "authorId": "2153659129"
        }
      ],
      "year": 2021,
      "abstract": null,
      "citationCount": 0,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/2e7165723cfa9543dcee6db2c1546b80d391b377",
      "venue": "",
      "journal": null,
      "publicationTypes": null
    },
    {
      "paperId": "20d934de51679a8095081bf93869792ef9b1d443",
      "title": "Wittgenstein as method",
      "authors": [
        {
          "name": "T. Racine",
          "authorId": "40286920"
        }
      ],
      "year": 2020,
      "abstract": "Wittgenstein was an innovative philosopher who has provoked reactions ranging from veneration to vexation to outright hostility. The so-called early Wittgenstein was influential for logical positivism; his first work, the Tractatus, was taken up as a bible of sorts; the so-called later Wittgenstein was decisive for the linguistic turn and ushered in the term “meaning as use” through his posthumously published Philosophical Investigations (2009). Although Wittgenstein’s approach to philosophy continues to have its advocates, it seems safe to say that a Wittgensteinian revolution in how philosophers are meant to do philosophy has not occurred, nor is it likely to any time soon. Are the prospects better for psychology, a discipline in which Wittgenstein seems to have had some interest but wherein his brief and characteristically elliptical remarks were more likely intended as an application of his approach to philosophy? This seems even less likely. However, the point of academic scholarship, at least in the modern academy, is typically not to engender a radical shift in the way that practitioners conduct their research and understand its purpose. But there are relevant exceptions. For example, fairly sweeping claims have been made that root social constructionist and discursive approaches to psychology in Wittgenstein’s philosophy; some even advocate for a new paradigm based on his work (e.g., Harré & Tissaw, 2005). There seems to be a tension though in using the notoriously anti-theoretical Wittgenstein to construct what are to be construed as roughly general theories, let alone metatheoretical paradigms. More modestly, Wittgenstein can be understood to offer some tools that can be of potential use in psychology chiefly for clarifying empirical and theoretical statements, avoiding unnecessary disputes, and even constructing more fruitful research. It was therefore a delight to discover that, in Wittgenstein’s Philosophy in Psychology: Interpretations and Applications in Historical Context, Sullivan addresses these more practical versus theory-heavy understandings of Wittgenstein in an ambitious attempt to explain Wittgenstein’s philosophy to and through the work of psychologists. His main goal is to defend what one could call a middle-ground position that is true to Wittgenstein’s later philosophy while at the same time showing how Wittgensteinian conceptual analytic tools can be deployed without abstracting into theory and metatheory, and allowing 874403 TAP0010.1177/0959354319874403Theory & PsychologyReview product-review2019",
      "citationCount": 0,
      "doi": "10.1177/0959354319874403",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/20d934de51679a8095081bf93869792ef9b1d443",
      "venue": "Theory & psychology",
      "journal": {
        "name": "Theory & Psychology",
        "pages": "609 - 611",
        "volume": "30"
      },
      "publicationTypes": [
        "Review"
      ]
    },
    {
      "paperId": "dacf29c4daf1335a296ca025548003f7eb0b6045",
      "title": "Davidson’s Wittgenstein",
      "authors": [
        {
          "name": "A. Hossein Khani",
          "authorId": "1661120947"
        }
      ],
      "year": 2020,
      "abstract": "Although the later Wittgenstein appears as one of the most influential figures in Davidson’s later works on meaning, it is not, for the most part, clear how Davidson interprets and employs Wittgenstein’s ideas. In this paper, I will argue that Davidson’s later works on meaning can be seen as mainly a manifestation of his attempt to accommodate the later Wittgenstein’s basic ideas about meaning and understanding, especially the requirement of drawing the seems right/is right distinction and the way this requirement must be met. These ideas, however, are interpreted by Davidson in his own way. I will then argue that Davidson even attempts to respect Wittgenstein’s quietism, provided that we understand this view in the way Davidson does. Having argued for that, I will finally investigate whether, for Davidson at least, his more theoretical and supposedly explanatory projects, such as that of constructing a formal theory of meaning and his use of the notion of triangulation, are in conflict with this Wittgensteinian quietist view.",
      "citationCount": 0,
      "doi": "10.15173/jhap.v8i5.3969",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/dacf29c4daf1335a296ca025548003f7eb0b6045",
      "venue": "Journal for the History of Analytical Philosophy",
      "journal": {
        "name": "Journal for the History of Analytical Philosophy"
      },
      "publicationTypes": null
    },
    {
      "paperId": "9e79982ea3f13a9f07125fe347b8240d92d9626e",
      "title": "Toril Moi, Revolution of the Ordinary: Literary Studies after\n Wittgenstein, Austin, and Cavell (Chicago, IL: U of Chicago P, 2017), 304\n pp.",
      "authors": [
        {
          "name": "T. Lanzendörfer",
          "authorId": "114323603"
        }
      ],
      "year": 2020,
      "abstract": "Toril Moi’s Revolution of the Ordinary: Literary Studies after Wittgenstein, Austin, and Cavell sets out to “rethink fundamental issues in literary theory in the light of the ‘ordinary’ reading” (18) of Ludwig Wittgenstein’s language philosophy—largely departing from Wittgenstein’s Philosophical Investigations, dusted with a bit of J.L. Austen (the name-drop in the title of Moi’s book is misleading), and as read by Stanley Cavell. Over the course of a brisk, ten chapter-long book, Moi takes us on a journey in three sections. In the first part, “Wittgenstein,” Moi offers a brief but lucid presentation of some of the key concepts of Wittgenstein’s language philosophy—meaning, use, language-games, grammar, and forms of life—followed by a genuinely exemplary discussion of how these concepts work against both alternative views of language and as a means of rereading what are taken to be theoretical “problems,” in this case, intersectionality. In the second part, “Differences,” she expands from these arguments to show how language philosophy exposes the problems with “theory,” which here essentially means various forms of thought connected to structuralism and poststructuralism, and outlines the limits and deficits of “critique.” And finally in the third part, “Reading,” she sets out to posit a future of literary studies in which the efforts of “theory” to generalize reading are supplanted by greater attention to the specifics of our own experience with texts, the ways in which texts act on us, and other moods of reading which may already sound familiar to readers of recent arguments in favor of postcritique.",
      "citationCount": 0,
      "doi": "10.33675/amst/2020/2/11",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/9e79982ea3f13a9f07125fe347b8240d92d9626e",
      "venue": "",
      "journal": {
        "name": "",
        "pages": "236-242",
        "volume": "65"
      },
      "publicationTypes": null
    },
    {
      "paperId": "018149de51db448e77373698dc2e9c036beeb92e",
      "title": "Wittgenstein, language and embodied cognition",
      "authors": [
        {
          "name": "Felice Cimatti",
          "authorId": "2083477585"
        }
      ],
      "year": 2020,
      "abstract": null,
      "citationCount": 0,
      "doi": "10.4396/SFL2019I3",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/018149de51db448e77373698dc2e9c036beeb92e",
      "venue": "",
      "journal": {
        "name": "",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "97a473ad958ab2b91cc45b6931fc41660bd5ef84",
      "title": "Language Acquisition: Seeing through Wittgenstein",
      "authors": [
        {
          "name": "S. Chakraborty",
          "authorId": "104383436"
        }
      ],
      "year": 2018,
      "abstract": null,
      "citationCount": 2,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/97a473ad958ab2b91cc45b6931fc41660bd5ef84",
      "venue": "",
      "journal": {
        "name": "",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "74d4a9ca87583ff68ffa1c5e7278bb94074acc7b",
      "title": "Meaningfulness, Conventions, and Rules",
      "authors": [
        {
          "name": "Indrek Reiland",
          "authorId": "51908461"
        }
      ],
      "year": 2025,
      "abstract": "\n In the middle of the 20th century, it was a common Wittgenstein-inspired idea in philosophy that languages are analogous to games and for a linguistic expression to have a meaning in a language is for it to be governed by a rule of use. However, due to the influence of David Lewis’s work it is now standard to understand meaningfulness in terms of conventional regularities in use instead (Lewis 1969, 1975).\n In this paper I will present a simplified Lewis-inspired Conventions view which embodies the basic idea and argue that it is inferior to the older Rules view. Every theory of meaningfulness in a language must yield a plausible story of what it is to speak the language, that is, of what it is to use an expression with its meaning. Those who have adopted something like the Conventions view standardly take use with meaning to consist in trying to use the expression in the conventionally regular way (Lewis 1969, Davis 2003, Loar 1981). I argue that this proposal fails since use with meaning is compatible with intentional misuses. In contrast, on the Rules view we can take use with meaning to be analogous to making a move in the game and to consist in using it while the rule is in force for one which is compatible with intentionally breaking it. And nothing structurally analogous can be found on the Conventions view without inflating it into the Rules view, which completes the case against it.",
      "citationCount": 1,
      "doi": "10.1017/apa.2024.15",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/74d4a9ca87583ff68ffa1c5e7278bb94074acc7b",
      "venue": "Journal of the American Philosophical Association",
      "journal": {
        "name": "Journal of the American Philosophical Association"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "87b40bb00fc18cbc85131d8edacae395cb9c5557",
      "title": "Bedeutung als Gebrauchsregel? : über das Scheitern einer pragmatischen Sprachtheorie",
      "authors": [
        {
          "name": "Michal Rubáš",
          "authorId": "147586738"
        }
      ],
      "year": 2025,
      "abstract": "Rudi Keller has presented an instrumental conception of the sign which defines the meaning of the linguistic sign as a 'rule of use' and which is directed against the classical theory of representation or substitution as an alternative. In doing so, he draws upon Ludwig Wittgenstein's Philosophische Untersuchungen and Ernst Tugendhat's Einführung in die sprachanalytische Philosophie. Since Tugendhat also adopts Wittgenstein´s concept of the rule of use, but, unlike Keller, uses it to elucidate the representational performance of language, I should like to discuss the relationship between these definitions of meaning (meaning as representational content vs. meaning as a rule of use) in the work of both thinkers. By doing so, I will hold that language is not initially a means of communication and that the perspective and research methods adopted from the natural sciences, as we find them in Keller's pragmatic meaning theory, are unsuitable for the human sciences. More precisely, my essay presents a) Keller's theory of meaning, b) Tugendhat's criticism of Grice's perlocutionism, c) Roman Jakobson's reasons for keeping (isolated) word-understanding and (contextual) word-utilisation apart. Finally, Joseph Levine's model example is shown in explaining d) the inapplicability of the scientific method in the field of human science.",
      "citationCount": 0,
      "doi": "10.5817/bbgn2025-1-1",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/87b40bb00fc18cbc85131d8edacae395cb9c5557",
      "venue": "Brünner Beiträge zur Germanistik und Nordistik",
      "journal": {
        "name": "Brünner Beiträge zur Germanistik und Nordistik"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "5b407672d1abc199717db408689f9b6b9e130b8b",
      "title": "Wittgensteinian Perspectives on the Concept of Grammar",
      "authors": [
        {
          "name": "Alex Cosmescu",
          "authorId": "104171930"
        }
      ],
      "year": 2025,
      "abstract": "This paper examines the meaning Ludwig Wittgenstein assigns to the concept of \"grammar\" in his late philosophy, a notion both close to and distinct from its common usage in linguistics or philology. Grammar, in his view, refers both to the project of describing the use and rules of language, and to the rules themselves. As such, grammar is the system of rules that makes meaning possible, and it is intersubjective, implicit, and non-theoretical in nature. Grammatical remarks or propositions‒unlike empirical ones ‒ do not convey new information, but clarify what is already operative in ordinary language use. Through concrete examples ‒ such as the analysis of the proposition \"I am here\" ‒ this paper shows how removing utterances from their context of use leads to philosophical confusion. From this perspective, Wittgensteinian grammar does not propose-a theory of language, but a form of recollection aimed at restoring clarity in the face of the fascination exerted by our ways of speaking.",
      "citationCount": 0,
      "doi": "10.52505/lecturi.2025.07.05",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/5b407672d1abc199717db408689f9b6b9e130b8b",
      "venue": "Lucrările conferinţei știinţifice naționale „Lecturi in memoriam acad. Silviu Berejan”",
      "journal": {
        "name": "Lucrările conferinţei știinţifice naționale „Lecturi in memoriam acad. Silviu Berejan”"
      },
      "publicationTypes": null
    },
    {
      "paperId": "14dd3ceb7b5c84b68cd32d449499050e59be7444",
      "title": "Berkeley’s Theory of Language",
      "authors": [
        {
          "name": "Kenneth L. Pearce",
          "authorId": "32120293"
        }
      ],
      "year": 2022,
      "abstract": "According to the ideational theory of meaning held by most seventeenth- and eighteenth- century European philosophers, meaningful words signify ideas in the mind of the speaker. This view was famously rejected by Berkeley. Some interpreters hold that in rejecting this view Berkeley meant merely to carve out some exceptions to the general principle that meaningful words stand for ideas. Others attribute to Berkeley the view that, rather than signifying ideas, words signify speaker intentions. Finally, some interpreters attribute to Berkeley a use theory of language similar to the later Wittgenstein. This chapter provides an overview of this interpretive debate and a defense of the use theory interpretation.",
      "citationCount": 6,
      "doi": "10.1093/oxfordhb/9780190873417.013.11",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/14dd3ceb7b5c84b68cd32d449499050e59be7444",
      "venue": "The Oxford Handbook of Berkeley",
      "journal": {
        "name": "The Oxford Handbook of Berkeley"
      },
      "publicationTypes": [
        "Review"
      ]
    },
    {
      "paperId": "d91aa93f4b62b3daba94cd6aca72bca90098de1f",
      "title": "On mathematical truth : Wittgenstein and the dissolution of Benacerraf's dilemma",
      "authors": [
        {
          "name": "A. Barco",
          "authorId": "133563178"
        }
      ],
      "year": 2018,
      "abstract": null,
      "citationCount": 0,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/d91aa93f4b62b3daba94cd6aca72bca90098de1f",
      "venue": "",
      "journal": {
        "name": "",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "734026321afa3652c123ba8ee2465171b9280162",
      "title": "Din Dilinin Doğası Üzerine Wittgenstein’a Yeniden Bakış",
      "authors": [
        {
          "name": "Kevin Kimble",
          "authorId": "2073219092"
        }
      ],
      "year": 2016,
      "abstract": null,
      "citationCount": 0,
      "doi": "10.17120/omuifd.74088",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/734026321afa3652c123ba8ee2465171b9280162",
      "venue": "",
      "journal": {
        "name": "",
        "pages": "169-191",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "696220bf6627a89b4d822dd4b998a2529d74fdfb",
      "title": "Davidson’ın Metafor Kuramı Üzerine On Davidson’s Metaphor Theory",
      "authors": [
        {
          "name": "Tuncay Turna",
          "authorId": "2175140778"
        }
      ],
      "year": 2022,
      "abstract": null,
      "citationCount": 0,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/696220bf6627a89b4d822dd4b998a2529d74fdfb",
      "venue": "",
      "journal": null,
      "publicationTypes": null
    },
    {
      "paperId": "952af0694d5b347356bdbefa085b0c01a8067849",
      "title": "Towards Formalizing Concept Drift and Its Variants: A Case Study Using Past COSIT Proceedings (Short Paper)",
      "authors": [
        {
          "name": "Meilin Shi",
          "authorId": "2113795548"
        },
        {
          "name": "Krzysztof Janowicz",
          "authorId": "2173297773"
        },
        {
          "name": "Zilong Liu",
          "authorId": "2145253061"
        },
        {
          "name": "Kitty Currier",
          "authorId": "2256211984"
        }
      ],
      "year": 2024,
      "abstract": null,
      "citationCount": 1,
      "doi": "10.4230/LIPIcs.COSIT.2024.23",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/952af0694d5b347356bdbefa085b0c01a8067849",
      "venue": "Conference On Spatial Information Theory",
      "journal": {
        "pages": "23:1-23:8"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "cddb4a2d903daebbf8c5e1c6c95bd914fa33b7d7",
      "title": "the primacy of use over naming",
      "authors": [
        {
          "name": "A. Sahu",
          "authorId": "153325165"
        }
      ],
      "year": 2019,
      "abstract": null,
      "citationCount": 0,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/cddb4a2d903daebbf8c5e1c6c95bd914fa33b7d7",
      "venue": "",
      "journal": null,
      "publicationTypes": null
    }
  ],
  "count": 30,
  "errors": []
}
