{
  "status": "success",
  "source": "semantic_scholar",
  "query": "use-based semantics teleosemantics",
  "results": [
    {
      "paperId": "dcc59d225b77f729487ae7ec8a122e3c93bf921d",
      "title": "Ranking-based Semantics for Assumption-based Argumentation",
      "authors": [
        {
          "name": "K. Skiba",
          "authorId": "1753623996"
        },
        {
          "name": "Matthias Thimm",
          "authorId": "2267503234"
        },
        {
          "name": "J. Wallner",
          "authorId": "33553295"
        }
      ],
      "year": 2023,
      "abstract": null,
      "citationCount": 3,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/dcc59d225b77f729487ae7ec8a122e3c93bf921d",
      "venue": "FCR@KI",
      "journal": {
        "pages": "44-52"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "78ed0da03b60faf3194cd77b23b5756c9fcfa00c",
      "title": "When to Use Counterfactuals in Causal Historiography: Methods for Semantics and Inference",
      "authors": [
        {
          "name": "Tay Jeong",
          "authorId": "121783146"
        }
      ],
      "year": 2025,
      "abstract": "According to the interventionist framework of actual causality, causal claims in history are ultimately claims about special types of functional dependencies between variables, which consist not only of actual events but also of corresponding counterfactual states of affairs. Instead of advocating the methodological use of counterfactuals tout court, we propose specific circumstances in historical writing where counterfactual reasoning comes in most handy. At the level of semantics, that is, the specification of the variables and their possible values, an explicit specification of the latent contrast classes becomes particularly useful in situations where one may be prompted to take an event that is pre-empted by the antecedent of interest as its proper causal contrast. At the level of inference, we argue that cases in which two or more antecedents appear to be playing a similar role tend to fumble our pretheoretical intuition about cause and propose a sequence of counterfactual tests based on actual examples from causal historiography.",
      "citationCount": 0,
      "doi": "10.1177/00491241251314039",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/78ed0da03b60faf3194cd77b23b5756c9fcfa00c",
      "venue": "Sociological Methods &amp; Research",
      "journal": {
        "name": "Sociological Methods &amp; Research"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "8a9b447df774f2e985432daa368d6ae2bd5d4044",
      "title": "On Gradual Semantics for Assumption-Based Argumentation",
      "authors": [
        {
          "name": "Anna Rapberger",
          "authorId": "1394218378"
        },
        {
          "name": "Fabrizio Russo",
          "authorId": "2154616820"
        },
        {
          "name": "Antonio Rago",
          "authorId": "1911563"
        },
        {
          "name": "Francesca Toni",
          "authorId": "2276429977"
        }
      ],
      "year": 2025,
      "abstract": "In computational argumentation, gradual semantics are fine-grained alternatives to extension-based and labelling-based semantics. They ascribe a dialectical strength to (components of) arguments sanctioning their degree of acceptability. Several gradual semantics have been studied for abstract, bipolar and quantitative bipolar argumentation frameworks (QBAFs), as well as, to a lesser extent, for some forms of structured argumentation. However, this has not been the case for assumption-based argumentation (ABA), despite it being a popular form of structured argumentation with several applications where gradual semantics could be useful. In this paper, we fill this gap and propose a family of novel gradual semantics for equipping assumptions, which are the core components in ABA frameworks, with dialectical strengths. To do so, we use bipolar set-based argumentation frameworks as an abstraction of (potentially non-flat) ABA frameworks and generalise state-of-the-art modular gradual semantics for QBAFs. We show that our gradual ABA semantics satisfy suitable adaptations of desirable properties of gradual QBAF semantics, such as balance and monotonicity. We also explore an argument-based approach that leverages established QBAF modular semantics directly, and use it as baseline. Finally, we conduct experiments with synthetic ABA frameworks to compare our gradual ABA semantics with its argument-based counterpart and assess convergence.",
      "citationCount": 0,
      "doi": "10.48550/arXiv.2507.10076",
      "arxivId": "2507.10076",
      "url": "https://www.semanticscholar.org/paper/8a9b447df774f2e985432daa368d6ae2bd5d4044",
      "venue": "Proceedings of the TwentySecond International Conference on Principles of Knowledge Representation and Reasoning",
      "journal": {
        "name": "ArXiv",
        "volume": "abs/2507.10076"
      },
      "publicationTypes": [
        "JournalArticle",
        "Conference"
      ]
    },
    {
      "paperId": "e5d63fba5713726365525bbced861bb6f841074d",
      "title": "An Extension-Based Argument-Ranking Semantics: Social Rankings in Abstract Argumentation",
      "authors": [
        {
          "name": "Lars Bengel",
          "authorId": "2138492494"
        },
        {
          "name": "Giovanni Buraglio",
          "authorId": "2332751476"
        },
        {
          "name": "Jan Maly",
          "authorId": "2332753053"
        },
        {
          "name": "Kenneth Skiba",
          "authorId": "2332749290"
        }
      ],
      "year": 2024,
      "abstract": "In this paper, we introduce a new family of argument-ranking semantics which can be seen as a refinement of the classification of arguments into skeptically accepted, credulously accepted and rejected. To this end we use so-called social ranking functions which have been developed recently to rank individuals based on their performance in groups. We provide necessary and sufficient conditions for a social ranking function to give rise to an argument-ranking semantics satisfying the desired refinement property.",
      "citationCount": 2,
      "doi": "10.48550/arXiv.2412.13632",
      "arxivId": "2412.13632",
      "url": "https://www.semanticscholar.org/paper/e5d63fba5713726365525bbced861bb6f841074d",
      "venue": "Non-Monotonic Reasoning",
      "journal": {
        "name": "ArXiv",
        "volume": "abs/2412.13632"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "29d036f3c0e716d0c7e1f7c4b45bd0a23149372e",
      "title": "A Principle-based Account of Self-attacking Arguments in Gradual Semantics",
      "authors": [
        {
          "name": "Vivien Beuselinck",
          "authorId": "2133339892"
        },
        {
          "name": "Jérôme Delobelle",
          "authorId": "3342856"
        },
        {
          "name": "Srdjan Vesic",
          "authorId": "1754782"
        }
      ],
      "year": 2023,
      "abstract": null,
      "citationCount": 5,
      "doi": "10.1093/logcom/exac093",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/29d036f3c0e716d0c7e1f7c4b45bd0a23149372e",
      "venue": "Journal of Logic and Computation",
      "journal": {
        "name": "J. Log. Comput.",
        "pages": "230-256",
        "volume": "33"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "20c43f23c4d14c27514230632fa414e6a65b64cd",
      "title": "Semantic Evolution of the Word Nafs in the Qur'an Based on Contextual Semantics and the Qur'anic Worldview",
      "authors": [
        {
          "name": "Muhammad Yusuf Zakaria",
          "authorId": "2356156262"
        },
        {
          "name": "Kharis Nugroho",
          "authorId": "2348968826"
        }
      ],
      "year": 2025,
      "abstract": "This study aims to analyze the meaning of the term nafs in the Qur'an using a contextual semantic, syntagmatic, and paradigmatic approach, while also connecting it to the Qur'anic worldview. The research focuses on uncovering the semantic complexity of nafs in three main domains: self-identity, psychological aspects, and spiritual dimensions. A qualitative research method is applied, utilizing primary data from Qur'anic verses containing the term nafs and secondary data from classical exegetical literature, such as Mufradat Alfadh al-Qur'an and Lisan al-Arab. The data is analyzed through syntagmatic analysis to understand the relationship of nafs within the structure of verses and paradigmatic analysis to compare it with other terms such as ruh and qalb. The results reveal that the term nafs exhibits a diverse distribution of meanings in the Qur'an, covering three primary themes: self-identity (112 verses), psychological aspects (98 verses), and spiritual dimensions (85 verses). Syntagmatic and paradigmatic relations enhance contextual understanding, while the analysis of the Qur'anic worldview highlights the central role of nafs in theological, anthropological, and eschatological domains. This study makes a significant contribution to Qur'anic semantics, modern exegesis, and the translation of religious texts. In conclusion, this research integrates classical and contemporary approaches to enrich the understanding of the meaning of nafs in the Qur'an. Further studies are recommended to expand the exploration of this term in other Islamic textual corpora and employ natural language processing technologies for advanced analyses.",
      "citationCount": 0,
      "doi": "10.23917/iseth.5470",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/20c43f23c4d14c27514230632fa414e6a65b64cd",
      "venue": "Proceeding ISETH (International Summit on Science, Technology, and Humanity)",
      "journal": {
        "name": "Proceeding ISETH (International Summit on Science, Technology, and Humanity)"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "03d052321759db0feecc9177a09fd8bb735b7375",
      "title": "Logic-Based Artificial Intelligence Algorithms Supporting Categorical Semantics",
      "authors": [
        {
          "name": "Ralph Wojtowicz",
          "authorId": "2357967298"
        }
      ],
      "year": 2025,
      "abstract": "This paper seeks to apply categorical logic to the design of artificial intelligent agents that reason symbolically about objects more richly structured than sets. Using Johnstone's sequent calculus of terms- and formulae-in-context, we develop forward chaining and normal form algorithms for reasoning about objects in cartesian categories with the rules for Horn logic. We also adapt first-order unification to support multi-sorted theories, contexts, and fragments of first-order logic. The significance of these reformulations rests in the fact that they can be applied to reasoning about objects in semantic categories that do not support classical logic or even all its connectives.",
      "citationCount": 0,
      "doi": "10.48550/arXiv.2504.19320",
      "arxivId": "2504.19320",
      "url": "https://www.semanticscholar.org/paper/03d052321759db0feecc9177a09fd8bb735b7375",
      "venue": "arXiv.org",
      "journal": {
        "name": "ArXiv",
        "volume": "abs/2504.19320"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "f43ed589d44569a021f9693fd3075e4217fb167b",
      "title": "Probabilistic epistemic logic based on neighborhood semantics",
      "authors": [
        {
          "name": "Yixin Pan",
          "authorId": "2297815099"
        },
        {
          "name": "Meiyun Guo",
          "authorId": "2298266696"
        }
      ],
      "year": 2024,
      "abstract": null,
      "citationCount": 1,
      "doi": "10.1007/s11229-024-04557-4",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/f43ed589d44569a021f9693fd3075e4217fb167b",
      "venue": "Synthese",
      "journal": {
        "name": "Synthese",
        "volume": "203"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "46b8a5ac8305878a39ffa8f27754785bceab95d7",
      "title": "Outlook-based semantics",
      "authors": [
        {
          "name": "E. Coppock",
          "authorId": "3009498"
        }
      ],
      "year": 2018,
      "abstract": null,
      "citationCount": 48,
      "doi": "10.1007/S10988-017-9222-Y",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/46b8a5ac8305878a39ffa8f27754785bceab95d7",
      "venue": "",
      "journal": {
        "name": "Linguistics and Philosophy",
        "pages": "125-164",
        "volume": "41"
      },
      "publicationTypes": null
    },
    {
      "paperId": "96e208d0817129d6eff81edec60562f4dade7213",
      "title": "Discrete and Probabilistic Classifier-based Semantics",
      "authors": [
        {
          "name": "S. Larsson",
          "authorId": "50707664"
        }
      ],
      "year": 2020,
      "abstract": null,
      "citationCount": 9,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/96e208d0817129d6eff81edec60562f4dade7213",
      "venue": "Passive and Active Network Measurement Conference",
      "journal": null,
      "publicationTypes": [
        "Conference"
      ]
    },
    {
      "paperId": "282d23285a8be8b6b96274565f46ea793d136c59",
      "title": "Exploring Argumentation Based Semantics for Relevance Logic (Abstract)",
      "authors": [
        {
          "name": "C. Fermüller",
          "authorId": "3167986"
        }
      ],
      "year": 2018,
      "abstract": null,
      "citationCount": 0,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/282d23285a8be8b6b96274565f46ea793d136c59",
      "venue": "",
      "journal": null,
      "publicationTypes": null
    },
    {
      "paperId": "34a8f34b1a6d2f47338eb97a126b0bc66c1f8640",
      "title": "Changing the Semantics of Author Terms Based on Scientific and Artistic Texts on the Example of the Term \"Happening\"",
      "authors": [
        {
          "name": "A. A. Kosarina",
          "authorId": "2139939552"
        }
      ],
      "year": 2023,
      "abstract": "\n The subject of the study is the concept of the author's term, its definition is given, and the etymological, semantic and pragmatic criteria for the allocation of the author's term are also highlighted. Using the term Happening as an example, the use of the author's term in professional and non-professional discourse is considered. The article examines the definition given by the author of the term Alan Kaprow, and the evolution of his understanding of the term Happening. The semantics of the term and its changes in the works of various artists of the 1950s - 1960s, as representatives of professional discourse, and in works of art of the 1960s - 2010s, representing non-professional discourse, are studied. Common features of the use of the term Happening in professional and non-professional discourses are highlighted. The main conclusions of the study are the following positions: the term Happening can be considered copyright, since its author is known, the author's sema is key to the semantics of the term, and professionals using it associate the concept with its creator. In professional discourse, the term is used in a direct terminological meaning. In non-professional discourse, the term loses part of this, acquiring others; in particular, the author's sema is lost, and the term no longer meets the criteria of the author's term. The novelty of the research lies in the appeal to the use of the English-language author's term in professional and non-professional discourse.\n",
      "citationCount": 0,
      "doi": "10.25136/2409-8698.2023.3.39711",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/34a8f34b1a6d2f47338eb97a126b0bc66c1f8640",
      "venue": "Litera",
      "journal": {
        "name": "Litera"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "cb756faab3b8e4da29658137361c2a8412388393",
      "title": "A novel problem for the likelihood-based semantics of even",
      "authors": [
        {
          "name": "Yael Greenberg",
          "authorId": "50239635"
        }
      ],
      "year": 2016,
      "abstract": "This paper describes and examines novel data which is problematic for the popular view that the scale in the scalar presupposition of even is based on comparative (un)likelihood or probability. Several theories in the past attacked this characterization of the scale by pointing out examples where even is felicitous although the likelihood-based presupposition does not seem to be met, indicating that the comparative unlikelihood of p is not a necessary condition for a felicitous use of even p . In contrast to these theories, this paper examines novel data where even is in felicitous although the likelihood-based presupposition is met, indicating that the comparative unlikelihood of p is not a sufficient condition for a felicitous use of even p . \nIn particular, I look at the unexpected infelicity of even p in the context of a salient p or q alternative. I examine, and reject, several potential objections to the claim that such sentences pose a problem for the likelihood-based approach to even and conclude that the novel data constitute a real challenge for this popular approach to even . \n \nhttp://dx.doi.org/10.3765/sp.9.2 \n \n BibTeX info",
      "citationCount": 18,
      "doi": "10.3765/SP.9.2",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/cb756faab3b8e4da29658137361c2a8412388393",
      "venue": "",
      "journal": {
        "name": "Semantics and Pragmatics",
        "volume": "9"
      },
      "publicationTypes": null
    },
    {
      "paperId": "be52d1c5036f1076ce171d755378eec5bcd2e637",
      "title": "Preliminary Report on Complexity Analysis of Extension–Based Semantics of Abstract Dialectical Frameworks",
      "authors": [
        {
          "name": "Sylwia Polberg",
          "authorId": "2583269"
        },
        {
          "name": "J. Wallner",
          "authorId": "33553295"
        }
      ],
      "year": 2017,
      "abstract": null,
      "citationCount": 1,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/be52d1c5036f1076ce171d755378eec5bcd2e637",
      "venue": "",
      "journal": null,
      "publicationTypes": null
    },
    {
      "paperId": "00261683080817049d58a7de5fe754e58b78308e",
      "title": "Outlook-based semantics",
      "authors": [
        {
          "name": "E. Coppock",
          "authorId": "3009498"
        }
      ],
      "year": 2017,
      "abstract": null,
      "citationCount": 0,
      "doi": "10.1007/s10988-017-9222-y",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/00261683080817049d58a7de5fe754e58b78308e",
      "venue": "Linguistics and Philosophy",
      "journal": {
        "name": "Linguistics and Philosophy",
        "pages": "125 - 164",
        "volume": "41"
      },
      "publicationTypes": null
    },
    {
      "paperId": "351b23a913e105822f91bc601aef50259f15ecae",
      "title": "A note on the semantics of linear regression",
      "authors": [
        {
          "name": "Raja Panjwani",
          "authorId": "2344297284"
        }
      ],
      "year": 2025,
      "abstract": null,
      "citationCount": 1,
      "doi": "10.1007/s11229-024-04904-5",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/351b23a913e105822f91bc601aef50259f15ecae",
      "venue": "Synthese",
      "journal": {
        "name": "Synthese",
        "volume": "205"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "157a7e40ef16132e3f0f22e323190d62cced3679",
      "title": "Neurosymbolic Deep Learning Semantics",
      "authors": [
        {
          "name": "A. D. Garcez",
          "authorId": "2339271654"
        },
        {
          "name": "S. Odense",
          "authorId": "2235577"
        }
      ],
      "year": 2025,
      "abstract": "Artificial Intelligence (AI) is a powerful new language of science as evidenced by recent Nobel Prizes in chemistry and physics that recognized contributions to AI applied to those areas. Yet, this new language lacks semantics, which makes AI's scientific discoveries unsatisfactory at best. With the purpose of uncovering new facts but also improving our understanding of the world, AI-based science requires formalization through a framework capable of translating insight into comprehensible scientific knowledge. In this paper, we argue that logic offers an adequate framework. In particular, we use logic in a neurosymbolic framework to offer a much needed semantics for deep learning, the neural network-based technology of current AI. Deep learning and neurosymbolic AI lack a general set of conditions to ensure that desirable properties are satisfied. Instead, there is a plethora of encoding and knowledge extraction approaches designed for particular cases. To rectify this, we introduced a framework for semantic encoding, making explicit the mapping between neural networks and logic, and characterizing the common ingredients of the various existing approaches. In this paper, we describe succinctly and exemplify how logical semantics and neural networks are linked through this framework, we review some of the most prominent approaches and techniques developed for neural encoding and knowledge extraction, provide a formal definition of our framework, and discuss some of the difficulties of identifying a semantic encoding in practice in light of analogous problems in the philosophy of mind.",
      "citationCount": 0,
      "doi": "10.48550/arXiv.2511.02825",
      "arxivId": "2511.02825",
      "url": "https://www.semanticscholar.org/paper/157a7e40ef16132e3f0f22e323190d62cced3679",
      "venue": "arXiv.org",
      "journal": {
        "name": "ArXiv",
        "volume": "abs/2511.02825"
      },
      "publicationTypes": [
        "JournalArticle",
        "Review"
      ]
    },
    {
      "paperId": "9a035a90960f32c668f8d121b48ddbbd6c7811fe",
      "title": "Revisiting the Foundations of Abstract Argumentation - Semantics Based on Weak Admissibility and Weak Defense",
      "authors": [
        {
          "name": "Ringo Baumann",
          "authorId": "40491206"
        },
        {
          "name": "G. Brewka",
          "authorId": "1681333"
        },
        {
          "name": "Markus Ulbricht",
          "authorId": "2065999557"
        }
      ],
      "year": 2020,
      "abstract": "In his seminal 1995 paper, Dung paved the way for abstract argumentation, a by now major research area in knowledge representation. He pointed out that there is a problematic issue with self-defeating arguments underlying all traditional semantics. A self-defeat occurs if an argument attacks itself either directly or indirectly via an odd attack loop, unless the loop is broken up by some argument attacking the loop from outside. Motivated by the fact that such arguments represent self-contradictory or paradoxical arguments, he asked for reasonable semantics which overcome the problem that such arguments may indeed invalidate any argument they attack. This paper tackles this problem from scratch. More precisely, instead of continuing to use previous concepts defined by Dung we provide new foundations for abstract argumentation, so-called weak admissibility and weak defense. After showing that these key concepts are compatible as in the classical case we introduce new versions of the classical Dung-style semantics including complete, preferred and grounded semantics. We provide a rigorous study of these new concepts including interrelationships as well as the relations to their Dung-style counterparts. The newly introduced semantics overcome the issue with self-defeating arguments, and they are semantically insensitive to syntactic deletions of self-attacking arguments, a special case of self-defeat.",
      "citationCount": 51,
      "doi": "10.1609/AAAI.V34I03.5661",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/9a035a90960f32c668f8d121b48ddbbd6c7811fe",
      "venue": "AAAI Conference on Artificial Intelligence",
      "journal": {
        "pages": "2742-2749"
      },
      "publicationTypes": [
        "JournalArticle",
        "Conference"
      ]
    },
    {
      "paperId": "c19c48efb0945a7e2609beb2f2bb465e8a1818fe",
      "title": "Revisiting Extension – Based Semantics of Abstract Dialectical Frameworks",
      "authors": [
        {
          "name": "Sylwia Polberg",
          "authorId": "2583269"
        }
      ],
      "year": 2015,
      "abstract": null,
      "citationCount": 4,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/c19c48efb0945a7e2609beb2f2bb465e8a1818fe",
      "venue": "",
      "journal": null,
      "publicationTypes": null
    },
    {
      "paperId": "1f4c61a1238207a72d9231bcf20f850bd85481b2",
      "title": "Extension-Based Semantics of Abstract Dialectical Frameworks",
      "authors": [
        {
          "name": "Sylwia Polberg",
          "authorId": "2583269"
        }
      ],
      "year": 2014,
      "abstract": "One of the most prominent tools for abstract argumentation is the Dung's framework, AF for short. It is accompanied by a variety of semantics including grounded, complete, preferred and stable. Although powerful, AFs have their shortcomings, which led to development of numerous enrichments. Among the most general ones are the abstract dialectical frameworks, also known as the ADFs. They make use of the so-called acceptance conditions to represent arbitrary relations. This level of abstraction brings not only new challenges, but also requires addressing existing problems in the field. One of the most controversial issues, recognized not only in argumentation, concerns the support cycles. In this paper we introduce a new method to ensure acyclicity of the chosen arguments and present a family of extension-based semantics built on it. We also continue our research on the semantics that permit cycles and fill in the gaps from the previous works. Moreover, we provide ADF versions of the properties known from the Dung setting. Finally, we also introduce a classification of the developed sub-semantics and relate them to the existing labeling-based approaches.",
      "citationCount": 16,
      "doi": "10.3233/978-1-61499-421-3-240",
      "arxivId": "1405.0406",
      "url": "https://www.semanticscholar.org/paper/1f4c61a1238207a72d9231bcf20f850bd85481b2",
      "venue": "Starting AI Researchers' Symposium",
      "journal": {
        "name": "ArXiv",
        "volume": "abs/1405.0406"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "ed378d2b5d09d4fbb72acb56b9b2c76057cee215",
      "title": "Base-extension Semantics for Modal Logic",
      "authors": [
        {
          "name": "Timo Eckhardt",
          "authorId": "2280907095"
        },
        {
          "name": "D. Pym",
          "authorId": "1749654"
        }
      ],
      "year": 2024,
      "abstract": "\n In proof-theoretic semantics, meaning is based on inference. It may seen as the mathematical expression of the inferentialist interpretation of logic. Much recent work has focused on base-extension semantics, in which the validity of formulas is given by an inductive definition generated by provability in a ‘base’ of atomic rules. Base-extension semantics for classical and intuitionistic propositional logic have been explored by several authors. In this paper, we develop base-extension semantics for the classical propositional modal systems $K$, $KT$, $K4$ and $S4$, with $\\square $ as the primary modal operator. We establish appropriate soundness and completeness theorems and establish the duality between $\\square $ and a natural presentation of $\\lozenge $. We also show that our semantics is in its current form not complete with respect to euclidean modal logics. Our formulation makes essential use of relational structures on bases.",
      "citationCount": 9,
      "doi": "10.48550/arXiv.2401.13597",
      "arxivId": "2401.13597",
      "url": "https://www.semanticscholar.org/paper/ed378d2b5d09d4fbb72acb56b9b2c76057cee215",
      "venue": "Logic Journal of the IGPL",
      "journal": {
        "name": "ArXiv",
        "volume": "abs/2401.13597"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "8a3a9482856fabe02e8df66d5bf95f1faaf60e74",
      "title": "Base-extension semantics for S5 modal logic",
      "authors": [
        {
          "name": "Timo Eckhardt",
          "authorId": "2280907095"
        },
        {
          "name": "David J. Pym",
          "authorId": "2293720146"
        }
      ],
      "year": 2024,
      "abstract": "We develop a proof-theoretic semantics -- in particular, a base-extension semantics -- for multi-agent S5 modal logic (and hence also for the usual unindexed S5). Following the inferentialist interpretation of logic, this gives us a semantics in which validity is based on proof rather than truth. In base-extension semantics, the validity of formulae is generated by provability in a `base' of atomic rules and an inductive definition of the validity of the connectives. Base-extension semantics for many interesting logics has been explored by several authors and, in particular, a base-extension semantics for the modal logics K, KT, K4, and S4 has been developed by the present authors. Here, we give a base-extension semantics for multi-agent S5 with $\\square_a$, for an agent a, as our primary operators, framed as the knowledge operator K_a. Similarly to Kripke semantics, we make use of relational structure between bases, allowing us to establish a correspondence between certain bases and worlds. We use this to establish the appropriate soundness and completeness results. We conclude by discussing how this semantics can be extended to Dynamic Epistemic Logics (DEL) starting with Public Announcement Logic (PAL).",
      "citationCount": 6,
      "doi": "10.1093/jigpal/jzae131",
      "arxivId": "2403.19431",
      "url": "https://www.semanticscholar.org/paper/8a3a9482856fabe02e8df66d5bf95f1faaf60e74",
      "venue": "Logic Journal of the IGPL",
      "journal": {
        "name": "Log. J. IGPL",
        "volume": "33"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "08b5067875c209a9b1deb7fe877edc7b06588f21",
      "title": "Inferentialist Resource Semantics",
      "authors": [
        {
          "name": "A. Gheorghiu",
          "authorId": "1998518964"
        },
        {
          "name": "Tao Gu",
          "authorId": "2268494093"
        },
        {
          "name": "D. Pym",
          "authorId": "1749654"
        }
      ],
      "year": 2024,
      "abstract": "In systems modelling, a 'system' typically comprises located resources relative to which processes execute. One important use of logic in informatics is in modelling such systems for the purpose of reasoning (perhaps automated) about their behaviour and properties. To this end, one requires an interpretation of logical formulae in terms of the resources and states of the system; such an interpretation is called a 'resource semantics' of the logic. This paper shows how inferentialism -- the view that meaning is given in terms of inferential behaviour -- enables a versatile and expressive framework for resource semantics. Specifically, how inferentialism seamlessly incorporates the assertion-based approach of the logic of Bunched Implications, foundational in program verification (e.g., as the basis of Separation Logic), and the renowned number-of-uses reading of Linear Logic. This integration enables reasoning about shared and separated resources in intuitive and familiar ways, as well as about the composition and interfacing of system components.",
      "citationCount": 3,
      "doi": "10.46298/entics.14727",
      "arxivId": "2402.09217",
      "url": "https://www.semanticscholar.org/paper/08b5067875c209a9b1deb7fe877edc7b06588f21",
      "venue": "Electronic Notes in Theoretical Informatics and Computer Science",
      "journal": {
        "name": "ArXiv",
        "volume": "abs/2402.09217"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "bfc8269e1388cfd04413e18e8ceb529c5a2d1aa5",
      "title": "Base-extension Semantics for Intuitionistic Modal Logics",
      "authors": [
        {
          "name": "Yll Buzoku",
          "authorId": "2282539409"
        },
        {
          "name": "David J. Pym",
          "authorId": "2293720146"
        }
      ],
      "year": 2025,
      "abstract": "The proof theory and semantics of intuitionistic modal logics have been studied by Simpson in terms of Prawitz-style labelled natural deduction systems and Kripke models. An alternative to model-theoretic semantics is provided by proof-theoretic semantics, which is a logical realization of inferentialism, in which the meaning of constructs is understood through their use. The key idea in proof-theoretic semantics is that of a base of atomic rules, all of which refer only to propositional atoms and involve no logical connectives. A specific form of proof-theoretic semantics, known as base-extension semantics (B-eS), is concerned with the validity of formulae and provides a direct counterpart to Kripke models that is grounded in the provability of atomic formulae in a base. We establish, systematically, B-eS for Simpson's intuitionistic modal logics and, also systematically, obtain soundness and completeness theorems with respect to Simpson's natural deduction systems.",
      "citationCount": 1,
      "doi": "10.48550/arXiv.2507.06834",
      "arxivId": "2507.06834",
      "url": "https://www.semanticscholar.org/paper/bfc8269e1388cfd04413e18e8ceb529c5a2d1aa5",
      "venue": "International Conference on Theorem Proving with Analytic Tableaux and Related Methods",
      "journal": {
        "pages": "318-334"
      },
      "publicationTypes": [
        "JournalArticle",
        "Conference"
      ]
    },
    {
      "paperId": "e7f9d2e6596d68508e62527a2378f38f0b40bca8",
      "title": "New Foundations (Natural Language as a Complex System, or New Foundations for Philosophical Semantics, Epistemology and Metaphysics, Based on the Process-Socio-Environmental Conception of Linguistic Meaning and Knowledge)",
      "authors": [
        {
          "name": "Gustavo Picazo",
          "authorId": "104507601"
        }
      ],
      "year": 2021,
      "abstract": null,
      "citationCount": 1,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/e7f9d2e6596d68508e62527a2378f38f0b40bca8",
      "venue": "",
      "journal": null,
      "publicationTypes": [
        "Review"
      ]
    },
    {
      "paperId": "fd80a2aeb34dbc608657c9734d6b89365b77e2ed",
      "title": "Message-Based Logic Semantics and Intentional Linguistic Semantics of Paul Grice.",
      "authors": [
        {
          "name": "Yaroslav Petik",
          "authorId": "2023833168"
        }
      ],
      "year": 2022,
      "abstract": "The paper considers new logical semantics for the classic propositional logic which states that a propositional formula refers to a special structure – “the tree of messages”. This tree of message determines the truth values for the elements of the propositional formula. The source of inspiration for creating a concept of such semantics is a philosophical-linguistic program advanced by H.P. Grice. Grice made a hypothesis according to which the meaning of the speech act is defined more by speaker’s intention than by the “conventional” meaning of utterances. A speaker may have hidden intentions towards his speech act – he is manipulating his audience for political or economic aims, for example. Thus, the true meaning of the utterance the speaker uses may even contradict the “conventional” meanings of those expressions. As a consequence, to understand the true meaning of those utterances you should take the speaker's true intentions into consideration. A message is a textual expression of such intentions. In general, messages can express different meta-rules which specify the context for the propositional formula which refers to the “tree”. Messages can cooperate between each other as well as with the messages from different trees creating specific kinds of “algebras”. By specifying these “algebras” the variety of different alternative propositional logics based on this semantics can be created. By interpreting messages and accordingly modifying the truth values of propositional formulas the situation described by Grice can be emulated. However, it should be admitted that the idea of such logical semantics is wider than just an emulation of the particular linguistic theory.",
      "citationCount": 1,
      "doi": "10.23939/shv2022.01.019",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/fd80a2aeb34dbc608657c9734d6b89365b77e2ed",
      "venue": "Humanitarian vision",
      "journal": {
        "name": "Humanitarian vision"
      },
      "publicationTypes": null
    },
    {
      "paperId": "4a09410ad97fc77fd69d68d407caa3695dbb6bfe",
      "title": "Modus Ethical Categories as a Condition for the Emergence of Phraseological Semantics, their Application in Political Discourse",
      "authors": [
        {
          "name": "Klara Abisheva",
          "authorId": "2332659230"
        },
        {
          "name": "M. Akosheva",
          "authorId": "116878919"
        },
        {
          "name": "G. Ayupova",
          "authorId": "2304201524"
        },
        {
          "name": "A. Nurgazina",
          "authorId": "2204400920"
        },
        {
          "name": "B. Ayapbergenov",
          "authorId": "2373943808"
        },
        {
          "name": "Assel Baikadamova",
          "authorId": "2266669627"
        }
      ],
      "year": 2024,
      "abstract": "This article presents the results of a study of the formation processes of phraseological meanings considering cognitive-discursive conditions. Traditional and new (cognitive) approaches to the formation of phraseological semantics are analysed, and a method for the formation of phraseological meaning is proposed, namely the use of cognitive-discursive categories of state-mode. Modal categories contribute to a new moral and evaluative aspect of meaning. The research focuses on the representation of phraseological meanings in the formats of knowledge, concepts and ethical categories. The study aims to examine a new way of forming phraseological meanings based on the study of modus categories as a cognitive-discursive condition, as well as evaluative categorisation and the presentation of phraseological ethical knowledge in cognitive knowledge formats. An integrative methodological paradigm and a cognitive-semantic approach were applied in the study.   Cognitive semantics offers new principles for analysing phraseological units: equality of cognitive and communicative functions of language, interdisciplinarity, multifactoriality, anthropocentricity and multilevelness. When using them, phraseological units can be studied integratively, involving knowledge and methods from various sciences. Methods of modelling, contextual inference, evaluative categorisation, interpretation, cognitive-discursive analysis and associative experiment were also used. The study analyses various points of view on the nature of phraseological semantics, the cognitive-discursive and anthropological essence of phraseological meaning, and the possibility of phraseological units acting as knowledge formats.  The novelty of the work lies in the application of an integrative methodological paradigm based on cognitive-semantic and cognitive-discursive approaches, with an emphasis on the role of modus categories and evaluative categorisation in the formation of phraseological evaluative meaning in identifying the formats of phraseological knowledge, in applying a modus approach to the analysis of phraseological meanings.",
      "citationCount": 1,
      "doi": "10.20896/saci.v12i3.1520",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/4a09410ad97fc77fd69d68d407caa3695dbb6bfe",
      "venue": "Space and Culture, India",
      "journal": {
        "name": "Space and Culture, India"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "b8f4ec29b874ad85ce628e1f06fb9f555e365d77",
      "title": "Proof-theoretic Semantics for Second-order Logic",
      "authors": [
        {
          "name": "A. Gheorghiu",
          "authorId": "1998518964"
        },
        {
          "name": "David J. Pym",
          "authorId": "2293720146"
        }
      ],
      "year": 2025,
      "abstract": "We develop a proof-theoretic semantics (P-tS) for second-order logic (S-oL), providing an inferentialist alternative to both full and Henkin model-theoretic interpretations. Our approach is grounded in base-extension semantics (B-eS), a framework in which meaning is determined by inferential roles relative to atomic systems -- collections of rules that encode an agent's pre-logical inferential commitments. We show how both classical and intuitionistic versions of S-oL emerge from this set-up by varying the class of atomic systems. These systems yield modular soundness and completeness results for corresponding Hilbert-style calculi, which we prove equivalent to Henkin's account of S-oL. In doing so, we reframe second-order quantification as systematic substitution rather than set-theoretic commitment, thereby offering a philosophically lightweight yet expressive semantics for higher-order logic. This work contributes to the broader programme of grounding logical meaning in use rather than reference and offers a new lens on the foundations of logic and mathematics.",
      "citationCount": 0,
      "doi": "10.48550/arXiv.2508.07786",
      "arxivId": "2508.07786",
      "url": "https://www.semanticscholar.org/paper/b8f4ec29b874ad85ce628e1f06fb9f555e365d77",
      "venue": "arXiv.org",
      "journal": {
        "name": "ArXiv",
        "volume": "abs/2508.07786"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "9bfef365448f9f5667f788962664e66479127e81",
      "title": "The Dilemma of Ahistorical Teleosemantics",
      "authors": [
        {
          "name": "F. Hundertmark",
          "authorId": "1936727"
        }
      ],
      "year": 2023,
      "abstract": "Abstract Teleosemantic theories aim to naturalize mental representation through the use of functions, typically based on past selection processes. However, the historical dependence of these theories has faced severe criticism, leading some philosophers to develop ahistorical alternatives. This article presents a new dilemma for all ahistorical teleosemantic theories, focusing in particular on the theories proposed by Timothy Schroeder and Bence Nanay. These theories require certain dispositions in the producers or consumers of mental representations, but the appeal to dispositions puts the proponents in an undesirable position: mental content is either overly dependent on current circumstances or ultimately dependent on historical factors.",
      "citationCount": 1,
      "doi": "10.1017/psa.2023.98",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/9bfef365448f9f5667f788962664e66479127e81",
      "venue": "Philosophia Scientiæ",
      "journal": {
        "name": "Philosophy of Science",
        "pages": "58 - 71",
        "volume": "91"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "d4d8bc045dc30a11029efe483fdfe90aa4b2dcab",
      "title": "On an inferential semantics for intuitionistic sentential logic",
      "authors": [
        {
          "name": "A. Gheorghiu",
          "authorId": "1998518964"
        }
      ],
      "year": 2025,
      "abstract": "\n Sandqvist’s base-extension semantics (B-eS) for intuitionistic sentential logic grounds meaning relative to bases (rather than, say, models), which are arbitrary sets of permitted inferences over sentences. While his soundness proof is standard, his completeness proof is quite unusual. It closely parallels a method introduced much earlier by Mints, who developed a resolution-based approach to intuitionistic logic using a systematic translation of formulas into sentential counterparts. In this short note, we highlight the connection between these two approaches and show that the soundness and completeness of B-eS follow directly from Mints’ theorem. While the result is modest, it reinforces the relevance of proof-search to proof-theoretic semantics and suggests that resolution methods have a deeper conceptual role in constructive reasoning than is often acknowledged.",
      "citationCount": 1,
      "doi": "10.1093/logcom/exaf029",
      "arxivId": "2503.05360",
      "url": "https://www.semanticscholar.org/paper/d4d8bc045dc30a11029efe483fdfe90aa4b2dcab",
      "venue": "Journal of Logic and Computation",
      "journal": {
        "name": "Journal of Logic and Computation"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    }
  ],
  "count": 30,
  "errors": []
}
