{
  "status": "success",
  "source": "philpapers_via_brave",
  "query": "metasemantics",
  "results": [
    {
      "title": "Alexis Burgess & Brett Sherman (eds.), Metasemantics: New Essays on the Foundations of Meaning",
      "url": "https://philpapers.org/rec/BURMNE-2",
      "philpapers_id": "BURMNE",
      "snippet": "Metasemantics comprises new work on the philosophical foundations of linguistic semantics, by a diverse group of established and emerging experts in the philosophy of language, metaphysics, and the theory of content.",
      "page_age": null
    },
    {
      "title": "Ori Simchen, Semantics, Metasemantics, Aboutness",
      "url": "https://philpapers.org/rec/SIMSMA-3",
      "philpapers_id": "SIMSMA",
      "snippet": "Metasemantics is the metaphysics of semantic endowment: it asks how expressions become endowed with their semantic significance. Assuming that semantics is of the usual truth-conditional sort, metasemantics asks after the determinants of ...",
      "page_age": null
    },
    {
      "title": "Daniel Cohnitz & Jussi Haukioja, Foundations for Metasemantics",
      "url": "https://philpapers.org/rec/COHFFM",
      "philpapers_id": "COHFFM",
      "snippet": "Metasemantics studies the foundations of meaning, asking what makes it the case that certain words have the meanings that they do. But what makes metasemantic theories true? This question has been all but ignored in philosophy of language.",
      "page_age": null
    },
    {
      "title": "Karen S. Lewis, Metasemantics without semantic intentions",
      "url": "https://philpapers.org/rec/LEWMWS",
      "philpapers_id": "LEWMWS",
      "snippet": "Having rejected intentionalism in Lewis [.” Erkenntnis 85: 1527–1555.], this paper takes a non-intentionalist perspective in answering the metasemantic question: how does a context determine the value of context-sensitive expressions? It focuses on the case of gradable adjectives, i.e.",
      "page_age": null
    },
    {
      "title": "Michael Caie, Metasemantics and Metaphysical Indeterminacy",
      "url": "https://philpapers.org/rec/CAIMAM",
      "philpapers_id": "CAIMAM",
      "snippet": "In Alexis Burgess &amp; Brett Sherman (eds.), Metasemantics: New Essays on the Foundations of Meaning.",
      "page_age": null
    },
    {
      "title": "Sanford C. Goldberg, The metasemantics of memory",
      "url": "https://philpapers.org/rec/GOLTMO-4",
      "philpapers_id": "GOLTMO",
      "snippet": "In Sven Bernecker’s excellent new book, Memory, he proposes an account of what we might call the “metasemantics” of memory: the conditions that determine the contents of the mental representations employed in memory.",
      "page_age": null
    },
    {
      "title": "Seth Yalcin, Semantics and metasemantics in the context of generative grammar",
      "url": "https://philpapers.org/rec/YALSAM-3",
      "philpapers_id": "YALSAM",
      "snippet": "Metasemantics and Metaphysical Indeterminacy.Michael Caie - 2014 - In Alexis Burgess &amp; Brett Sherman, Metasemantics: New Essays on the Foundations of Meaning.",
      "page_age": null
    },
    {
      "title": "Ori Simchen, Fregean Metasemantics",
      "url": "https://philpapers.org/rec/SIMFMC",
      "philpapers_id": "SIMFMC",
      "snippet": "How the semantic significance of numerical discourse gets determined is a metasemantic issue par excellence. At the sub-sentential level, the issue is riddled with difficulties on account of the contested metaphysical ...",
      "page_age": null
    },
    {
      "title": "Kyle Landrum, Good Explanations and the Causal Metasemantics of Inductive Concepts",
      "url": "https://philpapers.org/rec/LANGEA-2",
      "philpapers_id": "LANGEA",
      "snippet": "A metasemantic theory tells us why a particular concept has its particular content, for example, why the concept orang-utan has orang-utans as its content, rather than Sumatran orang-utans or apes.",
      "page_age": null
    },
    {
      "title": "Christine Tiefensee, Metasemantics, Moral Realism and Moral Doctrines",
      "url": "https://philpapers.org/rec/TIEMMR",
      "philpapers_id": "TIEMMR",
      "snippet": "In this paper, I consider the relationship between Matthew Kramer’s moral realism as a moral doctrine and expressivism, understood as a distinctly non-representationalist metasemantic theory of moral vocabulary. More precisely, I ...",
      "page_age": null
    },
    {
      "title": "Theodore D. Locke, Modal Normativism and Metasemantics",
      "url": "https://philpapers.org/rec/LOCMNA",
      "philpapers_id": "LOCMNA",
      "snippet": "I argue that by keeping the metaphysical insights of normativism at the level of metasemantics—i.e., at the level of accounts of what metaphysically explains facts about the meaning of modal claims—it is open to the normativist to wholeheartedly accept possible worlds semantics.",
      "page_age": null
    },
    {
      "title": "Andrew Alwood, Should Expressivism Be a Theory at the Level of Metasemantics?",
      "url": "https://philpapers.org/rec/ALWSEB",
      "philpapers_id": "ALWSEB",
      "snippet": "Michael Ridge argues that metaethical expressivism can avoid its most worrisome problems by going ‘Ecumenical’. Ridge emphasizes that he aims to develop expressivism at the level of metasemantics rather than at the level of semantics. This is supposed to allow him to avoid a mentalist semantics of attitudes and instead offer an orthodox, truth-conditional or propositional semantics.",
      "page_age": null
    },
    {
      "title": "Xinkan Zhao, Metasemantics and boydian synthetic moral naturalism",
      "url": "https://philpapers.org/rec/ZHAMAB",
      "philpapers_id": "ZHAMAB",
      "snippet": "This paper argues against Boydian synthetic moral naturalism by way of a critical examination at metasemantic issues. I first show that the Boydian metasemantics delivers determinate but wrong reference, building on ...",
      "page_age": null
    },
    {
      "title": "Michael Johnson & Jennifer Nado, Actual vs. counterfactual dispositional metasemantics : a reply to Andow",
      "url": "https://philpapers.org/rec/JOHAVC-2",
      "philpapers_id": "JOHAVC",
      "snippet": "In previous work we proposed a sketch of a disposition-based metasemantictheory, which has recently been criticized by James Andow. Andow claims, first, that our dispositionalmetasemantics threatens to render the meanings of ...",
      "page_age": null
    },
    {
      "title": "Jeffrey C. King, The Metasemantics of Contextual Sensitivity",
      "url": "https://philpapers.org/rec/KINTMO-18",
      "philpapers_id": "KINTMO",
      "snippet": "Some contextually sensitive expressions are such that their context independent conventional meanings need to be in some way supplemented in context for the expressions to secure semantic values in those contexts. ...",
      "page_age": null
    },
    {
      "title": "James Andow, Zebras, Intransigence & Semantic Apocalypse: Problems for Dispositional Metasemantics",
      "url": "https://philpapers.org/rec/ANDZI",
      "philpapers_id": "ANDZI",
      "snippet": "Complete information dispositional metasemantics says that our expressions get their meaning in virtue of what our dispositions to apply those terms would be given complete information. The view has recently been ...",
      "page_age": null
    },
    {
      "title": "Andrew Peet, Assertoric content, responsibility, and metasemantics",
      "url": "https://philpapers.org/rec/PEEACR",
      "philpapers_id": "PEEACR",
      "snippet": "This raises two questions: (a) Why are speakers responsible for the content thus generated? (b) Why is it important for us to distinguish between commitments in terms of their manner of generation? I answer the first question by developing a novel responsibility based metasemantics.",
      "page_age": null
    }
  ],
  "count": 17,
  "errors": []
}
