{
  "status": "success",
  "source": "philpapers_via_brave",
  "query": "denotational semantics reference",
  "results": [
    {
      "title": "Antonio Bucciarelli & Thomas Ehrhard, On phase semantics and denotational semantics: the exponentials",
      "url": "https://philpapers.org/rec/BUCOPS-2",
      "philpapers_id": "BUCOPS",
      "snippet": "We extend to this setting the product phase semantics of indexed multiplicative additive linear logic introduced in Bucciarelli and Ehrhard , defining the symmetric product phase spaces. We prove a soundness result for this truth-value semantics and show how a denotational model of linear logic can be associated to any symmetric product phase space.",
      "page_age": null
    },
    {
      "title": "Jean-Yves Girard, Yves Lafont & Laurent Regnier (eds.), Advances in linear logic",
      "url": "https://philpapers.org/rec/GIRAIL",
      "philpapers_id": "GIRAIL",
      "snippet": "The subject develops along the lines of denotational semantics, proof nets and the geometry of interaction. Its basic dynamical nature has attracted computer scientists, and various promising connections have been made in the areas of optimal program execution, interaction nets and knowledge representation. This book is the refereed ...",
      "page_age": null
    },
    {
      "title": "Reinhard Muskens, Program semantics and classical logic",
      "url": "https://philpapers.org/rec/MUSPSA",
      "philpapers_id": "MUSPSA",
      "snippet": "We prove that the rule of {\\em Scott Induction\\/} holds in this new setting, prove soundness of a Hoare calculus relative to our semantics, give a direct calculus ${\\cal C}$ on programs, and prove that the denotation of any program $P$ in our semantics is equal to the union of the denotations of all those programs $L$ such that $P$ follows from $L$ in our calculus and $L$ does not contain recursion or choice.",
      "page_age": null
    },
    {
      "title": "F. Aguado, P. Ascariz, P. Cabalar, G. Pérez & C. Vidal, Verification for ASP denotational semantics: A case study using the PVS theorem prover",
      "url": "https://philpapers.org/rec/AGUVFA",
      "philpapers_id": "AGUVFA",
      "snippet": "In this article, we present an encoding of the denotational semantics for Answer Set Programming and its monotonic basis into the input language of the theorem prover PVS. Using some libraries and features from PVS, we have obtained semi-automated proofs for several fundamental properties of ASP.",
      "page_age": null
    },
    {
      "title": "P. -L. Curien, Symmetry and interactivity in programming",
      "url": "https://philpapers.org/rec/CURSAI",
      "philpapers_id": "CURSAI",
      "snippet": "We recall some of the early occurrences of the notions of interactivity and symmetry in the operational and denotational semantics of programming languages. We suggest some connections with ludics",
      "page_age": null
    },
    {
      "title": "Ulrich Berger & Hideki Tsuiki, Intuitionistic fixed point logic",
      "url": "https://philpapers.org/rec/BERIFP",
      "philpapers_id": "BERIFP",
      "snippet": "We define a realizability interpretation of IFP and use it to extract computational content from proofs about abstract structures specified by arbitrary classically true disjunction free formulas. The interpretation is shown to be sound with respect to a domain-theoretic denotational semantics and a corresponding lazy operational semantics of a functional language for extracted programs.",
      "page_age": null
    },
    {
      "title": "Chris Hankin, Lambda Calculi: A Guide for the Perplexed",
      "url": "https://philpapers.org/rec/HANLCA-2",
      "philpapers_id": "HANLCA",
      "snippet": "The lambda-calculus lies at the very foundation of computer science. Besides its historical role in computability theory it has had significant influence on programming language design and implementation, denotational semantics and domain theory. The book emphasizes the proof theory for the type-free lambda-calculus.",
      "page_age": null
    },
    {
      "title": "P. R., Truth and Denotation: A Study in Semantical Theory",
      "url": "https://philpapers.org/rec/RTAD",
      "philpapers_id": "RTAD",
      "snippet": "Its extensive reformulation of earlier work will make this study useful as an introduction or advanced text. It treats the denotational semantics of formal systems and presents a non-translational semantics, i.e., ...",
      "page_age": null
    },
    {
      "title": "Raymond Turner, Understanding programming languages",
      "url": "https://philpapers.org/rec/TURUPL",
      "philpapers_id": "TURUPL",
      "snippet": "Logic Programming: Operational Semantics and Proof Theory.James H. Andrews - 1992 - Cambridge University Press. Logic of Domains.Guo-Qiang Zhang - 2012 - Springer Verlag. Programming Languages as Technical Artifacts.Raymond Turner - 2014 - Philosophy and Technology 27 (3):377-397. Tableaus for Logic Programming.Melvin Fitting - unknown · MetaSoft Primer: Towards a Metalanguage for Applied Denotational Semantics.Andrzej Blikle - 1987 - Springer Verlag.",
      "page_age": null
    },
    {
      "title": "Saul A. Kripke, Speaker’s Reference and Semantic Reference",
      "url": "https://philpapers.org/rec/KRISRA-10",
      "philpapers_id": "KRISRA",
      "snippet": "am going to discuss some issues inspired by a well-known paper ofKeith Donnellan, &quot;Reference and Definite Descriptions,”2 but the interest—to me—of the contrast mentioned in my title goes beyond Donnellan&#x27;s paper: I think it is of considerable constructive as well as critical importance to the philosophy oflanguage.",
      "page_age": null
    },
    {
      "title": "William Frawley, Linguistic semantics",
      "url": "https://philpapers.org/rec/FRALS",
      "philpapers_id": "FRALS",
      "snippet": "In contrast to most current treatments of semantics, this book is accessible to the beginning student of semantics and linguistics and also useful to the advanced practitioner. A textbook and reference work in a single volume, it can be used in a number of disciplines: psychology, computer science, and anthropology as well as linguistics.",
      "page_age": null
    }
  ],
  "count": 11,
  "errors": []
}
