{
  "status": "success",
  "source": "semantic_scholar",
  "query": "Jeff Speaks meaning",
  "results": [
    {
      "paperId": "0a778ed814f260a5d19ab07d3da051f48c5ac925",
      "title": "Introduction, Transmission, and the Foundations of Meaning",
      "authors": [
        {
          "name": "Jeff Speaks",
          "authorId": "46183476"
        }
      ],
      "year": 2010,
      "abstract": null,
      "citationCount": 2,
      "doi": "10.1057/9780230248588_12",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/0a778ed814f260a5d19ab07d3da051f48c5ac925",
      "venue": "",
      "journal": {
        "name": "",
        "pages": "226-249",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "1bc384ce7c86a98dc39d5cf13141e74cca7e410d",
      "title": "Bob Dylan",
      "authors": [
        {
          "name": "Jeffrey Edward Green",
          "authorId": "2318272907"
        }
      ],
      "year": 2024,
      "abstract": "\n One of the first book-length works on Bob Dylan from a philosophical perspective, Bob Dylan: Prophet Without God defends the idea of Dylan as a modern-day prophet, albeit one of an unusual, almost unprecedented type. Dylan speaks to the ideals that have animated earlier prophets—social justice, individual freedom, and adherence to God—but breaks from tradition in continually insisting on the conflicts between these ideals, leading him to make novel and important contributions to the meaning of self-reliance, the quest for rapprochement between the religious and non-religious, and the question of how ordinary people might operate in a fallen political world. The book aspires to an overarching account of why Dylan fascinates, even as it also explains why he will remain mysterious and elusive. Bob Dylan: Prophet Without God places Dylan into conversation with a wide array of historical and contemporary intellectual figures to highlight the originality and significance of Dylan’s political, religious, and ethical ideas.",
      "citationCount": 0,
      "doi": "10.1093/oso/9780197651742.001.0001",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/1bc384ce7c86a98dc39d5cf13141e74cca7e410d",
      "venue": "",
      "journal": null,
      "publicationTypes": [
        "Book"
      ]
    },
    {
      "paperId": "f38c785b64439bf687995af44ab0768070bdec15",
      "title": "The Greatest Possible Being",
      "authors": [
        {
          "name": "Jeff Speaks",
          "authorId": "46183476"
        }
      ],
      "year": 2018,
      "abstract": "Philosophical theology is the attempt to use reason to determine the attributes of God. An ancient tradition, which is perhaps more influential now than ever, tries to derive the attributes of God from the principle that God is the greatest possible being. This book argues that that constructive project is a failure. It also argues that the principle that God is the greatest possible being is unsuited to play two other theoretical roles. The first of these is the role of setting the limits of the concept of God, particularly in the context of debates over the existence of God. The second is the role of explaining the meaning of ‘God.’ This leaves us with three unanswered questions. If the principle that God is the greatest possible being can’t deliver results about the divine attributes, define the concept of God, or give the meaning of the name ‘God,’ what can? The last chapter makes some initial steps toward answering these questions.",
      "citationCount": 20,
      "doi": "10.1093/oso/9780198826811.001.0001",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/f38c785b64439bf687995af44ab0768070bdec15",
      "venue": "Oxford Scholarship Online",
      "journal": {
        "name": "Oxford Scholarship Online"
      },
      "publicationTypes": null
    },
    {
      "paperId": "2bebbe1f38d1ccf3c7873e2dc6fb292edb6f4008",
      "title": "Perfect Being Attacked! Jeff Speaks’s The Greatest Possible Being",
      "authors": [
        {
          "name": "Brian Leftow",
          "authorId": "73466922"
        }
      ],
      "year": 2021,
      "abstract": null,
      "citationCount": 1,
      "doi": "10.37977/FAITHPHIL.2021.38.2.6",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/2bebbe1f38d1ccf3c7873e2dc6fb292edb6f4008",
      "venue": "",
      "journal": {
        "name": "Faith and Philosophy",
        "pages": "262-273",
        "volume": "38"
      },
      "publicationTypes": null
    },
    {
      "paperId": "08f88bfbf431adc0a6795521def4277c3999b17a",
      "title": "The Machine Speaks: Conversational AI and the Importance of Effort to Relationships of Meaning",
      "authors": [
        {
          "name": "Anna Hartford",
          "authorId": "150015605"
        },
        {
          "name": "D. Stein",
          "authorId": "2248183861"
        }
      ],
      "year": 2024,
      "abstract": "The focus of debates about conversational artificial intelligence (CAI) has largely been on social and ethical concerns that arise when we speak to machines—what is gained and what is lost when we replace our human interlocutors, including our human therapists, with AI. In this viewpoint, we focus instead on a distinct and growing phenomenon: letting machines speak for us. What is at stake when we replace our own efforts at interpersonal engagement with CAI? The purpose of these technologies is, in part, to remove effort, but effort has enormous value, and in some cases, even intrinsic value. This is true in many realms, but especially in interpersonal relationships. To make an effort for someone, irrespective of what that effort amounts to, often conveys value and meaning in itself. We elaborate on the meaning, worth, and significance that may be lost when we relinquish effort in our interpersonal engagements as well as on the opportunities for self-understanding and growth that we may forsake.",
      "citationCount": 6,
      "doi": "10.2196/53203",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/08f88bfbf431adc0a6795521def4277c3999b17a",
      "venue": "JMIR Mental Health",
      "journal": {
        "name": "JMIR Mental Health",
        "volume": "11"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "d52786318c94f5e8e0d99f76c5965320fba367d9",
      "title": "The Greatest Possible Being, by Jeff Speaks",
      "authors": [
        {
          "name": "Joshua Rasmussen",
          "authorId": "16506024"
        }
      ],
      "year": 2019,
      "abstract": null,
      "citationCount": 1,
      "doi": "10.1093/mind/fzz064",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/d52786318c94f5e8e0d99f76c5965320fba367d9",
      "venue": "Mind",
      "journal": {
        "name": "Mind"
      },
      "publicationTypes": null
    },
    {
      "paperId": "732c534defaabd110a26cf04b0271b38dc942b29",
      "title": "Book Review: The Greatest Possible Being by Jeff Speaks",
      "authors": [
        {
          "name": "Katherin A. Rogers",
          "authorId": "14266523"
        }
      ],
      "year": 2019,
      "abstract": null,
      "citationCount": 0,
      "doi": "10.24204/ejpr.v11i4.3009",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/732c534defaabd110a26cf04b0271b38dc942b29",
      "venue": "",
      "journal": {
        "name": "European Journal for the Philosophy of Religion",
        "pages": "213-219",
        "volume": "11"
      },
      "publicationTypes": [
        "Review"
      ]
    },
    {
      "paperId": "39755d1a33f08193b529331abc2d806d2563a85c",
      "title": "Jeff Speaks: The Phenomenal and the Representational",
      "authors": [
        {
          "name": "J. Levin",
          "authorId": "40383878"
        }
      ],
      "year": 2017,
      "abstract": null,
      "citationCount": 0,
      "doi": "10.1111/PHPR.12413",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/39755d1a33f08193b529331abc2d806d2563a85c",
      "venue": "",
      "journal": {
        "name": "Philosophy and Phenomenological Research",
        "pages": "478-484",
        "volume": "95"
      },
      "publicationTypes": null
    },
    {
      "paperId": "6deea9f09c80fb46a63eeac73f69b4f9c6951d0c",
      "title": "Jeffrey C. King, Scott Soames, Jeff Speaks, New Thinking about Propositions",
      "authors": [
        {
          "name": "Thomas Hodgson",
          "authorId": "39902795"
        }
      ],
      "year": 2014,
      "abstract": null,
      "citationCount": 3,
      "doi": "10.5840/PJPHIL20148214",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/6deea9f09c80fb46a63eeac73f69b4f9c6951d0c",
      "venue": "",
      "journal": {
        "name": "Polish Journal of Philosophy",
        "pages": "80-83",
        "volume": "8"
      },
      "publicationTypes": null
    },
    {
      "paperId": "b5b6069f446dc2130b21d7b48ee83a17cef786f2",
      "title": "Embodiment and the Meaning of Life by Jeff Noonan (review)",
      "authors": [
        {
          "name": "John McMurty",
          "authorId": "87973068"
        }
      ],
      "year": 2021,
      "abstract": null,
      "citationCount": 2,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/b5b6069f446dc2130b21d7b48ee83a17cef786f2",
      "venue": "",
      "journal": {
        "name": "University of Toronto Quarterly",
        "pages": "531 - 533",
        "volume": "89"
      },
      "publicationTypes": [
        "Review"
      ]
    },
    {
      "paperId": "c8498b926730f33aff294bc3b52acda8c820e7f6",
      "title": "The Spirit Speaks and the Wind Blows: The Primary Meaning of Πνεῦμα in John 3:8",
      "authors": [
        {
          "name": "C. J. Luthy",
          "authorId": "2203814332"
        }
      ],
      "year": 2020,
      "abstract": "This paper addresses the double-meaning of Spirit and wind in John 3:8 and argues that the verse should be translated in terms of the Spirit. The study begins with an analysis of the Greek text of John 3:8. It is demonstrated that even though a double-meaning is present, the more appropriate interpretation is the Spirit reading. Arguments in favor of the wind interpretation of John 3:8 are also addressed. Following this, the study surveys all usages of John 3:8 in the early church writings. It is concluded that in the writings of the AnteNicene Fathers, the text was interpreted with the Spirit. It is also concluded that the vast majority of Nicene and Ante-Nicene church fathers understood John 3:8 with the Spirit. Therefore, it is suggested that the recent preference of the wind meaning, which is evident in many current English translations, should be revised such that the Spirit reading becomes primary.",
      "citationCount": 1,
      "doi": "10.25278/jj.v18i2.526",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/c8498b926730f33aff294bc3b52acda8c820e7f6",
      "venue": "",
      "journal": {
        "name": "",
        "pages": "107",
        "volume": "18"
      },
      "publicationTypes": [
        "Review"
      ]
    },
    {
      "paperId": "8dcfab8e3b725b3278462c74fa19578780bd1628",
      "title": "Meaning From Money: Jeff Koons and The Tautology of Value",
      "authors": [
        {
          "name": "Ramsay Eyre",
          "authorId": "1519269018"
        }
      ],
      "year": 2019,
      "abstract": null,
      "citationCount": 0,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/8dcfab8e3b725b3278462c74fa19578780bd1628",
      "venue": "",
      "journal": {
        "name": "",
        "volume": "15"
      },
      "publicationTypes": null
    },
    {
      "paperId": "f718f2475e3bbadb7d51a3a8fe5a1d1ae85c9824",
      "title": "Perception and illusion: replies to Sethi, Speaks and Cutter",
      "authors": [
        {
          "name": "Adam Pautz",
          "authorId": "2300799022"
        }
      ],
      "year": 2024,
      "abstract": "ABSTRACT I reply to comments on my book Perception (Routledge 2021) by Umrao Sethi, Jeff Speaks and Brian Cutter. Sethi objects to my representational view of perception on the ground that that having an experience of a color or shape can enable you to know what that color or shape is like only if it is actually present in the experience. Speaks has a very interesting discussion of my puzzle of the laws of appearance for the representational view. And Cutter asks what I have against 'neural sense datum theory'. In my responses, I try to take the discussion forward. At the end, I develop a new argument against reductive physicalist theories of sensible qualities.",
      "citationCount": 2,
      "doi": "10.1080/0020174X.2024.2349216",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/f718f2475e3bbadb7d51a3a8fe5a1d1ae85c9824",
      "venue": "Inquiry",
      "journal": {
        "name": "Inquiry",
        "pages": "2294 - 2320",
        "volume": "67"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "1343109a0322209f313aa0c5f647206e6a1857ee",
      "title": "Responses to Speaks, Stojnić and Szabó",
      "authors": [
        {
          "name": "Jeffrey C. King",
          "authorId": "2325724157"
        }
      ],
      "year": 2024,
      "abstract": "Consider the class of contextually sensitive expressions whose context invariant meanings arguably do not suffice to secure semantic values in context. Demonstratives and demonstrative pronouns are the examples of such expressions that have received the most attention from philosophers. However, arguably this class of contextually sensitive expressions includes among other expressions modals, conditionals, tense, gradable adjectives, possessives, ‘only’, quantifiers, and expressions that take implicit arguments (e.g. ‘ready’ in sentences like ‘Molly is ready.’). Most theorists, including me, think that since the context invariant meanings of such expressions do not by themselves secure semantic values in context for these expressions, they must be supplemented in some way in context in order to secure semantic values in context. For this reason, I call these expressions supplementives. I just said that supplementives need some sort of supplementation to secure semantic values in context. Of course, the question of what form the supplementation in context takes is controversial. For example, ever since Kaplan claimed that the semantic value of a demonstrative or demonstrative pronoun in context is the demonstratum of its associated demonstration, there has been a lively controversy over whether that or some other account is the correct one. Call an account of how a given supplementive secures a semantic value in context a metasemantics for the supplementive. In King [2018] I argue that all supplementives have felicitous uses in which they haven’t been assigned unique semantic values in context. This conclusion is somewhat surprising, since many uses of supplementives in which they have not been assigned unique semantic values in context are quite infelicitous. I call felicitous uses of supplementives in which they haven’t been assigned unique semantic values in context instances of felicitous underspecification. The central idea is that in cases of felicitous underspecification, supplementives get assigned a range of candidates for being their semantic values in contexts rather than being assigned unique semantic values in contexts. Consider an example. Glenn and I are out surfing at Lost Winds beach. There are some surfers to our south stretching a quarter mile or so down the beach. I notice that some surfers in an ill-defined group to our immediate south are getting incredible rides. I say to Glenn looking south toward them ‘Those guys are good.’ It seems easy to imagine that nothing in the context of utterance determines a unique group of surfers as the semantic value in context of ‘Those guys’. For example, it is easy to imagine that I didn’t intend any specific, unique group to be the semantic value in context. Instead, there is a range of overlapping groups that are legitimate candidates for being the semantic value in context of ‘Those guys’. Nonetheless, my utterance is felicitous: Glenn had no qualms about my utterance and took it to be impeccably acceptable. So this is an instance of felicitous underspecification. As its title suggests, felicitous underspecification is the main topic of the present book. Here is a summary of what is in each chapter. Chapter 1 provides examples of felicitous underspecification for a variety of supplementives. In each case of felicitous underspecification considered in Chap. 1, I say how I think conversational participants update the Stalnakerian common ground after accepting the utterance of the sentence containing a felicitous underspecified use of a supplementive. I do so without there formulating a principle that determines the updates in question. In Chap. 2, I formulate such a principle and illustrate its predictions with some of the cases of felicitous underspecification considered in Chap. 1. I claim the principle correctly predicts the updates discussed in Chap. 1. In Chap. 3, I consider and discuss the mechanism that I claim associates ranges of candidate semantic values in context with felicitous underspecified uses of supplementives. In Chap. 4, I discuss cases in which felicitous underspecified uses of supplementives are embedded in certain ways: under negation, and under ‘believes’ and ‘doubts’. In Chap. 5 I take up I take up the question of why sentences containing felicitous underspecified uses of supplementives are felicitous in the contexts in which they are uttered. In particular, I formulate a notion of a context being appropriate for an LF, where an LF is felicitous in a context only if the context is appropriate for the LF. In particular, an LF ϕ containing a use of an underspecified supplementive in a context c will be felicitous only if c is appropriate for ϕ. In Chap. 6, I take up some problems that arise with underspecified uses of pronouns, demonstratives and possessives and consider revising the appropriateness condition of Chap. 5.",
      "citationCount": 0,
      "doi": "10.1007/s11098-024-02219-2",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/1343109a0322209f313aa0c5f647206e6a1857ee",
      "venue": "Philosophical Studies",
      "journal": {
        "name": "Philosophical Studies",
        "pages": "3203 - 3218",
        "volume": "181"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "c468b28fc698346aa1b1929d6a41a7f025be70c9",
      "title": "Measurement to Meaning: A Validity-Centered Framework for AI Evaluation",
      "authors": [
        {
          "name": "Olawale Salaudeen",
          "authorId": "2041792512"
        },
        {
          "name": "Anka Reuel",
          "authorId": "2209882963"
        },
        {
          "name": "Ahmed M. Ahmed",
          "authorId": "2362189679"
        },
        {
          "name": "Suhana Bedi",
          "authorId": "2296770804"
        },
        {
          "name": "Zachary Robertson",
          "authorId": "2362035178"
        },
        {
          "name": "Sudharsan Sundar",
          "authorId": "2273925278"
        },
        {
          "name": "Ben Domingue",
          "authorId": "2375749942"
        },
        {
          "name": "Angelina Wang",
          "authorId": "2349388428"
        },
        {
          "name": "Oluwasanmi Koyejo",
          "authorId": "143812875"
        }
      ],
      "year": 2025,
      "abstract": "While the capabilities and utility of AI systems have advanced, rigorous norms for evaluating these systems have lagged. Grand claims, such as models achieving general reasoning capabilities, are supported with model performance on narrow benchmarks, like performance on graduate-level exam questions, which provide a limited and potentially misleading assessment. We provide a structured approach for reasoning about the types of evaluative claims that can be made given the available evidence. For instance, our framework helps determine whether performance on a mathematical benchmark is an indication of the ability to solve problems on math tests or instead indicates a broader ability to reason. Our framework is well-suited for the contemporary paradigm in machine learning, where various stakeholders provide measurements and evaluations that downstream users use to validate their claims and decisions. At the same time, our framework also informs the construction of evaluations designed to speak to the validity of the relevant claims. By leveraging psychometrics'breakdown of validity, evaluations can prioritize the most critical facets for a given claim, improving empirical utility and decision-making efficacy. We illustrate our framework through detailed case studies of vision and language model evaluations, highlighting how explicitly considering validity strengthens the connection between evaluation evidence and the claims being made.",
      "citationCount": 15,
      "doi": "10.48550/arXiv.2505.10573",
      "arxivId": "2505.10573",
      "url": "https://www.semanticscholar.org/paper/c468b28fc698346aa1b1929d6a41a7f025be70c9",
      "venue": "arXiv.org",
      "journal": {
        "name": "ArXiv",
        "volume": "abs/2505.10573"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "f31c12a9e61757cffcea42882993b18ba92922f0",
      "title": "Measuring meaning in life by combining philosophical and psychological distinctions: Psychometric properties of the Comprehensive Measure of Meaning",
      "authors": [
        {
          "name": "R. N. Padgett",
          "authorId": "2311185883"
        },
        {
          "name": "Jeffrey Hanson",
          "authorId": "2294208634"
        },
        {
          "name": "J. Nakamura",
          "authorId": "2047615123"
        },
        {
          "name": "James L. Ritchie-Dunham",
          "authorId": "1403985232"
        },
        {
          "name": "Eric S. Kim",
          "authorId": "2268025253"
        },
        {
          "name": "Tyler J. VanderWeele",
          "authorId": "2294201326"
        }
      ],
      "year": 2024,
      "abstract": "ABSTRACT Meaning, a fundamental component of human well-being, can be categorized into seven interrelated subdomains, as our study provides evidence for. These categories nest within a previously established tripartite classification of meaning in life (e.g. coherence, significance, and direction/purpose). We present the psychological and philosophical distinctions that led to the development of the Comprehensive Measure of Meaning (CMM). We provide empirical evidence for the reliability of scores and validity of the CMM using a longitudinal sample of college students (N = 4058) and a large, diverse sample from a Latin American financial institution (N = 8794). The measurement of individuals’ perception of their meaning in life is internally consistent, and we present results based on an innovative method to explore conceptual distinctions. Finally, we provide recommendations on using the CMM as a measure of individuals’ perceptions of their meaning in life and avenues for potentially beneficial modifications researchers might consider based on their intended uses.",
      "citationCount": 5,
      "doi": "10.1080/17439760.2024.2403367",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/f31c12a9e61757cffcea42882993b18ba92922f0",
      "venue": "Journal of Positive Psychology",
      "journal": {
        "name": "The Journal of Positive Psychology",
        "pages": "682 - 698",
        "volume": "20"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "dc20013be4f71978eb65d81db8c7a423c2c4af10",
      "title": "Money Talks: Exchange, Sex and Meaning in Cassin and Lacan",
      "authors": [
        {
          "name": "Kurt Lampe",
          "authorId": "2350915851"
        }
      ],
      "year": 2025,
      "abstract": "This article aims to illuminate the power as well as some of the limitations of Cassin’s post-Lacanian theorization of how speech acts on speaker and listener, has meaning, and gets a grip on ‘things out there’. The article focuses on a narrow case study, namely what Cassin writes about paying to speak to a psychotherapist. First, it elucidates her elliptical comments about the ‘scandal’ of ‘paying for it’ and what this tells us about ‘truth’ and ‘value’ in psychotherapeutic conversations, especially conversations about payment. This involves grounding these theories in clinical realities more concretely than is usually done. The article then reflects critically on her position both by contextualizing it against what psychotherapists themselves have said about ‘money talk’ and by making explicit the developmental narrative that underpins the Lacanian theory, to which the article sketches an alternative inspired principally by Donald Winnicott.",
      "citationCount": 0,
      "doi": "10.3366/para.2025.0486",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/dc20013be4f71978eb65d81db8c7a423c2c4af10",
      "venue": "Paragraph",
      "journal": {
        "name": "Paragraph"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "80c92f54a1178a857f0c002b7decf99f5325d833",
      "title": "When Meaning Making Doesn’t Work: Theological Insights Concerning a Trustworthy Attachment Relationship to Get Through Existential Loneliness",
      "authors": [
        {
          "name": "J. F. Dickie",
          "authorId": "2280958666"
        }
      ],
      "year": 2025,
      "abstract": null,
      "citationCount": 1,
      "doi": "10.1007/s11089-025-01214-6",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/80c92f54a1178a857f0c002b7decf99f5325d833",
      "venue": "Pastoral Psychology",
      "journal": {
        "name": "Pastoral Psychology",
        "pages": "695 - 712",
        "volume": "74"
      },
      "publicationTypes": [
        "JournalArticle",
        "Review"
      ]
    },
    {
      "paperId": "4de001bd1aa03139c4f32ce93fb7eaa7a323d2e8",
      "title": "The meaning of a painting or the painting of meaning. Merleau-Ponty and Cézanne",
      "authors": [
        {
          "name": "Milomir Erić",
          "authorId": "2193953432"
        }
      ],
      "year": 2023,
      "abstract": "This paper is primarily an attempt to examine the way in which the problems\n of painting appear in the phenomenology of M. Merleau-Ponty. The initial\n philosophical assumption for this analysis is Merleau-Ponty?s stance on the\n primacy of perceptual consciousness, which largely determined the framework\n of thought and imposed the direction of research which Merleau-Ponty\n followed, most notably in his later works. The central part of this paper\n focuses on Merleau-Ponty?s analysis of C?zanne?s body of work. The problem\n of truth in painting of which C?zanne speaks and Merleau-Ponty?s analyses\n of the inner logos of perceptual experience represent the crucial\n connections between these two creators and are thus the focal point of this\n paper. The painting?s way of being, the relationship between the visible and\n the invisible, and the establishing of a new ontology are topics the author\n addresses in the final part of this paper.",
      "citationCount": 0,
      "doi": "10.2298/theo2304095e",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/4de001bd1aa03139c4f32ce93fb7eaa7a323d2e8",
      "venue": "Theoria Beograd",
      "journal": {
        "name": "Theoria, Beograd"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "34829024d09c56b5a7ea8e3ae41294f7729a77c1",
      "title": "Viktor Frankl Speaks On Leadership: The Will To Meaning",
      "authors": [
        {
          "name": "J. Michael",
          "authorId": "143614510"
        }
      ],
      "year": 2014,
      "abstract": null,
      "citationCount": 0,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/34829024d09c56b5a7ea8e3ae41294f7729a77c1",
      "venue": "",
      "journal": {
        "name": "",
        "volume": ""
      },
      "publicationTypes": null
    }
  ],
  "count": 20,
  "errors": []
}
