{
  "status": "success",
  "source": "philpapers_via_brave",
  "query": "grounding semantics",
  "results": [
    {
      "title": "Hans G. Herzberger, Paradoxes of grounding in semantics",
      "url": "https://philpapers.org/rec/HERPOG",
      "philpapers_id": "HERPOG",
      "snippet": "On representing ‘true-in-L&#x27; in ... Truth and paradox. Journal of philosophical logic, vol. 11 , pp. 1–60. - Hans G. Herzberger. Notes on naive semantics....",
      "page_age": null
    },
    {
      "title": "Louis deRosset, Better Semantics for the Pure Logic of Ground",
      "url": "https://philpapers.org/rec/DERBSF",
      "philpapers_id": "DERBSF",
      "snippet": "In this paper, I review the problems and offer an alternative that avoids them. I offer a semantics for the pure logic of ground that is motivated by ideas already present in the grounding literature, and for which a natural axiomatization capturing central formal features of grounding is sound and complete.",
      "page_age": null
    },
    {
      "title": "Jonas Werner, Partial grounding, identity, and nothing-over-and-aboveness",
      "url": "https://philpapers.org/rec/WERPGI",
      "philpapers_id": "WERPGI",
      "snippet": "In this context, I propose and discuss a way to spell out nothing-over-and-aboveness in terms of generalised identity that does justice to the claim that the fully grounded is nothing over and above its full grounds.",
      "page_age": null
    },
    {
      "title": "Isaac Wilhelm, Grounding and propositional identity",
      "url": "https://philpapers.org/rec/WILGAP-6",
      "philpapers_id": "WILGAP",
      "snippet": "Abelard on Grounding in Ontology and Logic.Christopher J. Martin - 2024 - In Calvin G. Normore &amp; Stephan Schmid, Grounding in Medieval Philosophy. Cham: Springer Nature Switzerland. pp. 103-128. Structured propositions and a semantics for unrestricted impure logics of ground.Amirhossein Kiani ...",
      "page_age": null
    },
    {
      "title": "Francesco A. Genco, Francesca Poggiolesi & Lorenzo Rossi, Grounding, Quantifiers, and Paradoxes",
      "url": "https://philpapers.org/rec/GENGQA",
      "philpapers_id": "GENGQA",
      "snippet": "The notion of grounding is usually conceived as an objective and explanatory relation. It connects two relata if one—the ground—determines or explains the other—the consequence. In the contemporary literature on grounding, ...",
      "page_age": null
    },
    {
      "title": "Stevan Harnad, The symbol grounding problem",
      "url": "https://philpapers.org/rec/HARTSG",
      "philpapers_id": "HARTSG",
      "snippet": "There has been much discussion recently about the scope and limits of purely symbolic models of the mind and about the proper role of connectionism in cognitive modeling. This paper describes the symbol grounding problem : How can the semantic interpretation of a formal symbol system be made intrinsic to the system, rather than just parasitic on the meanings in our heads?",
      "page_age": null
    },
    {
      "title": "Francesca Poggiolesi, On defining the notion of complete and immediate formal grounding",
      "url": "https://philpapers.org/rec/POGODT",
      "philpapers_id": "POGODT",
      "snippet": "The aim of this paper is to provide a definition of the the notion of complete and immediate formal grounding through the concepts of derivability and complexity. It will be shown ...",
      "page_age": null
    },
    {
      "title": "Jianhui Li & Haohao Mao, The Difficulties in Symbol Grounding Problem and the Direction for Solving It",
      "url": "https://philpapers.org/rec/LITDI-3",
      "philpapers_id": "LITDI",
      "snippet": "The symbol grounding problem (SGP) proposed by Stevan Harnad in 1990, originates from Searle’s “Chinese Room Argument” and refers to the problem of how a pure symbolic system acquires its meaning. While many solutions to this problem have been proposed, all of them have encountered inconsistencies to different extents.",
      "page_age": null
    },
    {
      "title": "Francesca Poggiolesi, A Critical Overview of the Most Recent Logics of Grounding",
      "url": "https://philpapers.org/rec/POGACO-2",
      "philpapers_id": "POGACO",
      "snippet": "Ground-theoretic equivalence.Stephan Krämer - 2019 - Synthese 198 (2):1643-1683. (Conceptual) explanations in logic.Francesca Poggiolesi - forthcoming - Journal of Logic and Computation. Denotational Semantics for Languages of Epistemic Grounding Based on Prawitz’s Theory of Grounds.Antonio ...",
      "page_age": null
    },
    {
      "title": "Staffan Larsson, Grounding as a Side‐Effect of Grounding",
      "url": "https://philpapers.org/rec/LARGAA-3",
      "philpapers_id": "LARGAA",
      "snippet": "“Symbol grounding” is the process of connecting symbols to perception and the world. “Communicative grounding” is the process of interactively adding to common ground in dialog.",
      "page_age": null
    },
    {
      "title": "Stevan Harnad, Symbol grounding and the origin of language",
      "url": "https://philpapers.org/rec/HARSGA",
      "philpapers_id": "HARSGA",
      "snippet": "The symbols that denote categories must be grounded in the capacity to sort, label and interact with the proximal sensorimotor projections of their distal category-members in a way that coheres systematically with their semantic interpretations, both for individual symbols, and for symbols strung together to express truth-value-bearing propositions",
      "page_age": null
    },
    {
      "title": "David Elohim, Grounding, Conceivability, and the Mind-Body Problem",
      "url": "https://philpapers.org/rec/KHUGCA-2",
      "philpapers_id": "KHUGCA",
      "snippet": "This paper challenges the soundness of the two-dimensional conceivability argument against the derivation of phenomenal truths from physical truths in light of a hyperintensional, ground-theoretic regimentation of the ontology of consciousness. ...",
      "page_age": null
    },
    {
      "title": "Jessica Keiser, Language without information exchange",
      "url": "https://philpapers.org/rec/KEILWI",
      "philpapers_id": "KEILWI",
      "snippet": "I argue that recent skepticism toward this project is generated by features of traditional implementations of the project, rather than the project itself. A picture of language as essentially a mechanism for cooperative information exchange attracted theorists to metasemantic accounts grounding language use in illocutionary action (roughly, using an utterance to elicit a propositional attitude).",
      "page_age": null
    },
    {
      "title": "Antje Rumberg, Bolzano’s concept of grounding against the background of normal proofs",
      "url": "https://philpapers.org/rec/RUMBCO",
      "philpapers_id": "RUMBCO",
      "snippet": "Occasionally, similarities have been pointed out between Bolzano’s ideas on grounding and cut-free proofs in Gentzen’s sequent calculus. My thesis is, however, that they bear an even stronger resemblance to the normal natural deduction proofs employed in proof-theoretic semantics in the ...",
      "page_age": null
    }
  ],
  "count": 14,
  "errors": []
}
