{
  "status": "success",
  "source": "philpapers_via_brave",
  "query": "semantic foundations",
  "results": [
    {
      "title": "Richard L. Epstein, The semantic foundations of logic",
      "url": "https://philpapers.org/rec/EPSTSF",
      "philpapers_id": "EPSTSF",
      "snippet": "This book presents modern logic as the formalization of reasoning that needs and deserves a semantic foundation. Chapters on propositional logic; parsing propositions; and meaning, truth and reference give the reader ...",
      "page_age": null
    },
    {
      "title": "Douglas Walton, Epstein's The Semantic Foundations of Logic vol. I, Propositional Logics vol. II, Predicate Logic",
      "url": "https://philpapers.org/rec/WALETS",
      "philpapers_id": "WALETS",
      "snippet": "Resenha de &#x27;Propositional logic: the semantic foundations of logic&#x27; (R. L. Epstein) - &#x27;Predicate logic: the semantic foundations of logic&#x27; (R. L. Epstein) - &#x27;Computable functions, logic, and the foundations of mathematics&#x27; (R. L. Epstein and W. A. Carniel).",
      "page_age": null
    },
    {
      "title": "Alfred Tarski, The semantic conception of truth and the foundations of semantics",
      "url": "https://philpapers.org/rec/TARTSC",
      "philpapers_id": "TARTSC",
      "snippet": "The Semantic Conception of Truth and the Foundations of Semantics.R. Montague &amp; R. H. Thomason - 1996 - In Michael Losonsky &amp; Heimir Geirsson, _Readings in Language and Mind_. Cambridge, Mass., USA: Wiley-Blackwell.",
      "page_age": null
    },
    {
      "title": "Richard L. Epstein & Walter Alexandre Carnielli, The Semantic Foundations of Logic Volume 1: Propositional Logics",
      "url": "https://philpapers.org/rec/EPSTSF-3",
      "philpapers_id": "EPSTSF",
      "snippet": "Richard L. Epstein. The semantic foundations of logic. Volume 1: Propositional logics. With the assistance and collaboration of Walter A. Carnielli, Itala M. L. D&#x27;Ottaviano, Stanisław Krajewski, and Roger D. Maddux. Nijhoff international philosophy series, vol.",
      "page_age": null
    },
    {
      "title": "Richard L. Epstein, Classical Mathematical Logic. The Semantic Foundations of Logic",
      "url": "https://philpapers.org/rec/EPSCML",
      "philpapers_id": "EPSCML",
      "snippet": "L. Epstein) - &#x27;Predicate logic: the semantic foundations of logic&#x27; (R. L. Epstein) - &#x27;Computable functions, logic, and the foundations of mathematics&#x27; (R. L. Epstein and W. A. Carniel).",
      "page_age": null
    },
    {
      "title": "Alexander V. Gheorghiu & David J. Pym, Semantic Foundations of Reductive Reasoning",
      "url": "https://philpapers.org/rec/GHESFO",
      "philpapers_id": "GHESFO",
      "snippet": "Reductive Logic, Proof-Search, and Coalgebra: A Perspective from Resource Semantics.Alexander V. Gheorghiu, Simon Docherty &amp; David J. Pym - 2023 - In Alessandra Palmigiano &amp; Mehrnoosh Sadrzadeh, Samson Abramsky on Logic and Structure in Computer Science and Beyond.",
      "page_age": null
    },
    {
      "title": "J. E. Wolff, The Philosophical Significance of the Representational Theory of Measurement —RTM as Semantic Foundations",
      "url": "https://philpapers.org/rec/EWOTPS",
      "philpapers_id": "EWOTPS",
      "snippet": "In what sense does RTM provide foundations of measurement, and what is the philosophical significance of such foundations? I argue that RTM provides semantic foundations of measurement, and that their philosophical significance lies in a shift towards structural representation.",
      "page_age": null
    },
    {
      "title": "Samuel Z. Elgin, The Semantic Foundations of Philosophical Analysis",
      "url": "https://philpapers.org/rec/ELGTSF-2",
      "philpapers_id": "ELGTSF",
      "snippet": "I provide an analysis of sentences of the form ‘To beFis to beG’ in terms of exact truth-maker semantics—an approach that identifies the meanings of sentences with the states of the world directly responsible for their truth-values. Roughly, I argue that these sentences hold just in case that which makes somethingFalso makes itG.",
      "page_age": null
    },
    {
      "title": "Alfred Tarski, C. I. Lewis & Nelson Goodman, The Semantic Conception of Truth and the Foundations of Semantics",
      "url": "https://philpapers.org/rec/TARTSC-3",
      "philpapers_id": "TARTSC",
      "snippet": "Tarski Alfred. The semantic conception of truth and the foundations of semantics. A reprint of IX 68 . Semantics and the philosophy of language, A collection of readings, edited by Linsky Leonard, The University of Illinois Press, Urbana 1952, pp. 13–47.Lewis C.",
      "page_age": null
    },
    {
      "title": "K. M. Jaszczolt, Default Semantics: Foundations of a Compositional Theory of Acts of Communication",
      "url": "https://philpapers.org/rec/MJADSF-2",
      "philpapers_id": "MJADSF",
      "snippet": "She shows that the compositionality of meaning may be understood as merger representations combining information from various sources including word meaning and sentence structure, various kinds of default interpretations, and conscious pragmatic inference. Among the applications the author discusses are constructions that pose problems in semantic analysis such as referring expressions, propositional attitude constructions, presupposition, modality, numerals, and sentential connectives.",
      "page_age": null
    },
    {
      "title": "Robert Stalnaker, Mere Possibilities: Metaphysical Foundations of Modal Semantics",
      "url": "https://philpapers.org/rec/STAMPM-2",
      "philpapers_id": "STAMPM",
      "snippet": "Mere Possibilities: Metaphysical Foundations of Modal Semantics by Robert Stalnaker.",
      "page_age": null
    },
    {
      "title": "Samuel Elgin, The Semantic Foundations of Philosophical Analysis",
      "url": "https://philpapers.org/rec/ELGTSF",
      "philpapers_id": "ELGTSF",
      "snippet": "I provide an analysis of sentences of the form ‘To be F is to be G’ in terms of exact truth-maker semantics—an approach that identifies the meanings of sentences with the states of the world directly responsible for their truth-values. Roughly, I argue that these sentences hold just in case that which makes something F is that which makes it G.",
      "page_age": null
    },
    {
      "title": "Graeme Forbes, Richard L. Epstein. The semantic foundations of logic. Volume 1: Propositional logics. With the assistance and collaboration of Walter A. Carnielli, Itala M. L. D'Ottaviano, Stanisław Krajewski, and Roger D. Maddux. Nijhoff international philosophy series, vol. 35. Kluwer Academic Publishers, Dordrecht, Boston, and London, 1990, xxii + 386 pp",
      "url": "https://philpapers.org/rec/FORRLE",
      "philpapers_id": "FORRLE",
      "snippet": "Review: Richard L. Epstein, Walter A. Carnielli, Itala M. L. D&#x27;Ottaviano, Stanislaw Krajewski, Roger D. Maddux, The Semantic Foundations of Logic. Volume 1: Propositional Logics.",
      "page_age": null
    },
    {
      "title": "Guram Bezhanishvili & Wesley H. Holliday, A Semantic Hierarchy for Intuitionistic Logic",
      "url": "https://philpapers.org/rec/BEZASH",
      "philpapers_id": "BEZASH",
      "snippet": "The guiding idea is that of a hierarchy of semantics, organized by increasing generality: from the least general Kripke semantics on through Beth semantics, topological semantics, Dragalin semantics, and finally to the most general algebraic ...",
      "page_age": null
    },
    {
      "title": "Alfred Tarski, The Semantic Conception of Truth",
      "url": "https://philpapers.org/rec/TARTSC-6",
      "philpapers_id": "TARTSC",
      "snippet": "The Semantic Conception of Truth and the Foundations of Semantics.Alfred Tarski - 1944 - Journal of Symbolic Logic 9 (3):68-68.",
      "page_age": null
    },
    {
      "title": "Gilbert H. Harman, J. F. Staal. Some semantic relations between sentoids. Foundations of language, vol. 3 , pp. 66–88",
      "url": "https://philpapers.org/rec/HARJFS",
      "philpapers_id": "HARJFS",
      "snippet": "Syntactic and Semantic Relations in Pāṇini.P. Kiparsky &amp; J. F. Staal - 1969 - Foundations of Language 5 (1):83-117.",
      "page_age": null
    },
    {
      "title": "Ray S. Jackendoff, Semantic Structures",
      "url": "https://philpapers.org/rec/JACSS",
      "philpapers_id": "JACSS",
      "snippet": "Semantic Structures is a large-scale study of conceptual structure and its lexical and syntactic expression in English that builds on the theory of Conceptual...",
      "page_age": null
    },
    {
      "title": "Frederic B. Fitch, Tarski Alfred. The semantic conception of truth and the foundations of semantics. English with Spanish abstract. Philosophy and phenomenological research, vol. 4 no. 3 , pp. 341–376",
      "url": "https://philpapers.org/rec/FITTAT-7",
      "philpapers_id": "FITTAT",
      "snippet": "This site uses cookies and Google Analytics (see our terms &amp; conditions for details regarding the privacy implications). Use of this site is subject to terms &amp; conditions. All rights reserved by The PhilPapers Foundation Server: philpapers-web-648784bb4d-2w72m uwo",
      "page_age": null
    },
    {
      "title": "Floris Roelofsen, Algebraic foundations for the semantic treatment of inquisitive content",
      "url": "https://philpapers.org/rec/ROEAFF",
      "philpapers_id": "ROEAFF",
      "snippet": "However, sentences in natural language are not only used to provide information, but also to request information. Thus, natural language semantics requires a logical framework whose notion of meaning does not only embody informative content, but also inquisitive content. This paper develops the algebraic foundations for such a framework.",
      "page_age": null
    }
  ],
  "count": 19,
  "errors": []
}
