{
  "status": "success",
  "source": "semantic_scholar",
  "query": "Alexis Burgess metasemantics",
  "results": [
    {
      "paperId": "996ef6ea12f94740f797e07450b5b0da437257bc",
      "title": "Metasemantics: New Essays on the Foundations of Meaning, edited by Alexis Burgess and Brett Sherman",
      "authors": [
        {
          "name": "Daniel W. Harris",
          "authorId": "143808454"
        }
      ],
      "year": 2017,
      "abstract": null,
      "citationCount": 0,
      "doi": "10.1080/00048402.2016.1156138",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/996ef6ea12f94740f797e07450b5b0da437257bc",
      "venue": "",
      "journal": {
        "name": "Australasian Journal of Philosophy",
        "pages": "190 - 193",
        "volume": "95"
      },
      "publicationTypes": null
    },
    {
      "paperId": "28abdbdb85329166ec8324ec1a96710b2c2e0c78",
      "title": "Metasemantics: New Essays on the Foundations of Meaning",
      "authors": [
        {
          "name": "A. Burgess",
          "authorId": "74917692"
        },
        {
          "name": "B. Sherman",
          "authorId": "115900981"
        }
      ],
      "year": 2014,
      "abstract": null,
      "citationCount": 45,
      "doi": "10.1093/ACPROF:OSO/9780199669592.001.0001",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/28abdbdb85329166ec8324ec1a96710b2c2e0c78",
      "venue": "",
      "journal": {
        "name": "",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "8d17196837fd62e1e81fd9f6240e5bb78c6cef0f",
      "title": "Early formation and taphonomic significance of kaolinite associated with Burgess Shale fossils",
      "authors": [
        {
          "name": "Ross P. Anderson",
          "authorId": "47013654"
        },
        {
          "name": "E. al.",
          "authorId": "2127440043"
        }
      ],
      "year": 2020,
      "abstract": "\n The role of minerals in Burgess Shale–type fossilization is controversial, particularly that of the clay mineral kaolinite. Kaolinite may have formed on carcasses or attached to them as they decayed, stabilizing organic matter. Alternatively, kaolinite may have formed during metamorphism, playing no role in the preservation of soft tissues. Evaluating the formation and taphonomic role of kaolinite is difficult, because the mineralogy of Burgess Shale–type fossils is incompletely known. We used in situ selected-area X-ray diffraction to constrain the mineralogy of fossils from the classic Burgess Shale Formation in British Columbia, Canada. Fossils can be distinguished from the matrix that surrounds them by the presence of dolomite, kaolinite, and pyrite. Chlorite may be more abundant in the matrix. The preferential survival of kaolinite in association with fossils provides evidence of early diagenetic clay-organic interactions that protected the clay from metamorphic transformation. Kaolinite likely played a crucial role in fossilization, inhibiting the growth of heterotrophic bacteria and aiding polymerization of soft tissue biomolecules. This may result in biases in soft-tissue preservation to areas and times where kaolinite was prevalent.",
      "citationCount": 30,
      "doi": "10.1130/geol.s.13150883.v1",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/8d17196837fd62e1e81fd9f6240e5bb78c6cef0f",
      "venue": "Geology",
      "journal": {
        "name": "Geology"
      },
      "publicationTypes": null
    },
    {
      "paperId": "f92b569eb46715311219e32979975f91851d3ae6",
      "title": "Semantics, Metasemantics, Aboutness",
      "authors": [
        {
          "name": "Ori Simchen",
          "authorId": "2638318"
        }
      ],
      "year": 2017,
      "abstract": null,
      "citationCount": 15,
      "doi": "10.1093/acprof:oso/9780198792147.001.0001",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/f92b569eb46715311219e32979975f91851d3ae6",
      "venue": "",
      "journal": {
        "name": "",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "ee90ff2a2a083dc1fffbcda7dda15e3f9d1f57ac",
      "title": "THE LIMITS OF BURGESS SHALE-TYPE PRESERVATION: ASSESSING THE EVIDENCE FOR PRESERVATION OF THE BLOOD PROTEIN HEMOCYANIN IN THE BURGESS SHALE",
      "authors": [
        {
          "name": "R. Gaines",
          "authorId": "37670089"
        },
        {
          "name": "Alexander J. Lombardo",
          "authorId": "144686875"
        },
        {
          "name": "I. Holzer",
          "authorId": "3829644"
        },
        {
          "name": "Jean‐Bernard Caron",
          "authorId": "17282344"
        }
      ],
      "year": 2019,
      "abstract": "Cambrian deposits bearing exceptional preservation of soft-bodied fossils offer unique insights into the diversity and paleobiology of the Cambrian biota. In recent years, a growing number of studies have provided evidence that highly labile tissues, such as nervous tissues, may be more common in fossils from Burgess Shale-type deposits than previously appreciated. These discoveries have provided novel insights into the anatomy and phylogeny of Cambrian animals and have also challenged the basic understanding of the limits on the resolution of anatomical information that may be captured by Burgess Shale-type preservation. Evidence used to infer primary blood chemistry was recently reported from the iconic Burgess Shale fossil Marrella splendens, the first such report from a Cambrian Lagerstatte. Diminutive crystals of a copper sulfide mineral found in association with Marrella were interpreted as evidence that the animal's blood contained the Cu-bearing protein hemocyanin. Copper minerals in shales in general, and in the Burgess Shale in particular, however, may have a complex geologic history. Using microscopy and SEM-EDS elemental mapping of material from the Walcott Quarry as well as from the Burgess Shale fossil quarry at Marble Canyon, we assess the timing of emplacement of Cu-sulfides in fossil-bearing mudrocks of the Burgess Shale. These data demonstrate that copper minerals are most conspicuously concentrated within veins that are oriented sub-perpendicular to bedding. These late-stage fluid flow paths allowed Cu-mineralizing fluids to infiltrate bedding plane-parallel cracks, which commonly run through Burgess Shale fossils and extend into the matrix around them. Based upon the relationships of mineral phases associated with fossils, it appears that Cu-mineralization occurred after metamorphic volatilization of a large proportion of the carbonaceous material that originally comprised the fossils. We find that copper minerals in the Burgess Shale are of demonstrably post-Cambrian origin, a secondary overprint that cannot be used to infer original blood chemistry or tissue composition of its fossils.",
      "citationCount": 6,
      "doi": "10.2110/PALO.2019.026",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/ee90ff2a2a083dc1fffbcda7dda15e3f9d1f57ac",
      "venue": "Palaios",
      "journal": {
        "name": "PALAIOS"
      },
      "publicationTypes": null
    },
    {
      "paperId": "430a6a8a5f2205c450d84d9187dc590d4121ecdb",
      "title": "Formative research for an innovative digital application to strengthen healthy food access and resilience in food pantries: the Support Application for Food PAntrieS (SAFPAS) study",
      "authors": [
        {
          "name": "Alexis Lightner",
          "authorId": "2303028773"
        },
        {
          "name": "Stacey Williamson",
          "authorId": "2302509158"
        },
        {
          "name": "Samantha M. Sundermeir",
          "authorId": "2124801185"
        },
        {
          "name": "Emma C. Lewis",
          "authorId": "2115634767"
        },
        {
          "name": "Mika Matsuzaki",
          "authorId": "2302505108"
        },
        {
          "name": "Lisa Poirier",
          "authorId": "48895726"
        },
        {
          "name": "Audrey Thomas",
          "authorId": "2303330754"
        },
        {
          "name": "Melissa M. Reznar",
          "authorId": "11486684"
        },
        {
          "name": "Roni Neff",
          "authorId": "2289819475"
        },
        {
          "name": "Daniel J Barnett",
          "authorId": "2353521534"
        },
        {
          "name": "A. T. Oladimeji",
          "authorId": "2280533297"
        },
        {
          "name": "T. Igusa",
          "authorId": "2360173"
        },
        {
          "name": "Veronica Vélez-Burgess",
          "authorId": "2302504958"
        },
        {
          "name": "Noor Attar",
          "authorId": "2303033739"
        },
        {
          "name": "Brooke Gagnon",
          "authorId": "2303033796"
        },
        {
          "name": "Leena Moses",
          "authorId": "2303026721"
        },
        {
          "name": "J. Gittelsohn",
          "authorId": "6763983"
        }
      ],
      "year": 2025,
      "abstract": "ABSTRACT We conducted formative research to inform the design of the mobile Support Application for Food PAntrieS (SAFPAS) app, which digitally integrates and enhances food pantry management, client food choice, and emergency preparedness. In-depth interviews (N = 60) were conducted with coordinators, volunteers, and neighbors in Baltimore, Maryland and Detroit, Michigan. Screen mockups were shown to interviewees to solicit feedback on the form and function of existing and desired features. Overall, participants reacted positively and suggested features for consideration. Concerns centered around accessibility and adaptability of the application. The insights gleaned from this work will inform future development and implementation of SAFPAS nationwide.",
      "citationCount": 0,
      "doi": "10.1080/19320248.2025.2482149",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/430a6a8a5f2205c450d84d9187dc590d4121ecdb",
      "venue": "Journal of Hunger and Environmental Nutrition",
      "journal": {
        "name": "Journal of Hunger & Environmental Nutrition",
        "pages": "750 - 767",
        "volume": "20"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "a7eb85d7ff90fe8839b19c2589bf73439e0ff21b",
      "title": "Differences Among Veterans With Chronic Overlapping Pain Conditions and Other Chronic Pain: Baseline Results From the LAMP Pain Management Trial",
      "authors": [
        {
          "name": "Jenna L. Adamowicz",
          "authorId": "2358088870"
        },
        {
          "name": "Alexis Grant",
          "authorId": "2380483140"
        },
        {
          "name": "C. Calvert",
          "authorId": "2284129092"
        },
        {
          "name": "Daniel Elchert",
          "authorId": "2380481925"
        },
        {
          "name": "Katherine Hadlandsmyth",
          "authorId": "4719069"
        },
        {
          "name": "M. Driscoll",
          "authorId": "2284123312"
        },
        {
          "name": "Stephanie L Taylor",
          "authorId": "2284333245"
        },
        {
          "name": "K. Allen",
          "authorId": "2251278785"
        },
        {
          "name": "Brent C Taylor",
          "authorId": "2284125201"
        },
        {
          "name": "Diana J. Burgess",
          "authorId": "2242878876"
        }
      ],
      "year": 2025,
      "abstract": "Chronic overlapping pain conditions (COPCs) are a constellation of disorders posited to share an underlying pain mechanism (nociplastic pain). Unfortunately, individuals with COPCs are under‐represented in clinical research. The current study aimed to determine COPC prevalence among participants enrolled in a pragmatic clinical trial and compare those with COPCs to those with non‐COPCs across several domains.",
      "citationCount": 0,
      "doi": "10.1002/ejp.70125",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/a7eb85d7ff90fe8839b19c2589bf73439e0ff21b",
      "venue": "European Journal of Pain",
      "journal": {
        "name": "European Journal of Pain",
        "volume": "29"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "3b7bbc2ce65e86ab89b30b62c87a46b307f99eba",
      "title": "Psychosocial workplace hazards and industrial relations: An introduction",
      "authors": [
        {
          "name": "Alexis Vassiley",
          "authorId": "112888088"
        },
        {
          "name": "Tom Barratt",
          "authorId": "2223844892"
        },
        {
          "name": "Kantha Dayaram",
          "authorId": "102191362"
        },
        {
          "name": "John Burgess",
          "authorId": "2238130182"
        }
      ],
      "year": 2025,
      "abstract": "This article introduces the special issue, bringing together research on psychosocial workplace hazards (PSWH) which engages industrial relations (IR) perspectives. This is important as PSWH are increasingly studied and regulated, with new regulatory frameworks creating opportunity and necessity for IR perspectives to engage with PSWH. These hazards are intimately related to power relations between employers, workers and the broader society within which they interact, a topic of longstanding investigation within IR. To date, PSWH research has largely occurred in the work, health and safety (WHS) field, reflecting a broader historical separation between WHS and IR in scholarship and practice. While WHS literature outlines the significance of psychosocial hazards as a public health issue, and proposes solutions for their mitigation, we argue that IR framing, and indeed IR frames of reference, can better explain the existence and promote mitigation of PSWH. In this SI the seven papers provide insights into the history of PSWH study; impact of work conditions on restructuring and PSWH; applying the Pressure, Disorganisation and Regulatory Failure (PDR) model in research on sexual harassment; organisational conditions that contribute to the health risks associated with the work, psychosocial hazards women workers experience due to menstruation in developing countries and union strategies for managing workload of union employees.",
      "citationCount": 0,
      "doi": "10.1177/00221856251326664",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/3b7bbc2ce65e86ab89b30b62c87a46b307f99eba",
      "venue": "Journal of Industrial Relations",
      "journal": {
        "name": "Journal of Industrial Relations",
        "pages": "177 - 201",
        "volume": "67"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "466c7118d3070a1f88a0cd45108a9640e3013eda",
      "title": "MicroVQA: A Multimodal Reasoning Benchmark for Microscopy-Based Scientific Research",
      "authors": [
        {
          "name": "James Burgess",
          "authorId": "2195445745"
        },
        {
          "name": "Jeffrey J. Nirschl",
          "authorId": "2243427503"
        },
        {
          "name": "Laura Bravo-S'anchez",
          "authorId": "2066453653"
        },
        {
          "name": "Alejandro Lozano",
          "authorId": "2282390626"
        },
        {
          "name": "S. Gupte",
          "authorId": "24627399"
        },
        {
          "name": "Jesús G. Galaz-Montoya",
          "authorId": "1401554536"
        },
        {
          "name": "Yuhui Zhang",
          "authorId": "49889860"
        },
        {
          "name": "Yuchang Su",
          "authorId": "2303890937"
        },
        {
          "name": "Disha Bhowmik",
          "authorId": "2350608918"
        },
        {
          "name": "Zachary Coman",
          "authorId": "2350756276"
        },
        {
          "name": "Sarina M. Hasan",
          "authorId": "2350788687"
        },
        {
          "name": "Alexandra Johannesson",
          "authorId": "2327208419"
        },
        {
          "name": "William D. Leineweber",
          "authorId": "16649382"
        },
        {
          "name": "Malvika G Nair",
          "authorId": "2350756782"
        },
        {
          "name": "Ridhi Yarlagadda",
          "authorId": "2350756424"
        },
        {
          "name": "Connor Zuraski",
          "authorId": "2332396014"
        },
        {
          "name": "Wah Chiu",
          "authorId": "2350643586"
        },
        {
          "name": "Sarah Cohen",
          "authorId": "2351186252"
        },
        {
          "name": "J. N. Hansen",
          "authorId": "2329889629"
        },
        {
          "name": "Manuel D. Leonetti",
          "authorId": "2313244006"
        },
        {
          "name": "Chad Liu",
          "authorId": "2350667512"
        },
        {
          "name": "Emma Lundberg",
          "authorId": "2251451265"
        },
        {
          "name": "S. Yeung-Levy",
          "authorId": "2275638250"
        }
      ],
      "year": 2025,
      "abstract": "Scientific research demands sophisticated reasoning over multimodal data, a challenge especially prevalent in biology. Despite recent advances in multimodal large language models (MLLMs) for AI-assisted research, existing multimodal reasoning benchmarks only target up to college-level difficulty, while research-level benchmarks emphasize lower-level perception, falling short of the complex multimodal reasoning needed for scientific discovery. To bridge this gap, we introduce MicroVQA, a visual-question answering (VQA) benchmark designed to assess three reasoning capabilities vital in research workflows: expert image understanding, hypothesis generation, and experiment proposal. MicroVQA consists of 1,042 multiple-choice questions (MCQs) curated by biology experts across diverse microscopy modalities, ensuring VQA samples represent real scientific practice. In constructing the benchmark, we find that standard MCQ generation methods induce language shortcuts, motivating a new two-stage pipeline: an optimized LLM prompt structures question-answer pairs into MCQs; then, an agent-based ‘RefineBot’ updates them to remove shortcuts. Benchmarking on state-of-the-art MLLMs reveal a peak performance of 53%; models with smaller LLMs only slightly underperform top models, suggesting that language-based reasoning is less challenging than multimodal reasoning; and tuning with scientific articles enhances performance. Expert analysis of chain-of-thought responses shows that perception errors are the most frequent, followed by knowledge errors and then overgeneralization errors. These insights highlight the challenges in multimodal scientific reasoning, showing MicroVQA is a valuable resource advancing AI-driven biomedical research. MicroVQA is available here, project here.",
      "citationCount": 13,
      "doi": "10.1109/CVPR52734.2025.01821",
      "arxivId": "2503.13399",
      "url": "https://www.semanticscholar.org/paper/466c7118d3070a1f88a0cd45108a9640e3013eda",
      "venue": "Computer Vision and Pattern Recognition",
      "journal": {
        "name": "ArXiv"
      },
      "publicationTypes": [
        "JournalArticle",
        "Conference"
      ]
    },
    {
      "paperId": "97af91ad945885ee5b3735f25565a1746be33b58",
      "title": "Consultation with health professionals for mental health in Australia in 2020–2022 and changes since 2007: Findings from the 2020–2022 National Study of Mental Health and Wellbeing",
      "authors": [
        {
          "name": "Meredith G. Harris",
          "authorId": "2270247668"
        },
        {
          "name": "Caley Tapp",
          "authorId": "8373120"
        },
        {
          "name": "Joshua Vescovi",
          "authorId": "2319719111"
        },
        {
          "name": "M. Sunderland",
          "authorId": "2240846739"
        },
        {
          "name": "S. Diminic",
          "authorId": "4086920"
        },
        {
          "name": "C. Chapman",
          "authorId": "2282516296"
        },
        {
          "name": "T. Slade",
          "authorId": "2251024787"
        },
        {
          "name": "M. Teesson",
          "authorId": "2261368066"
        },
        {
          "name": "J. Pirkis",
          "authorId": "2237434744"
        },
        {
          "name": "P. Burgess",
          "authorId": "2274245788"
        }
      ],
      "year": 2025,
      "abstract": "Objective: This study aimed to estimate the proportions of Australians aged 16–85 years who consulted health professionals for mental health in 2020–2022, and changes since 2007. Methods: Secondary analysis of merged data from the National Study of Mental Health and Wellbeing in 2020–2022 (N = 15,893) and its 2007 predecessor (N = 8841). Results: In 2020–2022, 17.4% of Australians aged 16–85 years had consulted a health professional (including overnight hospital admission) for their mental health in the past year (vs 11.9% in 2007). The largest increases between the surveys were in use of psychologists (123%), other (non-medical) mental health professionals (64%), and general practitioners (53%). Of adults with a 12-month mental disorder, 46.6% consulted a health professional in 2020–2022 (vs 37.5% in 2007), increasing with severity (mild 22.9%, moderate 48.4% and severe 68.8%). Multivariate regression models showed that consulting a health professional was positively associated with age < 65 years, female sex, being unmarried, disorder severity, and affective or anxiety disorder; these patterns held for consultations with most types of professionals. Socioeconomic and geographical characteristics were associated with consulting particular professionals: lower income (consulting a psychiatrist), high income and living in a major city (psychologist), living in a less disadvantaged area (general practitioner). Increases in consulting were not experienced by all groups (e.g. the likelihood of consulting increased for people aged 16–45 years, but not for older age groups). Conclusion: Consultation with health professionals for mental health improved between 2007 and 2020–2022 but remains below national targets. Some changes may reflect recent service reforms; however, gaps in access persist.",
      "citationCount": 3,
      "doi": "10.1177/00048674241307919",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/97af91ad945885ee5b3735f25565a1746be33b58",
      "venue": "Australian and New Zealand journal of psychiatry (Print)",
      "journal": {
        "name": "The Australian and New Zealand Journal of Psychiatry",
        "pages": "810 - 823",
        "volume": "59"
      },
      "publicationTypes": [
        "JournalArticle",
        "Review"
      ]
    },
    {
      "paperId": "1b879972b2d7522e8543c12c37baa6dc47b725a5",
      "title": "Context flexibly modulates cue representations in visual cortex",
      "authors": [
        {
          "name": "Alexa D Faulkner",
          "authorId": "2251324304"
        },
        {
          "name": "Alvin S Chiu",
          "authorId": "2369618740"
        },
        {
          "name": "Armin Sarabi",
          "authorId": "2369590061"
        },
        {
          "name": "Swathi Karthik",
          "authorId": "2369588796"
        },
        {
          "name": "Yaoxin S Li",
          "authorId": "2370168367"
        },
        {
          "name": "C. Burgess",
          "authorId": "2241388127"
        }
      ],
      "year": 2025,
      "abstract": "Learned sensory cues result in enhanced responses in sensory cortices and, in turn, enhanced responses draw attention towards cues in our environment that guide future decision making. To respond appropriately, one must recognize the cue but also the context. Here we use two-photon imaging in visual cortex as mice learn a visual discrimination task and subsequently experience a change in external context through introduction of a threat stimulus. Stimuli associated with a reward elicit an enhanced response due to newly recruited neurons responding preferentially to the rewarded cue in addition to neurons increasing their response magnitude. Introduction of threat results in a largely separate set of neurons encoding cues, but the maintenance of the enhanced response to a rewarded cue. When the threat is relieved, representations revert to their initial state. These data suggest that external context changes can result in rapid but flexible shifts in the representation of visual cues. How visual cortex neurons encode learned cue-outcome associations with shifts in external context are not fully understood. Here authors use in vivo two-photon calcium imaging in the visual cortex of mice to demonstrate that encoding of learned environmental visual cues is flexibly represented across different task contexts.",
      "citationCount": 2,
      "doi": "10.1038/s41467-025-61314-y",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/1b879972b2d7522e8543c12c37baa6dc47b725a5",
      "venue": "Nature Communications",
      "journal": {
        "name": "Nature Communications",
        "volume": "16"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "d29d5441eaf0931daacd9c3ebc51b46afe58d797",
      "title": "The effect of permanent dipoles on dark states in molecular dimers",
      "authors": [
        {
          "name": "Matthew Freed",
          "authorId": "2376126230"
        },
        {
          "name": "D. Rouse",
          "authorId": "40190985"
        },
        {
          "name": "Andrea Rocco",
          "authorId": "2376126072"
        },
        {
          "name": "Jim Al-Khalili",
          "authorId": "2376126782"
        },
        {
          "name": "Marian Florescu",
          "authorId": "2376125349"
        },
        {
          "name": "Adam Burgess",
          "authorId": "2120696259"
        }
      ],
      "year": 2025,
      "abstract": "Many organic molecules possess large permanent dipole moments that differ depending on the electronic state. These permanent dipoles influence both intermolecular coupling and interactions with the optical fields, yet they are often neglected in typical theoretical quantum optics treatments. Here, we investigate the optical properties and their effect on dark states of dimers possessing such permanent dipoles. We show that when monomers have excitation-dependent permanent dipoles, optical transitions between the bright and dark states of the dimer are enabled. We investigate how permanent dipoles allow for the existence of static driving terms between the ground and excited states of each monomer. In turn, these can cause the excited states of the monomers to couple indirectly to the zero excitation state of the dimer. This leads to interference between permanent and transition dipoles and can result in the formation of dark states that are entirely localised. Furthermore, dark states formed through indirect coupling exhibit enhanced robustness against energy level fluctuations, which may improve the efficiency of the design of photovoltaic devices.",
      "citationCount": 2,
      "doi": "10.1088/1367-2630/ae2a61",
      "arxivId": "2508.11445",
      "url": "https://www.semanticscholar.org/paper/d29d5441eaf0931daacd9c3ebc51b46afe58d797",
      "venue": "New Journal of Physics",
      "journal": {
        "name": "New Journal of Physics",
        "volume": "27"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "67d796da76b8dddc7e36c0d2b5d51aaccc7e7819",
      "title": "At-Home Morning Bright Light Treatment for Chronic Nociplastic Pain: Protocol for a Randomized Clinical Trial",
      "authors": [
        {
          "name": "Helen J. Burgess",
          "authorId": "2252419510"
        },
        {
          "name": "Allie A Rodgers",
          "authorId": "2340501176"
        },
        {
          "name": "Kiley A. McNeil",
          "authorId": "2378284298"
        },
        {
          "name": "Jackson Mott",
          "authorId": "2378290565"
        },
        {
          "name": "Agnes Fejer",
          "authorId": "2340499645"
        },
        {
          "name": "Tori Dereski",
          "authorId": "2378280046"
        },
        {
          "name": "Muneer Rizvydeen",
          "authorId": "4988636"
        },
        {
          "name": "Kimberly T. Sibille",
          "authorId": "2378285655"
        },
        {
          "name": "H. M. Kim",
          "authorId": "2298045982"
        },
        {
          "name": "Cherie Cofield",
          "authorId": "2378282635"
        },
        {
          "name": "John W. Burns",
          "authorId": "2325132948"
        },
        {
          "name": "Sana Shaikh",
          "authorId": "2203139756"
        },
        {
          "name": "A. Hassett",
          "authorId": "3727690"
        }
      ],
      "year": 2025,
      "abstract": "Background Fibromyalgia, the quintessential nociplastic pain condition, affects more than 20 million Americans and results in significant disability, lost productivity, and poor quality of life, with profound individual and societal cost. As pharmacological treatment approaches offer only modest benefits and result in a high rate of discontinuation due to adverse effects, nonpharmacological interventions such as physical therapy, exercise, and cognitive behavioral therapy are recommended. However, cost and access to these treatments can create barriers to care, and engagement can be problematic. Morning bright light treatment is a promising option for improving fibromyalgia symptoms, with early studies indicating clinically meaningful improvements in fibromyalgia symptoms. Objective This study aims to prospectively examine the potential benefits and active elements of morning bright light treatment and sleep timing stabilization for individuals with fibromyalgia in the largest randomized controlled trial to date. Methods We will recruit 390 adults who meet diagnostic criteria for fibromyalgia and report at least mild symptoms. Participants will be randomized to one of three groups: 4 weeks of morning bright light treatment (1 hour per day, using a commercially available Re-timer device), 4 weeks of sleep timing stabilization alone (a component of morning bright light treatment, some benefit anticipated), or 4 weeks of treatment as usual, with equivalent study contact. Patient-reported outcomes of function and pain will be assessed before and after treatment, with mood, sleep quality, and morningness-eveningness examined as potential mediators of treatment effects. Social determinants of health risk will be examined as a potential moderator influencing baseline symptoms, treatment engagement, and treatment response. Results Data collection began in September 2024 and is projected to end in March 2029. Conclusions Morning bright light treatment is well-positioned to be an effective nonpharmacological treatment for fibromyalgia with minimal side effects. The study findings will provide important insights relevant to the development of morning bright light treatment as an accessible treatment for chronic nociplastic pain. Trial Registration ClinicalTrials.gov NCT06567886; https://clinicaltrials.gov/study/NCT06567886 International Registered Report Identifier (IRRID) DERR1-10.2196/75060",
      "citationCount": 1,
      "doi": "10.2196/75060",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/67d796da76b8dddc7e36c0d2b5d51aaccc7e7819",
      "venue": "JMIR Research Protocols",
      "journal": {
        "name": "JMIR Research Protocols",
        "volume": "14"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "242b0d6597725eaca36e71a987668b976ca35007",
      "title": "An Unresolved Environmental Problem—Small-Scale Unattributable Marine Oil Spills in Musandam, Oman",
      "authors": [
        {
          "name": "Amran Al-Kamzari",
          "authorId": "2347826440"
        },
        {
          "name": "Tim Gray",
          "authorId": "2347829766"
        },
        {
          "name": "Clare Fitzsimmons",
          "authorId": "2347831532"
        },
        {
          "name": "J. G. Burgess",
          "authorId": "2347828497"
        }
      ],
      "year": 2025,
      "abstract": "This article discusses unattributable small-scale marine oil spills, particularly focusing on their environmental and socio-economic impacts in Musandam, Oman. There is a research gap in the literature on unattributable small-scale marine oil spills that reflects the lack of attention paid to these minor yet frequent spills, whose perpetrators invariably escape detection and accountability. The research method combines a literature review with extensive fieldwork, including community mapping, key informant interviews, and focus group discussions, to understand the extent, causes, and challenges of untraceable spills. The findings reveal significant ecological damage, economic losses for local fishers and tourism, and systemic issues of untraceability, limited enforcement, and inadequate compensation mechanisms. The article recommends establishing a regional compensation scheme, deploying advanced detection technologies, improving spill reporting, and fostering regional cooperation to enhance spill traceability, upgrade remediation techniques, and obtain redress for affected communities. These recommendations aim to inform policy actions that mitigate environmental risks and uphold environmental justice in the Arabian Gulf region.",
      "citationCount": 1,
      "doi": "10.3390/su17177769",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/242b0d6597725eaca36e71a987668b976ca35007",
      "venue": "Sustainability",
      "journal": {
        "name": "Sustainability"
      },
      "publicationTypes": [
        "JournalArticle",
        "Review"
      ]
    },
    {
      "paperId": "edfadfb595125af9da2442004a460a3ae34431ba",
      "title": "Experimental Manipulation of Polyandry in a Marine Gastropod Reveals How the Number of Mates Affects Reproductive Output, Offspring Size, and the Distribution of Paternity Within Broods",
      "authors": [
        {
          "name": "Alexandra P. Hooks",
          "authorId": "6109392"
        },
        {
          "name": "SC Burgess",
          "authorId": "2309152048"
        }
      ],
      "year": 2025,
      "abstract": "ABSTRACT Polyandry, where females mate with multiple males, often mediates how ecological and evolutionary forces shape populations, with various explanations for why it occurs. However, these explanations often stem from separate studies on model species, field observations, or lab experiments. Given polyandry's potential context‐dependent effects, it is crucial to design studies that concurrently test multiple hypotheses within wild populations. Therefore, we conducted two experiments over 2 years that experimentally manipulated the number of males a female mates with in the marine gastropod, the Florida crown conch ( Melongena corona ). We tested if experimentally increasing polyandry leads to more offspring, larger offspring at hatching, and broods with greater variation in offspring size and higher genetic diversity. We also investigated paternity skew, the effects of mate order, male size, and copulating time on paternity. We genotyped 3157 offspring from 20 mothers to quantify paternity share at hatching. We found that females mating with more males did not produce more offspring or larger offspring than monandrous females at the embryo or hatching stage. However, multiple mating increased within‐brood variation in offspring size at hatching, possibly as a response to exploitative intracapsular competition for oxygen in mixed broods or sire effects. Paternity share within broods at hatching was skewed, rather than evenly distributed, resulting in a lower effective number of sires compared to the number of mates. Paternity share per brood declined with mate order and increased with copulation duration but was unaffected by male size. Overall, the commonly hypothesized consequences of polyandry were not observed in our experiments. Instead, we hypothesize that multiple mating in this species arises from convenience polyandry or mate encounter rates.",
      "citationCount": 0,
      "doi": "10.1002/ece3.71505",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/edfadfb595125af9da2442004a460a3ae34431ba",
      "venue": "Ecology and Evolution",
      "journal": {
        "name": "Ecology and Evolution",
        "volume": "15"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "28dfaf3e6c3b75b9b2c7d19c55969f0ab60b1b26",
      "title": "Implementing a Digital Self‐Management App Can Support the NHS's Green Agenda: A Service Evaluation in a Community Musculoskeletal Physiotherapy Service",
      "authors": [
        {
          "name": "K. Tucker",
          "authorId": "2333565541"
        },
        {
          "name": "A. Braybrooke",
          "authorId": "2344658680"
        },
        {
          "name": "R. Burgess",
          "authorId": "2332059122"
        }
      ],
      "year": 2025,
      "abstract": "Primary care accounts for up to one‐fifth of all NHS carbon emissions, with musculoskeletal (MSK) pain accounting for 14%–20% of all primary care consultations. Digital Health Technologies (DHTs), including self‐management apps, offer a potential solution to help the NHS reduce its carbon footprint.",
      "citationCount": 0,
      "doi": "10.1002/msc.70138",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/28dfaf3e6c3b75b9b2c7d19c55969f0ab60b1b26",
      "venue": "Musculoskeletal Care",
      "journal": {
        "name": "Musculoskeletal Care",
        "volume": "23"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "2d3bee0664706a02a13d5d48b138fe2dca964936",
      "title": "The clinical and cost-effectiveness of sertraline in preventing depression in adults following a traumatic brain injury (STOP-D): study protocol for a multi-centre randomised controlled trial",
      "authors": [
        {
          "name": "Jennifer Burgess",
          "authorId": "2265770911"
        },
        {
          "name": "Khalida Ismail",
          "authorId": "2387954606"
        },
        {
          "name": "V. Raymont",
          "authorId": "2296258597"
        },
        {
          "name": "Richard Emsley",
          "authorId": "2251688715"
        },
        {
          "name": "Nicholas Beckley-Hoelscher",
          "authorId": "2387955344"
        },
        {
          "name": "Jurate Wall",
          "authorId": "2387954268"
        },
        {
          "name": "Michael Dilley",
          "authorId": "2387953899"
        },
        {
          "name": "Aminul I. Ahmed",
          "authorId": "2388028716"
        },
        {
          "name": "Barbara Barrett",
          "authorId": "2387954878"
        },
        {
          "name": "Damien Longson",
          "authorId": "2387958749"
        },
        {
          "name": "Brent Daniel Damian Shu-Jen Meredith Akshay Alex David F Elliott Holsgrove Holliman Leung Martyn Nair Novak",
          "authorId": null
        },
        {
          "name": "Brent Elliott",
          "authorId": "2389096004"
        },
        {
          "name": "Daniel Holsgrove",
          "authorId": "2389161765"
        },
        {
          "name": "Damian Holliman",
          "authorId": "2389159177"
        },
        {
          "name": "Shu-Jen Leung",
          "authorId": "2388763367"
        },
        {
          "name": "Meredith Martyn",
          "authorId": "2389161714"
        },
        {
          "name": "A. Nair",
          "authorId": "2388804575"
        },
        {
          "name": "Alex Novak",
          "authorId": "2388786166"
        },
        {
          "name": "David Okai",
          "authorId": "2389158103"
        },
        {
          "name": "Frazer O’Brien",
          "authorId": "2389162338"
        },
        {
          "name": "Judson Immanuel Paul",
          "authorId": "2388894031"
        },
        {
          "name": "Nicholas Parks",
          "authorId": "2389156751"
        },
        {
          "name": "David Taylor",
          "authorId": "2390443243"
        },
        {
          "name": "Chris Uff",
          "authorId": "2389161712"
        },
        {
          "name": "Gayathri Venkatesan",
          "authorId": "2389159020"
        },
        {
          "name": "Mark Wilson",
          "authorId": "2391957733"
        }
      ],
      "year": 2025,
      "abstract": "Traumatic brain injury (TBI) is a common presentation in emergency departments worldwide. Approximately 1.4 million adults present with TBI in England and Wales annually. Post-TBI depression (PTD) is a common neuropsychiatric consequence, affecting up to 50% of patients within two years, and is associated with adverse functional outcomes. PTD remains underdiagnosed and undertreated. Sertraline, a selective serotonin reuptake inhibitor (SSRI), has shown potential in reducing PTD incidence, yet evidence of its effectiveness in preventing depression from adequately powered trials is lacking. This randomised controlled trial aims to compare the clinical and cost-effectiveness of sertraline in reducing the risk of PTD in adults compared to usual care. The design is a multi-centre, double-blind, placebo-controlled, randomised controlled trial (RCT) aiming to recruit 514 participants. Eligible adults (aged ≥ 18 years) with possible, mild or moderate-severe TBI within eight weeks of injury and without current major depressive disorder (MDD) are randomly assigned to receive sertraline (100 mg daily) or placebo for 12 months. The primary outcome is depressive symptom severity at 12 months, measured using the Patient Health Questionnaire-9. Secondary outcomes include incidence rates of major depressive disorder, psychiatric comorbidities, cognitive impairment, substance use, carer burden, productivity and cost-effectiveness at 6, 12 and 18 months. This is the first adequately powered RCT to investigate sertraline as a preventive intervention for PTD. Findings will help inform whether prescribing an SSRI soon after a TBI may reduce the risk of depression and improve functional outcomes. This study is registered in the European Union Drug Regulating Authorities Clinical Trials Database (EudraCT no. 2022–000072-18, date: 7 January 2022) and the ISRCTN – The UK’s Clinical Study Registry (ISRCTN no. 17518945, date: 23 December 2022, https://www.isrctn.com/ISRCTN17518945).",
      "citationCount": 0,
      "doi": "10.1186/s13063-025-09027-x",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/2d3bee0664706a02a13d5d48b138fe2dca964936",
      "venue": "Trials",
      "journal": {
        "name": "Trials",
        "volume": "26"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "d71a6a91ea458494704556f2847993b6b849a69b",
      "title": "ASPIRE-to-excellence: A framework for developing innovative and inspirational approaches to health professions education.",
      "authors": [
        {
          "name": "Elizabeth K Kachur",
          "authorId": "2393905518"
        },
        {
          "name": "M. McLean",
          "authorId": "2261270846"
        },
        {
          "name": "V. Nadarajah",
          "authorId": "4523959"
        },
        {
          "name": "David R Brown",
          "authorId": "2270276413"
        },
        {
          "name": "Alexandra-Aurora Dumitra",
          "authorId": "2393905013"
        },
        {
          "name": "Heeyoung Han",
          "authorId": "2290070545"
        },
        {
          "name": "S. Goeschl",
          "authorId": "2133459415"
        },
        {
          "name": "Harm Peters",
          "authorId": "2261763914"
        },
        {
          "name": "Tomáš Petras",
          "authorId": "2367572077"
        },
        {
          "name": "Sadaf Khan",
          "authorId": "2394117335"
        },
        {
          "name": "Annette Burgess",
          "authorId": "2241419391"
        }
      ],
      "year": 2025,
      "abstract": "This article describes a framework to assist individuals and teams who prepare for (or are engaged in) health professions education innovations. The four essential elements are Needs Assessment, Planning, Implementation and Programme Evaluation. Each element is described in detail with a series of questions to contemplate, and to ensure that all key steps are sufficiently covered. While it is helpful to use this process at the beginning of a project, it will be necessary to develop a continuing cycle of reflection. Needs change and a rapid quality improvement cycle will help maintain relevance and thus effectiveness. It will promote dissemination to inspire educators at the same or other institutions. The four-element framework was developed by the ASPIRE-to-Excellence Award Panel and Academy Section for Innovative and Inspirational Approaches to Health Professions Education (I&I). Examples from 11 awardees from four continents are provided. They illustrate innovative and inspirational work that can stimulate more progress in the field.",
      "citationCount": 0,
      "doi": "10.1080/0142159X.2025.2586639",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/d71a6a91ea458494704556f2847993b6b849a69b",
      "venue": "Medical Teacher",
      "journal": {
        "name": "Medical teacher",
        "pages": "\n          1-12\n        "
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "8543b10d73f37ea1af083e6216f441a87e26f06c",
      "title": "A decade of precursory seismicity at Mauna Loa: 2013–2022",
      "authors": [
        {
          "name": "W. Thelen",
          "authorId": "3478103"
        },
        {
          "name": "A. Hotovec-Ellis",
          "authorId": "1403790605"
        },
        {
          "name": "Jefferson C. Chang",
          "authorId": "2345669489"
        },
        {
          "name": "P. Dotray",
          "authorId": "107783336"
        },
        {
          "name": "Ninfa Bennington",
          "authorId": "2274597931"
        },
        {
          "name": "Arthur D. Jolly",
          "authorId": "2345501584"
        },
        {
          "name": "A. Iezzi",
          "authorId": "46226907"
        },
        {
          "name": "Brian Shiro",
          "authorId": "2239906874"
        },
        {
          "name": "Matthew K. Burgess",
          "authorId": "2377719451"
        }
      ],
      "year": 2025,
      "abstract": null,
      "citationCount": 0,
      "doi": "10.1007/s00445-025-01860-x",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/8543b10d73f37ea1af083e6216f441a87e26f06c",
      "venue": "Bulletin of Volcanology",
      "journal": {
        "name": "Bulletin of Volcanology",
        "volume": "87"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "d0c32436c302edce0d8ee955cf0f719ce45c9a0c",
      "title": "Understanding How Marginal National Video Game Industries Differ",
      "authors": [
        {
          "name": "Jacqueline Burgess",
          "authorId": "2282341631"
        },
        {
          "name": "Elina Roinoti",
          "authorId": "2368282534"
        },
        {
          "name": "Alexander Muscat",
          "authorId": "2307689426"
        },
        {
          "name": "Anthony Grace",
          "authorId": "2307690471"
        },
        {
          "name": "Christian Jones",
          "authorId": "2321689577"
        }
      ],
      "year": 2025,
      "abstract": "This article compares small (19 employees or fewer) video game developers’ commercial and creative mindsets in three marginal video game industries, Australia, New Zealand, and Greece, to understand how these industries differ. Semi-structured interviews were conducted with 62 participants across the three countries and analysed using thematic analysis. Despite all three national industries’ marginal status, there were similarities and clear differences in how the participant developers approached video game production. In particular, the lack of institutional support available for the Greek industry resulted in developers utilising networks and reputation. The research highlights how marginal, national video game industries cannot be simply grouped together because the developers within them display differences, as a result of their industry contexts, which influence and impact their video game development. These findings have implications for support from governments and education.",
      "citationCount": 0,
      "doi": "10.1177/15554120251349312",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/d0c32436c302edce0d8ee955cf0f719ce45c9a0c",
      "venue": "Games and Culture : A Journal of Interactive Media",
      "journal": {
        "name": "Games and Culture"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    }
  ],
  "count": 20,
  "errors": []
}
