{
  "status": "success",
  "source": "semantic_scholar",
  "query": "metasemantics philosophy language",
  "results": [
    {
      "paperId": "37786d01262d40b1b8e0e877332e29e029b97d8c",
      "title": "Meaning in Linguistic Interaction: Semantics, Metasemantics, Philosophy of Language",
      "authors": [
        {
          "name": "K. Jaszczolt",
          "authorId": "118369893"
        }
      ],
      "year": 2016,
      "abstract": null,
      "citationCount": 72,
      "doi": "10.1093/acprof:oso/9780199602469.001.0001",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/37786d01262d40b1b8e0e877332e29e029b97d8c",
      "venue": "",
      "journal": {
        "name": "",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "c3aa93bd1fd30fc5fa4b27356188bba68f435b5a",
      "title": "Meaning in Linguistic Interaction: Semantics, Metasemantics, Philosophy of Language",
      "authors": [
        {
          "name": "E. Corazza",
          "authorId": "2289978"
        }
      ],
      "year": 2017,
      "abstract": null,
      "citationCount": 1,
      "doi": "10.1016/J.PRAGMA.2017.11.003",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/c3aa93bd1fd30fc5fa4b27356188bba68f435b5a",
      "venue": "",
      "journal": {
        "name": "Journal of Pragmatics",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "92a498811b73b8b843813c145859f601e2125766",
      "title": "Jaszczolt, Kasia M.: Meaning in linguistic interaction: Semantics, metasemantics, philosophy of language.",
      "authors": [
        {
          "name": "Prashant Parikh",
          "authorId": "114339933"
        }
      ],
      "year": 2017,
      "abstract": null,
      "citationCount": 1,
      "doi": "10.1515/flin-2017-0010",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/92a498811b73b8b843813c145859f601e2125766",
      "venue": "",
      "journal": {
        "name": "Folia Linguistica",
        "pages": "301 - 307",
        "volume": "51"
      },
      "publicationTypes": null
    },
    {
      "paperId": "0c53d679ea5749a0040d6e26b00c892848ea59a4",
      "title": "Review of Jaszczolt, Kasia M. (2016) Meaning in Linguistic Interaction: Semantics, Metasemantics, Philosophy of Language",
      "authors": [
        {
          "name": "Guocai Zeng",
          "authorId": "51161998"
        }
      ],
      "year": 2017,
      "abstract": null,
      "citationCount": 0,
      "doi": "10.1075/IS.18.2.08ZEN",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/0c53d679ea5749a0040d6e26b00c892848ea59a4",
      "venue": "",
      "journal": {
        "name": "Interaction Studies",
        "pages": "299-302",
        "volume": "18"
      },
      "publicationTypes": [
        "Review"
      ]
    },
    {
      "paperId": "bbf5882d8a87e574c2eb9aac4ab27be1329e69b9",
      "title": "Meaning in Linguistic Interaction: Semantics, Metasemantics, and Philosophy of Language",
      "authors": [
        {
          "name": "A. Capone",
          "authorId": "144718988"
        }
      ],
      "year": 2017,
      "abstract": null,
      "citationCount": 9,
      "doi": "10.1080/07268602.2016.1209805",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/bbf5882d8a87e574c2eb9aac4ab27be1329e69b9",
      "venue": "",
      "journal": {
        "name": "Australian Journal of Linguistics",
        "pages": "533 - 537",
        "volume": "37"
      },
      "publicationTypes": [
        "Review"
      ]
    },
    {
      "paperId": "d4bc96f3bf72d611b8ee5527d280850c683f8eba",
      "title": "Foundations for Metasemantics",
      "authors": [
        {
          "name": "Daniel Cohnitz",
          "authorId": "70043750"
        },
        {
          "name": "Jussi Haukioja",
          "authorId": "103143252"
        }
      ],
      "year": 2025,
      "abstract": "\n Metasemantics studies the foundations of meaning, asking what makes it the case that certain words have the meanings that they do. But what makes metasemantic theories true? This question has been all but ignored in philosophy of language. In this book, Cohnitz and Haukioja address this issue and argue that just as in metasemantics, both internalist and externalist answers are available for this foundational question.\n The authors introduce and defend meta-internalism, arguing that the foundations of reference and meaning are anchored in the individual dispositions and psychological states of language users, offering an alternative to meta-externalist views that would appeal to broader community-based or otherwise external factors. Meta-internalism is, moreover, compatible with semantic externalism as usually understood, and provides an explanation of why externalism is true. Through a critical examination of prominent theories and thought experiments, the book explores fundamental issues like reference failure, conceptual engineering, and the metaphysical implications of reference, as well as the methodology of theories of reference. With its focus on the foundations of metasemantics, the book provides a fresh and empirically informed perspective on one of the core questions in the philosophy of language. Foundations for Metasemantics is essential reading for philosophers, scholars, and students seeking to understand the underlying principles that support our theories of meaning and reference.",
      "citationCount": 2,
      "doi": "10.1093/9780191915925.001.0001",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/d4bc96f3bf72d611b8ee5527d280850c683f8eba",
      "venue": "",
      "journal": null,
      "publicationTypes": [
        "Book"
      ]
    },
    {
      "paperId": "6106417002c0edd9717e3e191733e1dce297ac80",
      "title": "Metasemantics and Possible Expressions",
      "authors": [],
      "year": 2024,
      "abstract": "Foundational theories of meaning, and the broader metasemantic projects they contribute to, promise to answer the seemingly simple yet intractable question of what meaning consists in and where it comes from. Naturally, they build upon expressions that we already know and recognize to develop their positions. This focus on language as we know it, however, leaves aside the no less significant matter of language in terms of possible expressions – the strange and distant expanses of language beyond our everyday stock of expressions.\nThis work sets out to explore possibilities in the context of the meaning of simple expressions. In the process, words, phrases, and sentences are thoroughly explicated as types of expressions before being leveraged to engineer unique and unusual possible words. These exotic possibilities are then confronted with two major positions on meaning in philosophy, introducing novel difficulties and suggesting the significance of this otherwise neglected perspective on language.",
      "citationCount": 0,
      "doi": "10.3726/b22214",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/6106417002c0edd9717e3e191733e1dce297ac80",
      "venue": "",
      "journal": null,
      "publicationTypes": null
    },
    {
      "paperId": "86286186820e72054fd848c4237c41f2ec3bfa69",
      "title": "Semantics and Metasemantics in the Brentano School",
      "authors": [
        {
          "name": "D. G. Mironov",
          "authorId": "2124441438"
        }
      ],
      "year": 2022,
      "abstract": "The article analyzes a semantic theory proposed by the main representatives of the Brentano School and clarifies the characteristic features of the Brentanist philosophy of language. The first section identifies the specificity of Brentano’s functional approach to language, and separately examines how Brentano de­fined the communicative meaning of expressions. The second section reproduces the scheme in accordance with which A. Marty studied language communica­tion, and also discusses in detail his method of descriptive analysis of meanings. On the example of the doctrine of the inner linguistic form, it is shown what in­fluence descriptive psychology had on semantic research. On the example of the doctrine of the judgmental content it is demonstrated how Marty explained the representative properties of expressions. In the third section, A. Meinong’s semantic theory is reconstructed. It is discussed how Meinong interpreted the se­miotics of E. Martinak and how he approached the issue of defining the concept of meaning. The problem of the unity of sentences is particularly analyzed and Meinong’s solution is reproduced. It is shown what changes Meinong made to the theory of meaning, and what influence the theory of incomplete objects had on his semantic doctrine. The interpretation and evaluation of Meinong’s late semantic theory is proposed. Finally, in the fourth section, E. Husserl’s the­ory of meaning is analyzed. It is shown that Husserl distinguished several senses of the concept of meaning and considered the main sense to be the one that al­lows identifying the concept of meaning with the concept of content. The clarifi­cations made by Husserl to the thesis of the ideality of meanings are discussed. It is demonstrated that the new concept of meaning analysis associated with the clarified thesis makes it possible to evaluate Husserl's semantic theory as more universal than Meinong’s theory.",
      "citationCount": 0,
      "doi": "10.21146/0042-8744-2022-10-166-175",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/86286186820e72054fd848c4237c41f2ec3bfa69",
      "venue": "Voprosy filosofii",
      "journal": {
        "name": "Voprosy Filosofii"
      },
      "publicationTypes": null
    },
    {
      "paperId": "db138cf47debe2603c5f051473f34bfb9efa26a4",
      "title": "Metasemantics and Metapragmatics: Philosophical Foundations of Meaning",
      "authors": [
        {
          "name": "K. Jaszczolt",
          "authorId": "118369893"
        }
      ],
      "year": 2021,
      "abstract": null,
      "citationCount": 4,
      "doi": "10.1017/9781108698283.008",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/db138cf47debe2603c5f051473f34bfb9efa26a4",
      "venue": "The Cambridge Handbook of the Philosophy of Language",
      "journal": {
        "name": "The Cambridge Handbook of the Philosophy of Language"
      },
      "publicationTypes": null
    },
    {
      "paperId": "8398d52ae0d6f5360b32cd2ee7c780da1667f30c",
      "title": "Metasemantics: A Normative Perspective (and the Case of Mood)",
      "authors": [
        {
          "name": "M. García‐Carpintero",
          "authorId": "1403820192"
        }
      ],
      "year": 2021,
      "abstract": null,
      "citationCount": 3,
      "doi": "10.1017/9781108698283.023",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/8398d52ae0d6f5360b32cd2ee7c780da1667f30c",
      "venue": "The Cambridge Handbook of the Philosophy of Language",
      "journal": {
        "name": "The Cambridge Handbook of the Philosophy of Language"
      },
      "publicationTypes": null
    },
    {
      "paperId": "74da6d880342fa8c3ead46770e90db3e4d30fce1",
      "title": "Realism, Metasemantics, and Risk",
      "authors": [
        {
          "name": "Billy Dunaway",
          "authorId": "102553543"
        }
      ],
      "year": 2021,
      "abstract": "\n \n \nIt is often claimed that realism about normativity entails that it is difficult for us to know anything about it. I refine this thought by characterizing realism as a thesis which is committed to explaining a semantic thesis about possible uses of normative language: that normative terms like ‘ought’ are semantically stable, in the sense that the term refers to the same property even if it is used differently. There are independent arguments which show that a realist view, if it is plausible, should entail semantic stability for ‘ought’. In this paper I argue that, if the realist succeeds in explaining semantic stability, the realist view implies that normative beliefs will be at risk of being false, and hence not knowledge. Central to this argument is a phenomenon I call meta-semantic risk. I argue that the phenomenon of meta-semantic risk gives rise to a significant dose of normative skepticism for the realist, but it does not entail wholesale skepticism, since the epistemic threats are only contingent, and threatens only precise normative beliefs. I close by sketching two arguments that may show that even this limited form of skepticism counts significantly against the realist view. \n \n \n",
      "citationCount": 0,
      "doi": "10.26556/jesp.v20i3.1010",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/74da6d880342fa8c3ead46770e90db3e4d30fce1",
      "venue": "Journal of Ethics and Social Philosophy",
      "journal": {
        "name": "Journal of Ethics and Social Philosophy"
      },
      "publicationTypes": null
    },
    {
      "paperId": "5e8b677dc2be83b5da51c42d0fb39db31927aeb6",
      "title": "Conceptual Engineering, Topics, Metasemantics, and Lack of Control",
      "authors": [
        {
          "name": "H. Cappelen",
          "authorId": "2944535"
        }
      ],
      "year": 2020,
      "abstract": "Conceptual engineering is now a central topic in contemporary philosophy. Just 4-5 years ago it wasn’t. People were then engaged in the engineering of various philosophical concepts (in various sub-disciplines), but typically not self-consciously so. Qua philosophical method, conceptual engineering was under-explored, often ignored, and poorly understood. In my lifetime, I have never seen interest in a philosophical topic grow with such explosive intensity. The sociology behind this is fascinating and no doubt immensely complex (and an excellent case study for those interested in the dynamics of academic disciplines). That topic, however, will have to wait for another occasion. Suffice it to say that if ​ Fixing Language ​ ( ​ FL ​ ) contributed even a little bit to this change of focus in philosophical methodology, it would have achieved one of its central goals. In that connection, it is encouraging that the papers in this symposium are in fundamental agreement about the significance and centrality of conceptual engineering to philosophy. That said, the goal of ​ FL ​ was not ​ only ​ to advocate for a topic, but also to defend a particular approach to it: The Austerity Framework. These replies have helped me see clearer the limitations of that view and points where my presentation was suboptimal. The responses below are in part a reconstruction of what I had in mind while writing the book and in part an effort to ameliorate. I’m grateful to the symposiasts for helping me get a better grip on these very hard issues.",
      "citationCount": 9,
      "doi": "10.1017/can.2020.8",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/5e8b677dc2be83b5da51c42d0fb39db31927aeb6",
      "venue": "Canadian Journal of Philosophy",
      "journal": {
        "name": "Canadian Journal of Philosophy",
        "pages": "594 - 605",
        "volume": "50"
      },
      "publicationTypes": null
    },
    {
      "paperId": "415ba14466db19eed79070096ce20dad522b23ae",
      "title": "Language without information exchange",
      "authors": [
        {
          "name": "Jessica Keiser",
          "authorId": "115792080"
        }
      ],
      "year": 2020,
      "abstract": "This paper attempts to revive a once-lively program in the philosophy of language — that of reducing linguistic phenomena to facts about mental states and actions. I argue that recent skepticism toward this project is gen-erated by features of traditional implementations of the project, rather than the project itself. A picture of language as essentially a mechanism for cooperative information exchange attracted theorists to metasemantic accounts grounding language use in illocutionary action (roughly, using an utterance to elicit a propositional attitude). When this picture is rejected, a metasemantics grounding language in locutionary action (using an utterance to direct attention) emerges as a more viable proposal, dissolving an intractable issue for traditional theories: the metasemantics of subsentential expressions.",
      "citationCount": 5,
      "doi": "10.1111/mila.12303",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/415ba14466db19eed79070096ce20dad522b23ae",
      "venue": "Mind & Language",
      "journal": {
        "name": "Mind & Language"
      },
      "publicationTypes": null
    },
    {
      "paperId": "921cd823c7b7d9d7cd0c08d4a15747776f995a9d",
      "title": "Rigidity, natural kind terms, and metasemantics",
      "authors": [
        {
          "name": "Corine Besson",
          "authorId": "3478031"
        }
      ],
      "year": 2010,
      "abstract": null,
      "citationCount": 8,
      "doi": "10.4324/9780203852330-6",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/921cd823c7b7d9d7cd0c08d4a15747776f995a9d",
      "venue": "",
      "journal": {
        "name": "",
        "pages": "33-53",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "a414f8a915d14224ebf27b2bc9ec42987441f773",
      "title": "Rules and Meaning in Quantum Mechanics",
      "authors": [
        {
          "name": "Iulian D. Toader",
          "authorId": "26948585"
        }
      ],
      "year": 2023,
      "abstract": "This book concerns the metasemantics of quantum mechanics (QM). Roughly, it pursues an investigation at the intersection of philosophy of physics and philosophy of language, and it offers a critical analysis of rival explanations of the semantic facts of standard QM. Two problems for such explanations are discussed: categoricity and permanence. New results include 1) a reconstruction of Einstein's incompleteness argument, which concludes that a local, separable, and categorical QM cannot exist, 2) a reinterpretation of Bohr's principle of correspondence, grounded in the principle of permanence, 3) a meaning-variance argument for quantum logic, which follows a line of critical reflections initiated by Weyl, and 4) an argument for semantic indeterminacy leveled against inferentialism about QM, inspired by Carnap's work in the philosophy of classical logic.",
      "citationCount": 1,
      "doi": "10.1007/978-3-031-89342-1",
      "arxivId": "2310.14634",
      "url": "https://www.semanticscholar.org/paper/a414f8a915d14224ebf27b2bc9ec42987441f773",
      "venue": "European Studies in Philosophy of Science",
      "journal": {
        "name": "European Studies in Philosophy of Science"
      },
      "publicationTypes": [
        "Book"
      ]
    },
    {
      "paperId": "dada621e5b056f6d439fbebd4268156008ff279d",
      "title": "Is Relaxed Realism a Genuinely Novel View?",
      "authors": [
        {
          "name": "P. Karimi",
          "authorId": "1388991498"
        }
      ],
      "year": 2021,
      "abstract": "In this paper I argue that relaxed realism can answer questions about normative language and thought without collapsing into one of the familiar views in the literature or becoming implausible. More specifically, contrary to Michael Ridge, I argue that relaxed realists can use an inferentialist approach to metasemantics without their view collapsing into naturalism or quasi-realism. The inferentialist account that I propose is that the role of normative expressions involves language-entry transitions construed as rational intuitions and language-exit transitions explained in terms of rational agency. I argue that this account fits with relaxed realism and keeps the view distinct from naturalism, quasi-realism, and other familiar views in the literature.",
      "citationCount": 4,
      "doi": "10.5840/jphil20211181039",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/dada621e5b056f6d439fbebd4268156008ff279d",
      "venue": "Journal of Philosophy",
      "journal": {
        "name": "The Journal of Philosophy"
      },
      "publicationTypes": null
    },
    {
      "paperId": "88138b3846e67364a8bbd7bd6bc39b9ae2f0e3ec",
      "title": "The Role of Naturalness in Lewis's Theory of Meaning",
      "authors": [
        {
          "name": "B. Weatherson",
          "authorId": "2168705"
        }
      ],
      "year": 2013,
      "abstract": "Many writers have held that in his later work, David Lewis adopted a theory of predicate meaning such that the meaning of a predicate is the most natural property that is (mostly) consistent with the way the predicate is used. That orthodox interpretation is shared by both supporters and critics of Lewis's theory of meaning, but it has recently been strongly criticised by Wolfgang Schwarz. In this paper, I accept many of Schwarze's criticisms of the orthodox interpretation, and add some more. But I also argue that the orthodox interpretation has a grain of truth in it, and seeing that helps us appreciate the strength of Lewis's late theory of meaning. References T. Bays. The Problem with Charlie: Some Remarks on Putnam, Lewis and Williams. Philosophical Review 116:401–425, 2007. http://dx.doi.org/10.1215/00318108-2007-003 J. Hawthorne. Craziness and Metasemantics. Philosophical Review 116:427–440, 2007. http://dx.doi.org/10.1215/00318108-2007-004 R. Holton. David Lewis's Philosophy of Language. Mind and Language 18:286-295, 2003. http://dx.doi.org/10.1111/1468-0017.00228 D. Lewis. Convention: A Philosophical Study. Cambridge, Harvard University Press, 1969. D. Lewis. Radical Interpretation. Synthese 27:331–344, 1974. http://dx.doi.org/10.1007/BF00484599 D. Lewis. Languages and Language. In Minnesota Studies in the Philosophy of Science, 7:3–35. Minneapolis: University of Minnesota Press, 1975. D. Lewis. Attitudes De Dicto and De Se. Philosophical Review 88: 513–543, 1979. http://dx.doi.org/10.2307/2184843 D. Lewis. Mad Pain and Martian Pain. In Ned Block, editor, Readings in the Philosophy of Psychology, pages 216-232. Cambridge: Harvard University Press, 1980. D. Lewis. New Work for a Theory of Universals. Australasian Journal of Philosophy 61: 343–377, 1983. http://dx.doi.org/10.1080/00048408312341131 D. Lewis. Putnam's Paradox. Australasian Journal of Philosophy 62: 221-236, 1984. http://dx.doi.org/10.1080/00048408412340013 D. Lewis. On the Plurality of Worlds. Oxford: Blackwell Publishers, 1986. D. Lewis. Meaning without Use: Reply to Hawthorne. Australasian Journal of Philosophy 70: 106-110, 1992. http://dx.doi.org/10.1080/00048408112340093 D. Lewis.. Reduction of Mind. In Samuel Guttenplan, editor, A Companion to the Philosophy of Mind, pages 412–431. Oxford: Blackwell, 1994. Reprinted in Lewis 1999. References to reprint. D. Lewis. Papers in Metaphysics and Epistemology. Cambridge: Cambridge University Press, 1999. http://dx.doi.org/10.1017/CBO9780511625343 W. Schwarz. Lewisian Meaning without Naturalness. Unpublished manuscript, 2006. W. Schwarz. David Lewis: Metaphysik und Analyse. Paderborn: Mentis-Verlag, 2009. T. Sider. Criteria of Personal Identity and the Limits of Conceptual Analysis. Philosophical Perspectives 15: 189–209, 2001a. T. Sider. Four-Dimensionalism. Oxford: Oxford University Press, 2001b. http://dx.doi.org/10.1093/019924443X.001.0001 T. Sider. Writing the Book of the World. Oxford: Oxford University Press, 2012. PMCid:3539916 R. Stalnaker. Lewis on Intentionality. Australasian Journal of Philosophy 82: 199–212, 2004. http://dx.doi.org/10.1080/713659796 B. Weatherson. What Good Are Counterexamples?. Philosophical Studies 115: 1-31, 2003. http://dx.doi.org/10.1023/A:1024961917413 B. Weatherson. Vagueness as Indeterminacy. In Richard Dietz and Sebastiano Moruzzi, editors, Cuts and Clouds: Vaguenesss, its Nature and its Logic, pages 77–90. Oxford: Oxford University Press, 2010. http://dx.doi.org/10.1093/acprof:oso/9780199570386.003.0005 J. R. G. Williams. Eligibility and Inscrutability. Philosophical Review 116: 361-399, 2007. http://dx.doi.org/10.1215/00318108-2007-002",
      "citationCount": 39,
      "doi": "10.4148/JHAP.V1I10.1620",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/88138b3846e67364a8bbd7bd6bc39b9ae2f0e3ec",
      "venue": "",
      "journal": {
        "name": "",
        "volume": "1"
      },
      "publicationTypes": [
        "Review"
      ]
    },
    {
      "paperId": "d6fcb8e45f67dc981a5c90b0e38ad8b797f23339",
      "title": "Words by Convention",
      "authors": [
        {
          "name": "Gail Leckie",
          "authorId": "122648622"
        },
        {
          "name": "R. Williams",
          "authorId": "2116648808"
        }
      ],
      "year": 2019,
      "abstract": "Existing metasemantic projects presuppose that word- (or sentence-) types are part of the non-semantic base. This paper proposes a new strategy: an endogenous account of word types, that is, one where word types are fixed as part of the metasemantics. On this view, it is the conventions of truthfulness and trust that ground not only the meaning of the words (meaning by convention) but also what the word type is of each particular token utterance (words by convention). The same treatment extends to identifying the populations through which the conventions prevail. The paper considers whether this proposal leads to new underdetermination challenges for metasemantics, and makes a case that it does not.",
      "citationCount": 2,
      "doi": "10.1093/oso/9780198836568.003.0003",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/d6fcb8e45f67dc981a5c90b0e38ad8b797f23339",
      "venue": "Oxford Studies in Philosophy of Language Volume 1",
      "journal": {
        "name": "Oxford Studies in Philosophy of Language Volume 1"
      },
      "publicationTypes": null
    },
    {
      "paperId": "c8ab05a6ef07ffd808f3c94981c1c9ec9e2c4f23",
      "title": "There's Glory for You!",
      "authors": [
        {
          "name": "J. Ketland",
          "authorId": "2958104"
        }
      ],
      "year": 2013,
      "abstract": null,
      "citationCount": 0,
      "doi": "10.1017/S0031819113000739",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/c8ab05a6ef07ffd808f3c94981c1c9ec9e2c4f23",
      "venue": "Philosophy",
      "journal": {
        "name": "Philosophy",
        "pages": "3 - 29",
        "volume": "89"
      },
      "publicationTypes": null
    },
    {
      "paperId": "74b775d9a4a5ffb994df5275f288fb1cd3c39b59",
      "title": "Language-games philosophy: Language-games as rationality and method",
      "authors": [
        {
          "name": "M. Peters",
          "authorId": "40114208"
        }
      ],
      "year": 2020,
      "abstract": "Rationality is a matter of making allowed moves within language games. Imagination creates the games that reason proceeds to play. Then, exemplified by people such as Plato and Newton, it keeps mod...",
      "citationCount": 7,
      "doi": "10.1080/00131857.2020.1821190",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/74b775d9a4a5ffb994df5275f288fb1cd3c39b59",
      "venue": "Educational Philosophy and Theory",
      "journal": {
        "name": "Educational Philosophy and Theory",
        "pages": "1929 - 1935",
        "volume": "54"
      },
      "publicationTypes": null
    },
    {
      "paperId": "adbdb920c47b15debc00f0d6e0f8e207f0f13d8f",
      "title": "PHILOSOPHY, LANGUAGE AND MALAY THOUGHT IN THE LYRICS BANGAU OH BANGAU AND BURUNG KENEK-KENEK",
      "authors": [
        {
          "name": "Farra Humairah Mohd",
          "authorId": "116645895"
        },
        {
          "name": "Nordiana Hamzah",
          "authorId": "147671401"
        },
        {
          "name": "Hasrina Baharum",
          "authorId": "120370223"
        }
      ],
      "year": 2019,
      "abstract": "The Malay mind is explicitly and implicitly expressed in the works of Malay literature. The thinking in the lyrics of folk songs, in particular, those of “Bangau Oh Bangau” and “Burung Kenek-Kenek”, give emphasis to social and moral values as well as the role of custom in community lives. These songs draw attention to the Malay philosophy that is related to metaphysics, epistemology, ethics, logic and aesthetic through their interaction with nature as well as the surrounding plant and animal kingdoms. This study aims to identify the philosophy, language and thinking in the lyrics of “Bangau Oh Bangau” and “Burung Kenek-Kenek” by employing the Sapir-Whorf hypothesis. The quantitative method employed in the present study is the text analysis method. The study has identified four Malay philosophy and thinking in “Bangau Oh Bangau”: sarcasm with regard to the culture of shifting the blame, sarcasm concerning the indifferent attitude of the society, sincerity in action or planning, and philosophy or principle of life. The philosophy and thinking in the lyrics for “Burung Kenek-kenek” encourage one to strive for piousness, filial piety and noble character (humility). The study has also shown the link between philosophy, language, and thoughts in the lyrics of Malay songs, in particular, “Bangau Oh Bangau” and “Burung Kenek-Kenek”, as stated in the Sapir-Whorf hypothesis. In summary, analysis of the lyrics of “Bangau Oh Bangau” and “Burung Kenek-Kenek” has brought into the open the superiority of Malay thinking and creativity in composing the lyrics of Malay songs that are inspired by nature.",
      "citationCount": 2,
      "doi": "10.35631/IJHPL.26002",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/adbdb920c47b15debc00f0d6e0f8e207f0f13d8f",
      "venue": "International Journal of Humanities Philosophy and Language",
      "journal": {
        "name": "International Journal of Humanities, Philosophy and Language"
      },
      "publicationTypes": null
    },
    {
      "paperId": "593e4d64b08e1393011bf62f10fb78c2b58649a9",
      "title": "Philosophy of Language in Digital Age: Rethinking Communication and Meaning",
      "authors": [
        {
          "name": "Ramanathan Srinivasan",
          "authorId": "2394657676"
        },
        {
          "name": "P. S. Aithal",
          "authorId": "2392113824"
        }
      ],
      "year": 2025,
      "abstract": "Purpose: The digital age has transformed the way humans use, interpret, and experience language. Traditional philosophical concerns—such as meaning, reference, truth, and communication—must now be re-examined in the context of new linguistic practices shaped by digital technologies. Social media platforms, artificial intelligence, emojis, memes, and algorithm-driven interactions have introduced novel forms of expression that challenge conventional theories of semantics and pragmatics. This paper explores the philosophical implications of digital communication, focusing on how meaning is constructed, negotiated, and altered in virtual spaces. It examines the interplay between brevity and nuance in online discourse, the impact of anonymity and identity fluidity on speech acts, and the ethical dimensions of language mediated by algorithms. \nResults/Analysis: The digital age has not only revolutionized the tools of communication but also redefined the very nature of linguistic interaction. Classical philosophy of language, grounded in speech and text, must now be reinterpreted in light of digital practices that are multimodal, fragmented, and technologically mediated. Meaning today is not limited to words alone; it is constructed through symbols, images, hashtags, and even silence within algorithmically curated platforms.\nMethodology: In this paper, the exploratory qualitative research method is used. The relevant information is collected using keyword-based search in Google search engine, Google Scholar search engine, and AI-driven GPTs. This information is analysed and interpreted as per the objectives of the paper.\nOriginality/Values: The study engages with contemporary questions of authenticity, misinformation, and linguistic creativity in digital environments. By bridging classical philosophy of language with the realities of digital communication, the paper argues for an expanded framework that accounts for multimodal, networked, and technologically mediated forms of meaning-making. Ultimately, rethinking language in the digital age offers not only a deeper understanding of communication but also an opportunity to develop more ethical and inclusive linguistic practices in a rapidly evolving world.",
      "citationCount": 5,
      "doi": "10.64818/pijpl.3107.4634.0015",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/593e4d64b08e1393011bf62f10fb78c2b58649a9",
      "venue": "Poornaprajna International Journal of Philosophy &amp; Languages (PIJPL)",
      "journal": {
        "name": "Poornaprajna International Journal of Philosophy &amp; Languages (PIJPL)"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "4f5cce45d2af2256274687a6719e886d02288f57",
      "title": "Language and Philosophy: An Analysis of The Relationship, Weaknesses, and Role of Analytic Philosophy in Epistemology",
      "authors": [
        {
          "name": "Imanuel Setyo Budi",
          "authorId": "2365156070"
        },
        {
          "name": "I. G. A. G. Wismadewi",
          "authorId": "2372389724"
        }
      ],
      "year": 2025,
      "abstract": "This article discusses the complex relationship between language and philosophy, focusing on the weaknesses of language and the role of analytic philosophy in epistemology. The main problems raised include the ambiguity of language, its limitations in conveying abstract concepts, and its impact on philosophical thought. This research uses a qualitative method through content analysis and literature studies of the works of philosophers such as Wittgenstein, Russell, and Gettier, as well as a hermeneutic approach to interpreting texts contextually. It aims to examine how language affects philosophical understanding and how analytic philosophy seeks to address the weaknesses of language through logical and semantic analysis. The results show that language, although vital in communication and the construction of reality has limitations such as ambiguity and dependence on context. Analytic philosophy plays a role in clarifying meaning, analyzing concepts, and overcoming misunderstandings through an epistemological approach. This article suggests the need for further research on language in the context of digital technologies and the integration of language philosophy into the educational curriculum to enrich cross-disciplinary understanding. Implicitly, collaborations with cognitive sciences and sociology can provide new insights into the dynamics of language and thought.",
      "citationCount": 0,
      "doi": "10.52352/lacultour.v4i1.1812",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/4f5cce45d2af2256274687a6719e886d02288f57",
      "venue": "LACULTOUR: Journal of Language and Cultural Tourism",
      "journal": {
        "name": "LACULTOUR: Journal of Language and Cultural Tourism"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "12fd787f8b8b54be71c0b4048d28a01d17410139",
      "title": "Analytic-Synthetic Distinction: The Issues of Logic, Language and Meaning in Kant and Quine’S Philosophy",
      "authors": [
        {
          "name": "Jhadeswar Ghosh",
          "authorId": "2376900788"
        }
      ],
      "year": 2025,
      "abstract": "The analytic-synthetic1 distinction is one of the controversial and also essential issues to understand many developments in logic, philosophy of language, epistemology and metaphysics in contemporary philosophy. This paper examines the discussion on analytic-synthetic distinction in Kant and Quine’s philosophy with the aim of placing exactly what is at stake. In the course of this discussion, I will try to make analyse their arguments that what exactly analytic-synthetic distinction claims and by doing so assess the so-called alikenesses between them. In the Critique of Pure Reason2 Kant says the distinction between analytic and synthetic judgements in three distinct ways: analytic judgements are those (1) ‘in which [...] the predicate B belongs to the subject A, as something which is (covertly) contained in this concept A’, instantly pursuing this we are acquainted that analytic judgements are those (2) ‘in which the connection of predicate with the subject is thought through identity’, the distinction between analytic and synthetic judgements can be added by the concept that (3) ‘[Analytic judgements], adding nothing through the predicate to the concept of the subject […] can also be entitled explicative. From another point of view in the synthetic judgements, the predicate lies outside the subject concept. It adds something new to the subject concept. It gives new information about the subject term’. Quine appraises Kant as the one who first amply showed the importance of the analytic-synthetic distinction and engaged with the predicaments in Kant’s position to re-conceptualise the whole relationship between logic, language and meaning. His famous objections to analyticity in ‘Two Dogmas of Empiricism’ 3 asserts that a “fundamental cleavage between truths which are analytic, or grounded in meanings, independently of matters of fact, and truths which are synthetic, or grounded in fact,” is an essential dogma of modem empiricism. After examining the presumptions, the paper concludes that the disagreement between Kant and Quine’s different approaches on the notion of analyticity-synthetic distinction is rooted against the traditional philosophy. In Kant’s philosophy the distinction between analytic-synthetic is not only important for the renunciation of traditional approaches of the so-called dogmatic, metaphysics, but it is also important in his inquiry into the possibility of metaphysics as a rational science. Quine accepted a radical naturalization of philosophy, such that philosophy would be continuous with empirical science, as its slightly more abstract and reflective branch. His attack on analytic-synthetic distinction and conceptual analysis has also had an inadvertent, and somewhat ironic and opened the door to a new wave of metaphysical theorizing by opposing the stand of Logical Positivism, which considered metaphysical inquiries as nonsensical. But as we will see, the way the distinction between analytic and synthetic judgments operates within these worthy forms out to differ substantially between Kant and Quine.",
      "citationCount": 0,
      "doi": "10.62424/jplw.2025.27.00.06",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/12fd787f8b8b54be71c0b4048d28a01d17410139",
      "venue": "Philosophy and the Life-world",
      "journal": {
        "name": "Philosophy and the Life-world"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "914faf9494fbfde1fa96584e9578356a344818ed",
      "title": "Causes in neuron diagrams, and testing causal reasoning in Large Language Models. A glimpse of the future of philosophy?",
      "authors": [
        {
          "name": "Louis Vervoort",
          "authorId": "2367271256"
        },
        {
          "name": "Vitaly Nikolaev",
          "authorId": "48942032"
        }
      ],
      "year": 2025,
      "abstract": "We propose a test for abstract causal reasoning in AI, based on scholarship in the philosophy of causation, in particular on the neuron diagrams popularized by D. Lewis. We illustrate the test on advanced Large Language Models (ChatGPT, DeepSeek and Gemini). Remarkably, these chatbots are already capable of correctly identifying causes in cases that are hotly debated in the literature. In order to assess the results of these LLMs and future dedicated AI, we propose a definition of cause in neuron diagrams with a wider validity than published hitherto, which challenges the widespread view that such a definition is elusive. We submit that these results are an illustration of how future philosophical research might evolve: as an interplay between human and artificial expertise.",
      "citationCount": 0,
      "doi": "10.48550/arXiv.2506.14239",
      "arxivId": "2506.14239",
      "url": "https://www.semanticscholar.org/paper/914faf9494fbfde1fa96584e9578356a344818ed",
      "venue": "Journal for General Philosophy of Science, Zeitschrift für allgemeine Wissenschaftstheorie",
      "journal": {
        "name": "ArXiv",
        "volume": "abs/2506.14239"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "1981ed1cc04f5a89294ff4af18a8737e580b5aac",
      "title": "The Construction and Deconstruction of Black Humor Schemata in American Literature from the Perspective of the Philosophy of Language- A Case Study of Heller’s “Catch-22”",
      "authors": [
        {
          "name": "Han Li",
          "authorId": "2397283216"
        }
      ],
      "year": 2025,
      "abstract": "This study examines the construction and deconstruction of black humor schemata in American literature from the perspective of the philosophy of language, using Joseph Heller’s ‘Catch-22’ as a case study. Black humor, characterized by its ironic, absurd, and satirical elements, presents a unique narrative technique that challenges conventional literary forms and critiques sociopolitical structures. This research employs a combined methodology of textual analysis and philosophical inquiry to dissect the narrative devices and thematic elements Heller employs to construct black humor. The analysis reveals how Heller’s use of paradox, anti-heroism, and incongruity not only constructs a distinct humor but also deconstructs traditional wartime narratives, reflecting broader existential and linguistic concerns. Through a detailed examination of key passages and motifs in ‘Catch-22,’ the study provides insights into the intricate relationship between language, humor, and meaning in literary contexts. This paper discusses the theoretical underpinnings of black humor within the framework of language philosophy, examines its manifestation in Heller’s work, and explores its implications for contemporary literary theory. The results contribute to a deeper understanding of how black humor functions as both a narrative strategy and a philosophical critique, offering new perspectives on its role in American literature.",
      "citationCount": 0,
      "doi": "10.70267/spp.v2n3.2238",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/1981ed1cc04f5a89294ff4af18a8737e580b5aac",
      "venue": "Sociology, Philosophy and Psychology",
      "journal": {
        "name": "Sociology, Philosophy and Psychology"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "c131e6777688d77cf77786ddbbf4a71fecaece4a",
      "title": "Experience and Language in the Philosophy of John Dewey and Wilfrid Sellars",
      "authors": [
        {
          "name": "Dmitry Muravyev",
          "authorId": "2379503452"
        }
      ],
      "year": 2025,
      "abstract": "The article is devoted to the problem of the correlation of experience and language in the philosophy of American thinkers J. Dewey and W. Sellars. They both formulated their positions on this topic during the criticism of the classical empirical tradition, defending the thesis of the intersubjectivity of linguistic meanings. However, it is experience that is the watershed between them. For Dewey, experience is crucial in the question of the origin and use of language. But Sellars and his followers like R. Rorty and R. Brandom tried to get rid of this, in their opinion, outdated concept. Despite the fact that the main characters of the article do not coincide in their conclusions, both Dewey and Sellars turned out to be consonant with modern theories of linguistic behavior not only in philosophy, but also in interdisciplinary research.",
      "citationCount": 0,
      "doi": "10.21146/2074-5869-2025-30-1-64-75",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/c131e6777688d77cf77786ddbbf4a71fecaece4a",
      "venue": "History of Philosophy",
      "journal": {
        "name": "History of Philosophy"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "6538225f36fd7ee64adb1a1303d928c1ca154ab2",
      "title": "THE PHILOSOPHY OF LANGUAGE IN AL-FARĀBĪ’S THOUGHT",
      "authors": [
        {
          "name": "Dadan Mardani",
          "authorId": "2399263121"
        },
        {
          "name": "Motea Naji Dabwan Hezam",
          "authorId": "2399258938"
        },
        {
          "name": "Mahmud Mahmud",
          "authorId": "2136729049"
        },
        {
          "name": "Rohanda Rohanda",
          "authorId": "2098916585"
        }
      ],
      "year": 2025,
      "abstract": "Al-Farābī’s contributions to Islamic philosophy extend deeply into the philosophy of language, yet scholarly attention to this dimension remains limited. This study re-examines al-Farābī’s linguistic philosophy by focusing on three interrelated dimensions: logic, symbol, and reasoning. The background of the research lies in the need to reassess classical frameworks in light of contemporary debates on language, cognition, and meaning, where non-Western traditions remain underrepresented. The objective is to explicate how al-Farābī conceptualizes language not merely as a communicative tool, but as an epistemic system for organizing rational thought and symbolic representation. Using a qualitative method, the study employs textual-philosophical analysis of al-Farābī’s major works, including Kitāb al-Ḥurūf, Kitāb al-Alfāẓ al-Musta‘mala fī al-Manṭiq, and his commentary on De Interpretatione, supported by recent scholarly findings. The results reveal that al-Farābī understands language as a structured expression of the intellect, capable of conveying both demonstrative propositions and imaginative constructs. His classification of syllogisms into demonstrative, dialectical, rhetorical, poetic, and sophistical shows the multiplicity of language functions, each with distinct epistemological and moral purposes. Furthermore, his reflections on metaphor, rhetoric, and prophetic discourse demonstrate the cognitive and ethical role of symbolic language in shaping society and cultivating virtue. The study concludes that al-Farābī’s philosophy of language integrates logical rigor with symbolic depth, offering an early model of semiotic realism in which words, concepts, and referents form a triadic relationship grounded in reason and truth. This synthesis provides a foundational contribution to the Islamic intellectual tradition while also enriching contemporary philosophy of language, hermeneutics, and intercultural dialogue.",
      "citationCount": 0,
      "doi": "10.20871/kpjipm.v11i2.447",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/6538225f36fd7ee64adb1a1303d928c1ca154ab2",
      "venue": "Kanz Philosophia: A Journal for Islamic Philosophy and Mysticism",
      "journal": {
        "name": "Kanz Philosophia: A Journal for Islamic Philosophy and Mysticism"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "09d665e79a975f3f6942041a6669c1a9a76172ad",
      "title": "The Name and Nature of “Chinese-Language Philosophy”",
      "authors": [
        {
          "name": "Xiaobo Yang",
          "authorId": "2298203729"
        }
      ],
      "year": 2025,
      "abstract": "Abstract:In recent years, a distinctive trend known as “Chinese-language philosophy” (Hanyu zhexue 漢語哲學) has emerged, signifying a paradigm shift in Chinese philosophical studies. This movement seeks to re-establish the legitimacy of Chinese philosophy in a novel manner. While it has gained substantial traction within Chinese academia, it has found little resonance among international scholars of Chinese philosophy. This prompts a critical examination: What does “Chinese-language philosophy” encompass? What were the circumstances of its emergence and the reasons for its prominence within Chinese academia? Is Chinese philosophy inherently a language-specific philosophy? These questions form the core of our exploration, intending to clarify the name and nature of “Chinese-language philosophy.” We caution against an overemphasis on the role of language in philosophy, as it may lead to a language-centric ontology that overlooks the fundamental underpinnings shared by all philosophical traditions across cultures and inherent in all human languages—namely, the lived experiences and social practices of human beings.",
      "citationCount": 0,
      "doi": "10.1353/pew.2025.a958930",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/09d665e79a975f3f6942041a6669c1a9a76172ad",
      "venue": "Philosophy East & West",
      "journal": {
        "name": "Philosophy East and West",
        "pages": "369 - 387",
        "volume": "75"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "edef768b3891c6503a036d2cbd3af3ac3856a850",
      "title": "Internationalizing Philosophy of Education: The Vexing (Liberating) Problem of Language",
      "authors": [
        {
          "name": "Leonard Tan",
          "authorId": "2359790569"
        }
      ],
      "year": 2025,
      "abstract": "Abstract:As the philosophy of music education further internationalizes with Asian philosophies in recent years, the problem of language is a crucial issue that can no longer be ignored. When mining ideas originally written in non-English languages, is it possible to truly know what was said or written? Is knowledge of the original language necessary? When interpreting and quoting non-English philosophical texts, what does it mean to do philosophy with integrity and in a philosophically responsible manner? These questions resist simple answers. To this end, I delimit this paper to three central themes: doubt, rigor, and humility, which offer implications for publications, leadership, and gatekeeping in our field as it continues to internationalize. While I draw examples primarily from the vexing problem of interpreting and presenting Chinese philosophical texts to English readers, the ideas offered may also be applied to work involving texts in other non-English languages. I conclude by arguing that while vexing, the problem of language is simultaneously liberating—one that expands the limits of our worlds for the melioration of music education.",
      "citationCount": 0,
      "doi": "10.2979/pme.00022",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/edef768b3891c6503a036d2cbd3af3ac3856a850",
      "venue": "Philosophy of Music Education Review",
      "journal": {
        "name": "Philosophy of Music Education Review",
        "pages": "55 - 73",
        "volume": "33"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "ac16124cd0a1ce84714d59a0e521f1f7cc35fa57",
      "title": "Ontology of Language and Culture in Philosophy of Name by A. F. Losev",
      "authors": [
        {
          "name": "O. Astakhov",
          "authorId": "3436642"
        },
        {
          "name": "O. V. Rtishcheva",
          "authorId": "117616568"
        }
      ],
      "year": 2025,
      "abstract": "The relevance of the study is due to the necessity to analyze mutual determination of the development of language and culture so as to expand the problematic field of humanities.  Thus, the article is focused on Alexei Losev’s book Philosophy of Name (1927) characterized with a kind of polyphony that calls for bridging the author’s position with a variety of philosophical trends dealing with the ontological problems of language and culture. The article’s authors set the goal of examining the specifics of studies on ontological characteristics of language through the prism of its cultural representation, analysing Losev’s conceptual framework. In this regard the authors set the following tasks: firstly, to determine the pre-object structure of the name as a mythologeme, by highlighting the primary status of the advancement from the internal sense, related to the existential foundations of life, to its external representations; secondly, to analyze the reverse motion from essence to its appearances as realized in the word expressing the fullness of individual and cultural meanings. In accordance with the set tasks, the results of the study follow the general logic of Losev’s conceptualizations. The dialectic of Losev’s reasoning combines the appraisal of the ascent to the Absolute in understanding the name, on the one hand, with the significance of the descent to the word with its agile lively content, on the other. Losev integrates these two trends in language development through myth, which he sees as a living reality—an actual manifestation of essence fixed in a name. The conclusions are indicated by appealing to the ontological Pan-Unity allowing Losev to integrate the ideas of man and the world, to connect reality to thought in the context of universal relations the wholeness of which becomes real in the living space of culture.",
      "citationCount": 0,
      "doi": "10.24833/2541-8831-2025-1-33-156-165",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/ac16124cd0a1ce84714d59a0e521f1f7cc35fa57",
      "venue": "Concept: philosophy, religion, culture",
      "journal": {
        "name": "Concept: philosophy, religion, culture"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "5a1d89ab601281fae2ceecc3eea658c54c37710e",
      "title": "Educational Philosophy and Teaching Style of Language and Literature (LL) Teachers",
      "authors": [
        {
          "name": "Jude Renan Bido",
          "authorId": "2383215972"
        }
      ],
      "year": 2025,
      "abstract": "This study examined the educational philosophies and teaching styles of Language and Literature (LL) teachers in Northern Samar, with the aim of describing the relationship between teachers’ philosophical orientations and their instructional practices. A descriptive–quantitative research design was employed, using a standardized survey conveniently responded by 20 LL teachers. The data were analyzed using frequency counts, percentages, and cross-tabulation. Results revealed that the respondents are mostly female, predominantly female, young to mid-career, moderately experienced, and academically well-prepared. Moreover, the majority of teachers adhered to Progressivism (55%), reflecting a learner-centered orientation that emphasizes inquiry, experiential learning, and democratic participation. Existentialism (20%) and Eclecticism (15%) followed, while Essentialism and Perennialism were minimally represented (5% each). In terms of teaching styles, the Delegator (40%) emerged as the most dominant, followed by teachers who employed a Combination of styles (25%), the Personal Model (20%), the Expert (10%), and the Authority (5%) approach. Cross-tabulation indicated a strong alignment between Progressivist philosophy and Delegator/Personal Model styles, while existentialist teachers balanced between Delegator and Expert orientations. Eclectic teachers demonstrated corresponding flexibility in their teaching styles. The findings suggest that LL teachers largely reflect global and national educational trends favoring student-centered and flexible pedagogies, while the limited presence of teacher-centered approaches signals a gradual decline of traditionalist models. It is recommended that professional development programs emphasize inquiry-based and collaborative learning strategies; curriculum implementation support eclectic practices to address diverse learners’ needs; DepEd and CHED sustain policies encouraging postgraduate studies to enhance teachers’ philosophical and pedagogical maturity; and further studies be conducted in the province and across different regions to validate and expand these findings.",
      "citationCount": 0,
      "doi": "10.54536/jnll.v3i1.5845",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/5a1d89ab601281fae2ceecc3eea658c54c37710e",
      "venue": "Journal of Natural Language and Linguistics",
      "journal": {
        "name": "Journal of Natural Language and Linguistics"
      },
      "publicationTypes": [
        "JournalArticle",
        "Review"
      ]
    },
    {
      "paperId": "61bc6c843bfd9b221ecae1eb5338bce3556bec70",
      "title": "After Parmenides. Studies on Language and Metaphysics in Early Greek Philosophy. By Alexander P.D. Mourelatos. Edited by Massimo Pulpito",
      "authors": [
        {
          "name": "Enrico Piergiacomi",
          "authorId": "2376987558"
        }
      ],
      "year": 2025,
      "abstract": "<jats:p/>",
      "citationCount": 0,
      "doi": "10.5840/ancientphil202545234",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/61bc6c843bfd9b221ecae1eb5338bce3556bec70",
      "venue": "Ancient Philosophy",
      "journal": {
        "name": "Ancient Philosophy"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "22ed59b0857c6f7e7170a762886a10c9c154f330",
      "title": "MODERN INTERPRETATION OF THE ORDINARY LANGUAGE PHILOSOPHY: A CONTEXTUALIST APPROACH",
      "authors": [
        {
          "name": "P. Sobolievskyi",
          "authorId": "2281160146"
        }
      ],
      "year": 2025,
      "abstract": "B a c k g r o u n d . In current debates about knowledge, the contextualist approach – especially its reliance on how people use the word \"know\" in everyday conversations – has faced growing criticism. The core issue is this: just because something is commonly said doesn't mean it should be taken as a solid basis for building a theory. Everyday ways of speaking may reflect certain habits or intuitions, but they don't automatically justify splitting knowledge into different types – like \"low-standard knowledge\" (L-knowledge) and \"high-standard knowledge\" (H-knowledge). In short, the contextualist argument, which claims that what counts as knowledge depends on the situation, doesn't hold up. Its reliance on linguistic habits is too weak to support the weight of its theoretical conclusions.\n\nM e t h o d s . This study uses conceptual analysis to clarify how different kinds of knowledge are understood – particularly the difference between low-, medium-, and high-standard knowledge. It also draws on historical and philosophical research, including a close look at major thinkers and recent theories.\n\nR e s u l t s . One key finding is that high-standard knowledge (H-knowledge) – the kind that demands complete certainty – doesn't work in practice. It adds no real value to how we talk, reason, or act together. If only infallible knowledge counted, most everyday claims to \"know\" something would fall apart. Worse still, the kind of extreme doubt used to justify H-knowledge is destructive – it erases even ordinary, useful knowledge and breaks down our ability to think or act with any confidence.\n\nIn contrast, low-standard knowledge (L-knowledge), where certainty isn't required, proves both useful and defensible. This idea traces back to thinkers like N. Malcolm and fits well with how we actually reason and communicate. Keeping this fallible – but functional – idea of knowledge allows us to tell the difference between informed belief and mere guesswork. It also helps language and teamwork function effectively. So L-knowledge isn't a weaker form of knowing – it's a practical tool for dealing with uncertainty and making decisions.\n\nC o n c l u s i o n s . The paper argues that H-knowledge and L-knowledge can't be combined into a single theory. They come from fundamentally different ways of thinking about what it means to \"know\". There's no middle ground here: a choice must be made. And the better choice, as argued, is fallibilism – the view that knowledge can still be valid even if it isn't perfect. Radical doubt still plays an important role in philosophy, but it shouldn't push us to demand impossible standards. Instead, it should remind us why more flexible, realistic standards work better. In the end, the fallibilist approach doesn't represent a compromise – it's the only workable foundation for a consistent and useful theory of knowledge.",
      "citationCount": 0,
      "doi": "10.17721/2523-4064.2025/12-19/23",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/22ed59b0857c6f7e7170a762886a10c9c154f330",
      "venue": "Bulletin of Taras Shevchenko National University of Kyiv Philosophy",
      "journal": {
        "name": "Bulletin of Taras Shevchenko National University of Kyiv. Philosophy"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "6645d1bdf984ef28cbbcaa0e4946fadddd0821b4",
      "title": "Intelligent Computer-Assisted Language Assessment (ICALA) in philosophy-based language instruction: unraveling the effects on critical thinking, self-evaluation, academic resilience, and speaking development",
      "authors": [
        {
          "name": "Khaled Ahmed Abdel-Al Ibrahim",
          "authorId": "2327144463"
        },
        {
          "name": "Mohamed Ali Mohamed Kassem",
          "authorId": "2327139048"
        },
        {
          "name": "Desta Lami",
          "authorId": "2232610773"
        }
      ],
      "year": 2024,
      "abstract": null,
      "citationCount": 5,
      "doi": "10.1186/s40468-024-00320-1",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/6645d1bdf984ef28cbbcaa0e4946fadddd0821b4",
      "venue": "Language Testing in Asia",
      "journal": {
        "name": "Language Testing in Asia",
        "volume": "14"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "a0d00cec96a156a6fa164c65d5691c97f983912c",
      "title": "Rudolf Carnap’s Ideas in Philosophy of Language in the Context of Conceptual Engineering",
      "authors": [
        {
          "name": "I. Griftsova",
          "authorId": "65805428"
        },
        {
          "name": "N. Y. Kozlova",
          "authorId": "2160678133"
        }
      ],
      "year": 2024,
      "abstract": "The past decade has seen notable development of conceptual engineering – a field of analytical philosophy that focuses on the critical evaluation of concepts. Most authors engaged with this area identify Rudolf Carnap’s ideas as its methodological framework and theoretical origin, placing particular emphasis on the philosopher’s method of explication. This article highlights the unquestionable influence Carnap’s thought had on conceptual engineering whilst by no means reducing it to the utilisation and advancement of explication within this field of analytical philosophy: indeed, conceptual engineering has incorporated – and brought to the forefront – much broader tenets of Carnap’s concept. This study draws on a series of the philosopher’s works, as well as his ‘Intellectual Autobiography’, to trace the evolution of his ideas about language and describe the fundamental elements revealing the ‘engineering perspective’ in his reflection. Most clearly, this perspective is evident in his interpretation of logic as a conceptual tool for acquiring and processing knowledge, ‘assembling’ it into a structure and refining the procedures of logic itself. It is shown that the origins of the engineering perspective trace back, on the one hand, to Carnap’s interest in the methodological framework of physics, particularly the measurement problem and its epistemological analysis, and, on the other, his fascination with interpretations of the nature of mathematical theory and the idea of unifying logicism and formalism by introducing the principle of tolerance, which adds a pragmatic dimension to methodology. The article examines in detail the idea of explication and its theoretical origins, which lie, in particular, in Carnap’s intention to exactify the notions expressing the degree of validity and probability. His idea of a link between the results of explication and its goal became the central principle of conceptual engineering, distinguishing it from mere conceptual analysis. It is concluded that, when considered together, Carnap’s two major ideas – explication and the principle of tolerance – can be placed in a broader context of a project seeking a rational reconstruction of the life of society and providing it with knowledge-based underpinnings.",
      "citationCount": 4,
      "doi": "10.5840/eps202461111",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/a0d00cec96a156a6fa164c65d5691c97f983912c",
      "venue": "Epistemology &amp; Philosophy of Science",
      "journal": {
        "name": "Epistemology &amp; Philosophy of Science"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "9a9753de90eacf5a6f080899ea9f90b9b8783bbc",
      "title": "Using the Ideal/Nonideal Distinction in Philosophy of Language (and Elsewhere)",
      "authors": [
        {
          "name": "Jeff Engelhardt",
          "authorId": "51400695"
        },
        {
          "name": "Molly Moran",
          "authorId": "2325630791"
        }
      ],
      "year": 2024,
      "abstract": "ABSTRACT Herman Cappelen and Josh Dever (C&D) have recently argued that the ideal/non-ideal distinction is ‘useless’ in philosophy of language. This paper responds to C&D’s argument, develops an account of the distinction, and applies it to philosophy of language. Section 1 summarizes C&D’s argument against Charles Mills’s version of the distinction. Section 2 develops an account of the distinction that’s inspired by Mills’s work but that differs from what C&D take Mills’s view to be. Section 3 shows that, pace C&D, this distinction picks out interesting subsets of work in philosophy of language. We say that ideal theories adopt models of the social world that fail to recognize systemic oppression and are therefore systematically inaccurate. Nonideal theories correct these inaccuracies.",
      "citationCount": 3,
      "doi": "10.1080/00048402.2024.2403762",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/9a9753de90eacf5a6f080899ea9f90b9b8783bbc",
      "venue": "Australasian Journal of Philosophy",
      "journal": {
        "name": "Australasian Journal of Philosophy",
        "pages": "486 - 508",
        "volume": "103"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "78dc368ae219a98750e209fdf6f41ec76fdcbb10",
      "title": "Arbitrariness of Linguistic Signs and Saussure's Philosophy of Language",
      "authors": [
        {
          "name": "Sun Chen",
          "authorId": "2332027551"
        }
      ],
      "year": 2024,
      "abstract": ": This study examines Saussure’s arbitrariness of linguistic signs from the perspective of philosophy of language through analyzing texts from Course in General Linguistics and Writings in General Linguistics. As the first principle of Saussure’s general linguistics",
      "citationCount": 1,
      "doi": "10.20431/2347-3134.1209001",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/78dc368ae219a98750e209fdf6f41ec76fdcbb10",
      "venue": "International Journal on Studies in English Language and Literature",
      "journal": {
        "name": "International Journal on Studies in English Language and Literature"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "17a5b0a1df0b924cecc8a53a517239d2dfa5d15d",
      "title": "What naturalism? great apes, old-fashioned philosophy, an the McDowellian language game",
      "authors": [
        {
          "name": "Corijn van Mazijk",
          "authorId": "146444103"
        }
      ],
      "year": 2024,
      "abstract": null,
      "citationCount": 1,
      "doi": "10.1007/s44204-024-00217-z",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/17a5b0a1df0b924cecc8a53a517239d2dfa5d15d",
      "venue": "Asian Journal of Philosophy",
      "journal": {
        "name": "Asian Journal of Philosophy",
        "volume": "3"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "7a62990c67e7003d6def0cb7dd3e2f2f99e9e801",
      "title": "One Word and Multiple Senses: John Locke’s Philosophy of Abuse of Language",
      "authors": [
        {
          "name": "Shaista Zeb",
          "authorId": "2302098570"
        },
        {
          "name": "Muhammad Ajmal",
          "authorId": "2301849346"
        },
        {
          "name": "Martina Pavlikova",
          "authorId": "2314007383"
        },
        {
          "name": "Sohaib Alam",
          "authorId": "2276149223"
        },
        {
          "name": "Farhan Ahmad",
          "authorId": "2267105364"
        },
        {
          "name": "Sameena Banu",
          "authorId": "2253753898"
        }
      ],
      "year": 2024,
      "abstract": "This paper aims at examining the impotence of language or what is famously referred to as the phenomenon of inconsistency of language through the philosophy of John Locke on the abuse of language and with specific reference to the Eighth Edition of the Oxford Advanced Learner’s Dictionary authored by Hornby (2010). Locke as well stated that adequate signs which he also referred to as words are lost or corrupted especially when a word is given many meanings. By discussing selected entries of the dictionary, the present research intends to demonstrate how polysemanticity and the use or a word in different contexts can cause what Locke called language misuse. Illustrating in the case of particular examples, the study shows the potential consequence of this process for the language learners and users, stressing on the necessity to enhance the meticulousness of the language one will opt to use. The research concludes that there is need to resolve discrepancies that grow from these ambiguities for language teachers and lexicographers to improve meaning and communication, an idea supported by Locke’s goal of enforcing the correct usage of language among English speakers. Results imply that teachers should draw students’ attention to the fact that words’ meanings cannot be understood separately from their contexts. Language educators are advised to introduce the students to the different meanings of words and contexts of their use.",
      "citationCount": 1,
      "doi": "10.5430/wjel.v14n6p417",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/7a62990c67e7003d6def0cb7dd3e2f2f99e9e801",
      "venue": "World Journal of English Language",
      "journal": {
        "name": "World Journal of English Language"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    }
  ],
  "count": 40,
  "errors": []
}
