{
  "status": "success",
  "source": "semantic_scholar",
  "query": "Taddeo Floridi symbol grounding",
  "results": [
    {
      "paperId": "c6b1a1e991adf3b4be258de7e79c114da4fa75e7",
      "title": "Why Taddeo and Floridi did not solve the symbol grounding problem",
      "authors": [
        {
          "name": "K. Bielecka",
          "authorId": "2325880"
        }
      ],
      "year": 2015,
      "abstract": null,
      "citationCount": 4,
      "doi": "10.1080/0952813X.2014.940138",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/c6b1a1e991adf3b4be258de7e79c114da4fa75e7",
      "venue": "Journal of experimental and theoretical artificial intelligence (Print)",
      "journal": {
        "name": "Journal of Experimental & Theoretical Artificial Intelligence",
        "pages": "79 - 93",
        "volume": "27"
      },
      "publicationTypes": [
        "JournalArticle",
        "Review"
      ]
    },
    {
      "paperId": "1ac9e8b082dfce53b9275f194015de3a278139f5",
      "title": "Solving the symbol grounding problem: a critical review of fifteen years of research",
      "authors": [
        {
          "name": "M. Taddeo",
          "authorId": "2084659"
        },
        {
          "name": "L. Floridi",
          "authorId": "1982425"
        }
      ],
      "year": 2005,
      "abstract": null,
      "citationCount": 179,
      "doi": "10.1080/09528130500284053",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/1ac9e8b082dfce53b9275f194015de3a278139f5",
      "venue": "Journal of experimental and theoretical artificial intelligence (Print)",
      "journal": {
        "name": "Journal of Experimental & Theoretical Artificial Intelligence",
        "pages": "419 - 445",
        "volume": "17"
      },
      "publicationTypes": [
        "JournalArticle",
        "Review"
      ]
    },
    {
      "paperId": "996759cd170309774f1f7b7d07095a571acb8370",
      "title": "A Praxical Solution of the Symbol Grounding Problem",
      "authors": [
        {
          "name": "M. Taddeo",
          "authorId": "2084659"
        },
        {
          "name": "L. Floridi",
          "authorId": "1982425"
        }
      ],
      "year": 2007,
      "abstract": null,
      "citationCount": 43,
      "doi": "10.1007/s11023-007-9081-3",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/996759cd170309774f1f7b7d07095a571acb8370",
      "venue": "Minds and Machines",
      "journal": {
        "name": "Minds and Machines",
        "pages": "369-389",
        "volume": "17"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "eeee2d5f636d01ec00fae1fd856fdf930230a546",
      "title": "An Epistemological Approach to the Symbol Grounding Problem - The Difference Between Perception and Demonstrative Knowledge and Two Ways of Being Meaningful",
      "authors": [
        {
          "name": "Jodi Guazzini",
          "authorId": "103531747"
        }
      ],
      "year": 2017,
      "abstract": null,
      "citationCount": 2,
      "doi": "10.1007/978-3-319-96448-5_4",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/eeee2d5f636d01ec00fae1fd856fdf930230a546",
      "venue": "Conference on Philosophy and Theory of Artificial Intelligence",
      "journal": {
        "pages": "36-39"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "7ac9cdd3c00ffb7ff4d31a063b8c2ced94d2f910",
      "title": "A Critical Review on the Symbol Grounding Problem as an Issue of Autonomous Agents",
      "authors": [
        {
          "name": "Richard Cubek",
          "authorId": "1737168"
        },
        {
          "name": "W. Ertel",
          "authorId": "1710696"
        },
        {
          "name": "G. Palm",
          "authorId": "1774384"
        }
      ],
      "year": 2015,
      "abstract": null,
      "citationCount": 12,
      "doi": "10.1007/978-3-319-24489-1_21",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/7ac9cdd3c00ffb7ff4d31a063b8c2ced94d2f910",
      "venue": "Deutsche Jahrestagung für Künstliche Intelligenz",
      "journal": {
        "pages": "256-263"
      },
      "publicationTypes": [
        "JournalArticle",
        "Review"
      ]
    },
    {
      "paperId": "bae295eecc2efcc0a744079c6c60d1fa6b0959e0",
      "title": "The symbol grounding problem … remains unsolved",
      "authors": [
        {
          "name": "S. Bringsjord",
          "authorId": "1797985"
        }
      ],
      "year": 2015,
      "abstract": null,
      "citationCount": 12,
      "doi": "10.1080/0952813X.2014.940139",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/bae295eecc2efcc0a744079c6c60d1fa6b0959e0",
      "venue": "Journal of experimental and theoretical artificial intelligence (Print)",
      "journal": {
        "name": "Journal of Experimental & Theoretical Artificial Intelligence",
        "pages": "63 - 72",
        "volume": "27"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "fc5219fb458960befe73714928a1a31fcfcdd55e",
      "title": "Which symbol grounding problem should we try to solve?",
      "authors": [
        {
          "name": "V. C. Müller",
          "authorId": "1807005"
        }
      ],
      "year": 2015,
      "abstract": "Floridi and Taddeo propose a condition of ‘zero semantic commitment’ for solutions to the grounding problem, and a solution to it. I argue briefly that their condition cannot be fulfilled, not even by their own solution. After a look at Luc Steel's very different competing suggestion, I suggest that we need to re-think what the problem is and what role the ‘goals’ in a system play in formulating the problem. On the basis of a proper (syntactic) understanding of computing, I come to the conclusion that the only sensible grounding problem is how we can explain and re-produce the behavioural ability and function of meaning in artificial computational agents.",
      "citationCount": 7,
      "doi": "10.1080/0952813X.2014.940143",
      "arxivId": "2507.21080",
      "url": "https://www.semanticscholar.org/paper/fc5219fb458960befe73714928a1a31fcfcdd55e",
      "venue": "Journal of experimental and theoretical artificial intelligence (Print)",
      "journal": {
        "name": "Journal of Experimental & Theoretical Artificial Intelligence",
        "pages": "73 - 78",
        "volume": "27"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "ca90fc177d4803733a9c9545af32cf97af480ac6",
      "title": "Typ-Ken (an Amalgam of Type and Token) Drives Infosphere",
      "authors": [
        {
          "name": "Y. Gunji",
          "authorId": "1872766"
        },
        {
          "name": "T. Niizato",
          "authorId": "35243722"
        },
        {
          "name": "H. Murakami",
          "authorId": "3242187"
        },
        {
          "name": "Iori Tani",
          "authorId": "34103812"
        }
      ],
      "year": 2010,
      "abstract": null,
      "citationCount": 8,
      "doi": "10.1007/S12130-010-9107-7",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/ca90fc177d4803733a9c9545af32cf97af480ac6",
      "venue": "",
      "journal": {
        "name": "Knowledge, Technology & Policy",
        "pages": "227-251",
        "volume": "23"
      },
      "publicationTypes": null
    },
    {
      "paperId": "eee43a9337df7ca428e78d0217bd0691a9927c09",
      "title": "A Categorical Analysis of Large Language Models and Why LLMs Circumvent the Symbol Grounding Problem",
      "authors": [
        {
          "name": "Luciano Floridi",
          "authorId": "2259952291"
        },
        {
          "name": "Yiyang Jia",
          "authorId": "2400358926"
        },
        {
          "name": "Fernando Tohm'e",
          "authorId": "2214095508"
        }
      ],
      "year": 2025,
      "abstract": "This paper presents a formal, categorical framework for analysing how humans and large language models (LLMs) transform content into truth-evaluated propositions about a state space of possible worlds W , in order to argue that LLMs do not solve but circumvent the symbol grounding problem.",
      "citationCount": 0,
      "doi": null,
      "arxivId": "2512.09117",
      "url": "https://www.semanticscholar.org/paper/eee43a9337df7ca428e78d0217bd0691a9927c09",
      "venue": "",
      "journal": null,
      "publicationTypes": null
    },
    {
      "paperId": "4933a0e864448cb6543e15ee28a6817893ab49f8",
      "title": "The Philosophy of Information",
      "authors": [
        {
          "name": "L. Floridi",
          "authorId": "1982425"
        }
      ],
      "year": 2010,
      "abstract": null,
      "citationCount": 79,
      "doi": "10.1111/J.1467-9973.2010.01647.X",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/4933a0e864448cb6543e15ee28a6817893ab49f8",
      "venue": "",
      "journal": {
        "name": "",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "3e6cb14b94e6352f3f4e2e0c34c21a68a1215c3b",
      "title": "Editors' introduction",
      "authors": [
        {
          "name": "Derek Jones",
          "authorId": "2109328831"
        },
        {
          "name": "Anthony F. Beavers",
          "authorId": "2425949"
        }
      ],
      "year": 2015,
      "abstract": null,
      "citationCount": 1,
      "doi": "10.1080/0952813X.2014.940145",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/3e6cb14b94e6352f3f4e2e0c34c21a68a1215c3b",
      "venue": "Journal of experimental and theoretical artificial intelligence (Print)",
      "journal": {
        "name": "Journal of Experimental & Theoretical Artificial Intelligence",
        "pages": "1 - 2",
        "volume": "27"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "63e90b3db4b9bc904c6957cc7a83ea2ede1a41c3",
      "title": "Disentangling Representation from Conceptualisation",
      "authors": [
        {
          "name": "Nancy Salay",
          "authorId": "144651660"
        }
      ],
      "year": 2010,
      "abstract": null,
      "citationCount": 0,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/63e90b3db4b9bc904c6957cc7a83ea2ede1a41c3",
      "venue": "",
      "journal": {
        "name": "",
        "volume": "32"
      },
      "publicationTypes": [
        "Review"
      ]
    },
    {
      "paperId": "0d242fc8e910da59a74e258a70a9bdb836ce44d8",
      "title": "On the Nature of Information: How FAIR Digital Objects are Building-up Semantic Space",
      "authors": [
        {
          "name": "H. Döbereiner",
          "authorId": "46543645"
        }
      ],
      "year": 2022,
      "abstract": "In this paper, we are concerned about the nature of information and how to gather and compose data with the help of so called FAIR digital objects (FDOs) in order to transform them to knowledge. FDOs are digital surrogates of real objects. The nature of information is intrinsically linked to the kind of questions one is asking. One might not ask a question or get philosophical about it. Answers depend on the data different disciplines gather about their objects of study. In Statistical Physics, classical Shannon entropy measures system order which in equilibrium just equals the heat exchanged with the environment. In cell biology, each protein carries certain functions which create specific information. Cognitive science describes how organisms perceive their environment via functional sensors and control behavior accordingly. Note that one can have function and control without meaning. In contrast, psychology is concerned with the assessment of our perceptions by assigning meaning and ensuing actions. Finally, philosophy builds logical constructs and formulates principles, in effect transforming facts into complex knowledge. All these statements make sense, but there is an even more concise way. Indeed, Luciano Floridi provides a precise and thorough classification of information in his central oeuvre On the Philosophy of Information (Floridi 2013). Especially, he performs a sequential construction to develop the attributes which data need to have in order to count as knowledge. Semantic information is necessarily well-formed, meaningful and truthful. Well-formed data becomes meaningful by action based-semantics of an autonomous-agent solving the symbol grounding problem (Taddeo and Floridi 2005) interacting with the environment. Knowledge is created then by being informed through relevant data accounted for. We notice that the notion of agency is crucial for defining meaning. The apparent gap between Sciences and Humanities (Bawden and Robinson 2020) is created by the very existence of meaning. Further, meaning depends on interactions & connotations which are commensurate with the effective complexity of the environment of a particular agent resulting in an array of possible definitions.\n In his classical paper More is different (Anderson 1972) discussed verbatim the hierarchical nature of science. Each level is made of and obeys the laws of its constituents from one level below with the higher-level exhibiting emergent properties like wetness of water assignable only to the whole system. As we rise through the hierarchies, there is a branch of science for each level of complexity; on each complexity level there are objects for which it is appropriate and fitting to build up vocabulary for the respective levels of description leading to formation of disciplinary languages. It is the central idea of causal emergence that on each level there is an optimal degree of coarse graining to define those objects in such a way that causality becomes maximal between them. This means there is emergence of informative higher scales in complex materials extending to biological systems and into the brain with its neural networks representing our thoughts in a hierarchy of neural correlates. A computational toolkit for optimal level prediction and control has been developed (Hoel and Levin 2020) which was conceptually extended to integrated information theory of consciousness (Albantakis et al. 2019). The large gap between sciences and humanities discussed above exhibits itself in a series of small gaps connected to the emergence of informative higher scales. It has been suggested that the origin of life may be identiﬁed as a transition in causal structure and information ﬂow (Walker 2014). Integrated information measures globally how much the causal mechanisms of a system reduce the uncertainty about the possible causes for a given state. A measure of “information ﬂow” that accurately captures causal effects has been proposed (Ay and Polani 2008). The state of the art is presented in (Ay et al. 2022) where the link between information and complexity is discussed. Ay et al single out hierarchical systems and interlevel causation. Even further, (Rosas et al. 2020) reconcile conflicting views of emergence via an exact information-theoretic approach to identify causal emergence in multivariate data. As information becomes differentially richer one eventually needs complexity measures beyond {Rn}. One may define generalized metrices on these spaces (Pirró 2009) measuring information complexity on ever higher hierarchical levels of information. As one rises through hierarchies, information on higher scale is usually gained by coarse graining to arrive at an effective, nevertheless exact description, on the higher scale. It is repeated coarse graining of syntactically well-ordered information layers which eventually leads to semantic information in a process which I conjecture to be reminiscent of renormalization group flow leading to a universal classification scheme. Thus, we identify scientific disciplines and their corresponding data sets as dual universality classes of physical and epistemic structure formation, respectively. Above the semantic gap, we may call this process quantification of the qualitative by semantic metrics. Indeed, (Kolchinsky and Wolpert 2018) explored for the first time quantitative semantic concepts in Physics in their 2018 seminal paper entitled Semantic information, autonomous agency and non-equilibrium statistical physics. Their measures are numeric variants of entropy. Semantic information is identified with ‘the information that a physical system has about its environment that is causally necessary for the system to maintain its own existence over time’.\n FDOs are employed in these processes in two fundamental ways. For practical implementations of FDO technology, see accompanying abstract (Wittenburg et al. 2022). First, the FAIR principles (Wilkinson et al. 2016) ensure that unconnected pieces of data may be percolated into an integrated data space. Percolation creates the information density needed to feed AI-driven built up of semantic space. Without FDOs we wouldn't have the gravity for this to occur. Second, the very structure of FDOs, capable of symmetry preserving or breaking fusion events into composed entities, makes them homologous to mathematical categories. This will proof to be a powerful tool to unravel the nature of information via analyzing its topological structure algebraically, especially when considering our conjecture concerning universality, classes of information and their possible instantiations on vastly different length and time scales, in effect explaining analogous structure formation.",
      "citationCount": 0,
      "doi": "10.3897/rio.8.e95119",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/0d242fc8e910da59a74e258a70a9bdb836ce44d8",
      "venue": "Research Ideas and Outcomes",
      "journal": {
        "name": "Research Ideas and Outcomes"
      },
      "publicationTypes": null
    }
  ],
  "count": 13,
  "errors": []
}
