[search_openalex.py] Searching OpenAlex: 'conservatism tradition normative' (year=1995-2025), limit=30
[search_openalex.py] Retrieved 30 papers...
[search_openalex.py] Search complete: 30 papers found
[search_openalex.py] Cached results (cache key: openalex_ac573062c35cafa1)
{
  "status": "success",
  "source": "openalex",
  "query": "conservatism tradition normative",
  "results": [
    {
      "openalex_id": "W2904350574",
      "doi": "10.1002/soej.12317",
      "title": "James M. Buchanan and the Political Economy of Desegregation",
      "authors": [
        {
          "name": "Phillip Magness",
          "openalex_id": "A5015414239",
          "orcid": "https://orcid.org/0000-0002-5627-5244",
          "institutions": [
            "American Institute for Economic Research"
          ]
        },
        {
          "name": "Art Carden",
          "openalex_id": "A5064560532",
          "orcid": "https://orcid.org/0000-0003-0430-8726",
          "institutions": [
            "Samford University"
          ]
        },
        {
          "name": "Vincent Geloso",
          "openalex_id": "A5004143516",
          "orcid": "https://orcid.org/0000-0002-6730-424X",
          "institutions": [
            "Bates College"
          ]
        }
      ],
      "publication_year": 2018,
      "publication_date": "2018-12-18",
      "abstract": "Were 1986 Nobel Laureate James M. Buchanan's formative contributions to political economy inspired in significant part by hostility to the 1954 Brown v. Board of Education decision? Nancy MacLean's 2017 Democracy in Chains argues that public choice economics emerged from an opportunistic alliance with Virginia's “Massive Resistance” to school integration and should thus be situated within the racially tinged tradition of southern conservatism. While Buchanan wrote very little on the economics of race, archival evidence and his published works do not support this thesis. Buchanan's work is better understood with reference to his Chicago school mentor Frank Knight and the Italian public finance tradition rather than southern conservatism. To the contrary, we suggest Buchanan believed the competitive processes generated by an educational voucher system would likely undermine rather than rescue the racially segregated status quo. Furthermore, Buchanan's associations and activities suggest that racial hierarchy was not part of his normative vision.",
      "cited_by_count": 48,
      "type": "article",
      "source": {
        "name": "Southern Economic Journal",
        "type": "journal",
        "issn": [
          "0038-4038",
          "2325-8012"
        ]
      },
      "open_access": {
        "is_oa": false,
        "oa_status": "closed",
        "oa_url": null
      },
      "topics": [
        "School Choice and Performance",
        "Fiscal Policies and Political Economy"
      ],
      "referenced_works_count": 48,
      "url": "https://openalex.org/W2904350574"
    },
    {
      "openalex_id": "W2140622227",
      "doi": "10.1017/s1537592714001595",
      "title": "Testing Theories of American Politics: Elites, Interest Groups, and Average Citizens",
      "authors": [
        {
          "name": "Martin Gilens",
          "openalex_id": "A5082999042",
          "orcid": "https://orcid.org/0000-0001-5485-6275",
          "institutions": [
            "Princeton University"
          ]
        },
        {
          "name": "Benjamin I. Page",
          "openalex_id": "A5089044770",
          "orcid": "https://orcid.org/0000-0002-0889-0015"
        }
      ],
      "publication_year": 2014,
      "publication_date": "2014-09-01",
      "abstract": "Each of four theoretical traditions in the study of American politics—which can be characterized as theories of Majoritarian Electoral Democracy, Economic-Elite Domination, and two types of interest-group pluralism, Majoritarian Pluralism and Biased Pluralism—offers different predictions about which sets of actors have how much influence over public policy: average citizens; economic elites; and organized interest groups, mass-based or business-oriented. A great deal of empirical research speaks to the policy influence of one or another set of actors, but until recently it has not been possible to test these contrasting theoretical predictions against each other within a single statistical model. We report on an effort to do so, using a unique data set that includes measures of the key variables for 1,779 policy issues. Multivariate analysis indicates that economic elites and organized groups representing business interests have substantial independent impacts on U.S. government policy, while average citizens and mass-based interest groups have little or no independent influence. The results provide substantial support for theories of Economic-Elite Domination and for theories of Biased Pluralism, but not for theories of Majoritarian Electoral Democracy or Majoritarian Pluralism.",
      "cited_by_count": 2505,
      "type": "article",
      "source": {
        "name": "Perspectives on Politics",
        "type": "journal",
        "issn": [
          "1537-5927",
          "1541-0986"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "bronze",
        "oa_url": "https://www.cambridge.org/core/services/aop-cambridge-core/content/view/62327F513959D0A304D4893B382B992B/S1537592714001595a.pdf/div-class-title-testing-theories-of-american-politics-elites-interest-groups-and-average-citizens-div.pdf"
      },
      "topics": [
        "Electoral Systems and Political Participation",
        "Political Influence and Corporate Strategies",
        "Social Policy and Reform Studies"
      ],
      "referenced_works_count": 98,
      "url": "https://openalex.org/W2140622227"
    },
    {
      "openalex_id": "W308436470",
      "doi": null,
      "title": "Reflective Equilibrium: Essays in Honour of Robert Heeger",
      "authors": [
        {
          "name": "Wibren van der Burg",
          "openalex_id": "A5005650844",
          "orcid": "https://orcid.org/0000-0002-0073-2813"
        },
        {
          "name": "Theodoor van Willigenburg",
          "openalex_id": "A5040198364"
        }
      ],
      "publication_year": 1998,
      "publication_date": "1998-10-01",
      "abstract": "Preface W. van der Burg, T. van Willigenburg. Introduction W. van der Burg, T. van Willigenburg. Part I: The Elements of Reflective Equilibrium. Moral Principles: Authoritative Norms or Flexible Guidelines? M. Verweij. Morally Relevant Facts: Particularism and Intuitionist Rationality T. van Willigenburg. Considered Judgements: Meaning, Community and Tradition A. Vedder. Background Theories and Religious Beliefs: Their Role and Relation in Reflective Equilibrium T. van den Beld. Ideals and Ideal Theory: The Problem of Methodological Conservatism W. van der Burg. Part II: The Methodology of Reflective Equilibrium. Rationality, Warrant and Reflective Equilibrium E. Herrmann. The Thinker and the Thinking Process: A Feminist Perspective on the Moral Faculty M. Verkerk. Wide Reflective Equilibrium and the Justification of Moral Theory B. Petersson. Your Intuition or Mine? I. de Beaufort. Part III: The Scope of Reflective Equilibrium: Fundamental Views of Life and Religion. Religious Models and Moral Principles V. Brummer. Reflective Equilibrium and Cosmological Claims C.R. Brakenhielm. World Views, Value Change and Reflective Equilibrium A. Jeffner. Part IV: The Purposes of Reflective Equilibrium: Modelling Public Debate and Dialogue. Reflective Equilibrium and Public Debate: How to Cast the Public's Web of Beliefs Broadly Enough J. Vorstenbosch. Developing Public Morality: Between Practical Agreement and Intersubjective Reflective Equilibrium F.W.A. Brom. The Case of Shared Values: An Example of a Socratic Dialogue J. Kessels Part V: Case Studies in Bioethics. The 'Herman Case': The Usefulness of the Wide ReflectiveEquilibrium Model for Ethics Committees E. Schroten. The Use of the Reflective Equilibrium Method in Normative Veterinary Ethics B. Rutgers. Infanticide in Reflective Equilibrium G. Collste. Reflective Equilibrium as a Normative-Empirical Model in Bioethics J.J.M. van Delden, G.J.M.W. van Thiel. Bibliography. List of Contributors. Name Index. Tabula Gratulatorum.",
      "cited_by_count": 45,
      "type": "book",
      "source": {
        "name": "Medical Entomology and Zoology",
        "type": "journal",
        "issn": [
          "0424-7086",
          "2185-5609"
        ]
      },
      "open_access": {
        "is_oa": false,
        "oa_status": "closed",
        "oa_url": null
      },
      "topics": [
        "Ethics in medical practice"
      ],
      "referenced_works_count": 0,
      "url": "https://openalex.org/W308436470"
    },
    {
      "openalex_id": "W2580022561",
      "doi": "10.1093/monist/onw011",
      "title": "The Impossibility of Conservatism? Insights from Russian History",
      "authors": [
        {
          "name": "Vanessa Rampton",
          "openalex_id": "A5001268103",
          "orcid": "https://orcid.org/0000-0003-4445-8024",
          "institutions": [
            "École Polytechnique Fédérale de Lausanne"
          ]
        }
      ],
      "publication_year": 2016,
      "publication_date": "2016-10-01",
      "abstract": "This essay argues that both the normative worth and practicality of conservatism depend on how much there is to enjoy and value in actual historical circumstances. I use examples from Russian history in the Tsarist period to show that if they live in times of great hardship, or under arbitrary political rule, political actors and thinkers with conservative sympathies (such as respect for tradition, and predilection for slow, gradual improvements) will face painful moral dilemmas, and perhaps even be justified in renouncing conservative behaviors altogether. For this reason, the Russian example helps us to better understand why being conservative can sometimes be impossible.",
      "cited_by_count": 16,
      "type": "article",
      "source": {
        "name": "The Monist",
        "type": "journal",
        "issn": [
          "0026-9662",
          "2153-3601"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "hybrid",
        "oa_url": "https://academic.oup.com/monist/article-pdf/99/4/372/9976616/onw011.pdf"
      },
      "topics": [
        "Political Philosophy and Ethics",
        "Political and Economic history of UK and US"
      ],
      "referenced_works_count": 50,
      "url": "https://openalex.org/W2580022561"
    },
    {
      "openalex_id": "W2058159156",
      "doi": "10.1046/j.0020-8833.2003.00277.x",
      "title": "Words, Images, Enemies: Securitization and International Politics",
      "authors": [
        {
          "name": "Michael C. Williams",
          "openalex_id": "A5084500200",
          "orcid": "https://orcid.org/0000-0001-8814-8664",
          "institutions": [
            "Aberystwyth University"
          ]
        }
      ],
      "publication_year": 2003,
      "publication_date": "2003-11-07",
      "abstract": "The theory of “securitization” developed by the Copenhagen School provides one of the most innovative, productive, and yet controversial avenues of research in contemporary security studies. This article provides an assessment of the foundations of this approach and its limitations, as well as its significance for broader areas of International Relations theory. Locating securitization theory within the context of both classical Realism influenced by Carl Schmitt, and current work on constructivist ethics, it argues that while the Copenhagen School is largely immune from the most common criticisms leveled against it, the increasing impact of televisual communication in security relations provides a fundamental challenge for understanding the processes and institutions involved in securitization, and for the political ethics advocated by the Copenhagen School.",
      "cited_by_count": 1095,
      "type": "article",
      "source": {
        "name": "International Studies Quarterly",
        "type": "journal",
        "issn": [
          "0020-8833",
          "1468-2478"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "bronze",
        "oa_url": "https://academic.oup.com/isq/article-pdf/47/4/511/5109128/47-4-511.pdf"
      },
      "topics": [
        "Global Security and Public Health",
        "Global Peace and Security Dynamics",
        "International Law and Human Rights"
      ],
      "referenced_works_count": 86,
      "url": "https://openalex.org/W2058159156"
    },
    {
      "openalex_id": "W2027074426",
      "doi": "10.1080/10361141003736125",
      "title": "The Ideological Foundations of Arguments About Native Title",
      "authors": [
        {
          "name": "David Ritter",
          "openalex_id": "A5078295583",
          "orcid": "https://orcid.org/0000-0002-0293-7687",
          "institutions": [
            "The University of Western Australia"
          ]
        }
      ],
      "publication_year": 2010,
      "publication_date": "2010-05-17",
      "abstract": "The political disputes over native title in Australia have generally been interpreted without recourse to ordinary ideological categories. The general failure to engage with ideology has hampered scholarly analysis, stunting the vocabulary and content of debate, as well as giving the content of public deliberation on the issue a curiously free-floating quality. In this article it is contended that arguments about native title are amenable to being understood as a product of the interaction of a range of well-known normative frameworks: liberalism, social democracy, conservatism, nationalism, socialism and transcendentalism. Each of these six ideologies furnishes rationales both for and against native title by focusing on different elements or preoccupations within the respective ideological traditions. A typological framework is proposed which outlines a range of ideal type positions in relation to native title.",
      "cited_by_count": 10,
      "type": "article",
      "source": {
        "name": "Australian Journal of Political Science",
        "type": "journal",
        "issn": [
          "1036-1146",
          "1363-030X"
        ]
      },
      "open_access": {
        "is_oa": false,
        "oa_status": "closed",
        "oa_url": null
      },
      "topics": [
        "Law in Society and Culture",
        "Legal principles and applications",
        "Freedom of Expression and Defamation"
      ],
      "referenced_works_count": 39,
      "url": "https://openalex.org/W2027074426"
    },
    {
      "openalex_id": "W2122387224",
      "doi": "10.1111/j.1467-6486.2010.00950.x",
      "title": "The New Political Role of Business in a Globalized World: A Review of a New Perspective on CSR and its Implications for the Firm, Governance, and Democracy",
      "authors": [
        {
          "name": "Andreas Georg Scherer",
          "openalex_id": "A5012262713",
          "orcid": "https://orcid.org/0000-0002-8671-1721",
          "institutions": [
            "University of Zurich"
          ]
        },
        {
          "name": "Guido Palazzo",
          "openalex_id": "A5112390691",
          "institutions": [
            "University of Lausanne"
          ]
        }
      ],
      "publication_year": 2010,
      "publication_date": "2010-05-01",
      "abstract": "abstract Scholars in management and economics widely share the assumption that business firms focus on profits only, while it is the task of the state system to provide public goods. In this view business firms are conceived of as economic actors, and governments and their state agencies are considered the only political actors. We suggest that, under the conditions of globalization, the strict division of labour between private business and nation‐state governance does not hold any more. Many business firms have started to assume social and political responsibilities that go beyond legal requirements and fill the regulatory vacuum in global governance. Our review of the literature shows that there are a growing number of publications from various disciplines that propose a politicized concept of corporate social responsibility. We consider the implications of this new perspective for theorizing about the business firm, governance, and democracy.",
      "cited_by_count": 1981,
      "type": "review",
      "source": {
        "name": "Journal of Management Studies",
        "type": "journal",
        "issn": [
          "0022-2380",
          "1467-6486"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "hybrid",
        "oa_url": "https://onlinelibrary.wiley.com/doi/pdfdirect/10.1111/j.1467-6486.2010.00950.x"
      },
      "topics": [
        "Corporate Social Responsibility Reporting",
        "Corporate Law and Human Rights",
        "Global trade, sustainability, and social impact"
      ],
      "referenced_works_count": 324,
      "url": "https://openalex.org/W2122387224"
    },
    {
      "openalex_id": "W4212808224",
      "doi": "10.1017/9781108951722",
      "title": "Rethinking Liberty before Liberalism",
      "authors": [
        {
          "name": "Hannah Dawson",
          "openalex_id": "A5108623198",
          "institutions": [
            "King's College London"
          ]
        },
        {
          "name": "Hannah Dawson",
          "openalex_id": "A5108623198"
        },
        {
          "name": "Hannah Dawson",
          "openalex_id": "A5108623198"
        },
        {
          "name": "Felicity Green",
          "openalex_id": "A5005352776"
        },
        {
          "name": "Martin van Gelderen",
          "openalex_id": "A5030923464"
        },
        {
          "name": "Hannah Dawson",
          "openalex_id": "A5108623198"
        },
        {
          "name": "Rachel Foxley",
          "openalex_id": "A5000638966",
          "orcid": "https://orcid.org/0000-0003-3851-7403"
        },
        {
          "name": "Annelien de Dijn",
          "openalex_id": "A5026215832"
        },
        {
          "name": "Sandrine Bergès",
          "openalex_id": "A5049332959",
          "orcid": "https://orcid.org/0000-0001-6904-3998"
        },
        {
          "name": "René Koekkoek",
          "openalex_id": "A5028965037"
        },
        {
          "name": "Eric Nelson",
          "openalex_id": "A5108827183"
        },
        {
          "name": "Matthijs Lok",
          "openalex_id": "A5022294620",
          "orcid": "https://orcid.org/0000-0003-1240-5868"
        },
        {
          "name": "Bruno Leipold",
          "openalex_id": "A5050762841",
          "orcid": "https://orcid.org/0000-0003-3640-1618"
        },
        {
          "name": "Lena Halldenius",
          "openalex_id": "A5001185781",
          "orcid": "https://orcid.org/0000-0002-9690-3022"
        },
        {
          "name": "Quentin Skinner",
          "openalex_id": "A5109255683"
        }
      ],
      "publication_year": 2022,
      "publication_date": "2022-02-03",
      "abstract": "Opens up new histories of freedom and republicanism by building on Quentin Skinner's ground-breaking Liberty before Liberalism nearly twenty five years after its initial publication. Leading historians and philosophers reveal the neo-Roman conception of liberty that Skinner unearthed as a normative and historical hermeneutic tool of enormous, ongoing power. The volume thinks with neo-Romanism to offer reinterpretations of individual thinkers, such as Montaigne, Grotius and Locke. It probes the role of neo-Roman liberty within hierarchies and structures beyond that of citizen and state – namely, gender, slavery, and democracy. Finally, it reassesses the relationships between neo-Romanism and other languages in the history of political thought: liberalism, conservatism, socialism, and the human rights tradition. The volume concludes with a major reappraisal by Skinner himself.",
      "cited_by_count": 9,
      "type": "book",
      "source": {
        "name": "Cambridge University Press eBooks",
        "type": "ebook platform",
        "issn": null
      },
      "open_access": {
        "is_oa": false,
        "oa_status": "closed",
        "oa_url": null
      },
      "topics": [
        "American Constitutional Law and Politics"
      ],
      "referenced_works_count": 0,
      "url": "https://openalex.org/W4212808224"
    },
    {
      "openalex_id": "W2029580809",
      "doi": "10.1353/phl.1997.0002",
      "title": "Gadamer on Art, Morality, and Authority",
      "authors": [
        {
          "name": "Kenneth L. Buckman",
          "openalex_id": "A5067491444"
        }
      ],
      "publication_year": 1997,
      "publication_date": "1997-04-01",
      "abstract": "Gadamer On Art, Morality, and Authority Kenneth L. Buckman Mary Devereaux claims that the problem of morality in the twentieth century and the anxiety caused by the fear of moral chaos fall into two main responses: (1) one looks to the past because the past seems to afford what the present lacks, i.e., a commonly shared and stable moral reality; and (2) one looks to the present and comes to terms with the way things are, a strategy of accommodation that revises our over inflated notions of knowledge and justification, particularly moral justification. 1 She sees Gadamer’s work as an additional option that responds to this problem. Devereaux says Gadamer’s response to the collapse of traditional morality is a turn to the experience of art wherein one derives morals from an extra-moral sense. Thus, Gadamer’s aesthetic example serves as a source of moral value. Devereaux says Gadamer’s project fails, in that his account contains an optimistic and unquestioned assumption that art always operates to our benefit (p. 71). However, Gadamer is appreciative of the deficiencies and dangers inherent in the kind of view he holds and does not hold an excessively optimistic, romanticized, naive, or prescriptive view of tradition. Gadamer’s account is a descriptive explication of the manner in which societies acquire the authority to form values. Devereaux’s account is to a large extent fair and accurate. However, despite her empathy with Gadamer’s account, she has reservations about the accuracy of Gadamer’s description of art and questions the depth to which he understands the current ethical crisis. She maintains that Gadamer’s analysis indicates a preference for a certain kind of art [End Page 144] (i.e., classical), and much of twentieth-century art (Tinguely, Cage, Burden, etc.) is outside the purview of Gadamer’s analysis. Though each individual artwork, in Gadamer’s view, can serve as a metaphor for ordering in general, Burden et al. aim, “not simply to introduce new materials or new subject matter within an existing artistic framework, but to alter the frame” (p. 69). These artists reconceive the very nature of artistic activity and change the rules by substituting the accidental, the incomplete, and the self-contradictory in place of selection and craft (pp. 69–70). Recent artistic principles have deconstructed the notion of order, showing the failure of order itself. Should we even grant that certain types of traditional art function as Gadamer has indicated? Though we might hope for the desired result of moral cohesion, Devereaux says, we are still faced with the problem of availability and the extent to which a person’s contact with art generates the necessary moral education. Her most serious charge is Gadamer’s “unquestioned assumption” that art always operates to our benefit (p. 71). The reliance on shared tradition, Devereaux argues, positions Gadamer to argue that the interaction with texts serves the positive moral function of social cohesion. However, Gadamer’s willingness to assign normative authority to tradition opens him to serious charges of conservatism, most prominently from the criticism and viewpoint of feminists and black scholars, and he “does not acknowledge those for whom the authority of that tradition is deeply and unquestionably problematic. Might not a coherent tradition, if achieved, function oppressively?” (p. 71). Devereaux claims that Gadamer rejects this possibility. Devereaux’s criticisms thus fall into these five areas: (1) Gadamer privileges a certain kind of art (i.e., classical); (2) for Gadamer art serves as an ordering, but it does not fulfill that capacity; (3) Gadamer is unclear about the availability and the degree of contact members of a society must have with art in order for the artwork to function in its moral capacity; (4) Gadamer wrongly assumes that art always operates to our benefit; and (5) Gadamer’s acceptance of the normative authority of tradition is oppressive. Devereaux errs in all of these criticisms. Devereaux’s criticism of Gadamer’s aesthetic theory in general, disconnected for the moment from its supposed moral implications, is that his analysis is concerned with traditional or classical forms of art, ignoring the less integrative forms of art of the late twentieth century. Though it may...",
      "cited_by_count": 19,
      "type": "article",
      "source": {
        "name": "Philosophy and literature",
        "type": "journal",
        "issn": [
          "0190-0013",
          "1086-329X"
        ]
      },
      "open_access": {
        "is_oa": false,
        "oa_status": "closed",
        "oa_url": null
      },
      "topics": [
        "Phenomenology and Existential Philosophy",
        "Karl Barth and Christian Theology",
        "Religion, Ecology, and Ethics"
      ],
      "referenced_works_count": 3,
      "url": "https://openalex.org/W2029580809"
    },
    {
      "openalex_id": "W2062661028",
      "doi": "10.1007/s10611-013-9452-z",
      "title": "On an entrepreneurial criminology of mass political violence",
      "authors": [
        {
          "name": "Nicolas Carrier",
          "openalex_id": "A5087041859",
          "orcid": "https://orcid.org/0000-0001-6891-048X",
          "institutions": [
            "Carleton University"
          ]
        },
        {
          "name": "Augustine S. J. Park",
          "openalex_id": "A5063458642",
          "orcid": "https://orcid.org/0000-0001-8418-3999",
          "institutions": [
            "Carleton University"
          ]
        }
      ],
      "publication_year": 2013,
      "publication_date": "2013-05-11",
      "abstract": null,
      "cited_by_count": 7,
      "type": "article",
      "source": {
        "name": "Crime Law and Social Change",
        "type": "journal",
        "issn": [
          "0925-4994",
          "1573-0751"
        ]
      },
      "open_access": {
        "is_oa": false,
        "oa_status": "closed",
        "oa_url": null
      },
      "topics": [
        "Wildlife Conservation and Criminology Analyses",
        "Criminal Justice and Corrections Analysis",
        "Crime, Illicit Activities, and Governance"
      ],
      "referenced_works_count": 163,
      "url": "https://openalex.org/W2062661028"
    },
    {
      "openalex_id": "W2034144524",
      "doi": "10.1017/s0140525x13001192",
      "title": "Differences in negativity bias underlie variations in political ideology",
      "authors": [
        {
          "name": "John R. Hibbing",
          "openalex_id": "A5052090039",
          "orcid": "https://orcid.org/0000-0002-6922-2459"
        },
        {
          "name": "Kevin B. Smith",
          "openalex_id": "A5060174894",
          "orcid": "https://orcid.org/0000-0003-0312-2284",
          "institutions": [
            "University of Nebraska–Lincoln"
          ]
        },
        {
          "name": "John R. Alford",
          "openalex_id": "A5036715670",
          "orcid": "https://orcid.org/0000-0003-1866-8271",
          "institutions": [
            "Rice University"
          ]
        }
      ],
      "publication_year": 2014,
      "publication_date": "2014-06-01",
      "abstract": "Abstract Disputes between those holding differing political views are ubiquitous and deep-seated, and they often follow common, recognizable lines. The supporters of tradition and stability, sometimes referred to as conservatives, do battle with the supporters of innovation and reform, sometimes referred to as liberals. Understanding the correlates of those distinct political orientations is probably a prerequisite for managing political disputes, which are a source of social conflict that can lead to frustration and even bloodshed. A rapidly growing body of empirical evidence documents a multitude of ways in which liberals and conservatives differ from each other in purviews of life with little direct connection to politics, from tastes in art to desire for closure and from disgust sensitivity to the tendency to pursue new information, but the central theme of the differences is a matter of debate. In this article, we argue that one organizing element of the many differences between liberals and conservatives is the nature of their physiological and psychological responses to features of the environment that are negative. Compared with liberals, conservatives tend to register greater physiological responses to such stimuli and also to devote more psychological resources to them. Operating from this point of departure, we suggest approaches for refining understanding of the broad relationship between political views and response to the negative. We conclude with a discussion of normative implications, stressing that identifying differences across ideological groups is not tantamount to declaring one ideology superior to another.",
      "cited_by_count": 583,
      "type": "article",
      "source": {
        "name": "Behavioral and Brain Sciences",
        "type": "journal",
        "issn": [
          "0140-525X",
          "1469-1825"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "bronze",
        "oa_url": "https://www.cambridge.org/core/services/aop-cambridge-core/content/view/72A29464D2FD037B03F7485616929560/S0140525X13001192a.pdf/div-class-title-differences-in-negativity-bias-underlie-variations-in-political-ideology-div.pdf"
      },
      "topics": [
        "Psychology of Moral and Emotional Judgment",
        "Social and Intergroup Psychology",
        "Cultural Differences and Values"
      ],
      "referenced_works_count": 440,
      "url": "https://openalex.org/W2034144524"
    },
    {
      "openalex_id": "W2611901353",
      "doi": "10.1177/1745691617746796",
      "title": "At Least Bias Is Bipartisan: A Meta-Analytic Comparison of Partisan Bias in Liberals and Conservatives",
      "authors": [
        {
          "name": "Peter H. Ditto",
          "openalex_id": "A5017229258",
          "orcid": "https://orcid.org/0000-0001-6647-7336",
          "institutions": [
            "University of California, Irvine"
          ]
        },
        {
          "name": "Brittany S. Liu",
          "openalex_id": "A5029949323",
          "institutions": [
            "Kalamazoo College"
          ]
        },
        {
          "name": "Connie J. Clark",
          "openalex_id": "A5048156711",
          "orcid": "https://orcid.org/0000-0002-3083-9179",
          "institutions": [
            "Florida State University"
          ]
        },
        {
          "name": "Sean P. Wojcik",
          "openalex_id": "A5008601847",
          "institutions": [
            "University of California, Irvine"
          ]
        },
        {
          "name": "Eric E. Chen",
          "openalex_id": "A5045679161",
          "institutions": [
            "University of California, Irvine"
          ]
        },
        {
          "name": "Rebecca Hofstein Grady",
          "openalex_id": "A5074186964",
          "orcid": "https://orcid.org/0000-0002-8587-0528",
          "institutions": [
            "University of California, Irvine"
          ]
        },
        {
          "name": "Jared Celniker",
          "openalex_id": "A5000153374",
          "orcid": "https://orcid.org/0000-0001-5123-8455",
          "institutions": [
            "University of California, Irvine"
          ]
        },
        {
          "name": "Joanne F. Zinger",
          "openalex_id": "A5038052962",
          "orcid": "https://orcid.org/0000-0001-9667-2458",
          "institutions": [
            "University of California, Irvine"
          ]
        }
      ],
      "publication_year": 2018,
      "publication_date": "2018-05-31",
      "abstract": "Both liberals and conservatives accuse their political opponents of partisan bias, but is there empirical evidence that one side of the political aisle is indeed more biased than the other? To address this question, we meta-analyzed the results of 51 experimental studies, involving over 18,000 participants, that examined one form of partisan bias—the tendency to evaluate otherwise identical information more favorably when it supports one’s political beliefs or allegiances than when it challenges those beliefs or allegiances. Two hypotheses based on previous literature were tested: an asymmetry hypothesis (predicting greater partisan bias in conservatives than in liberals) and a symmetry hypothesis (predicting equal levels of partisan bias in liberals and conservatives). Mean overall partisan bias was robust ( r = .245), and there was strong support for the symmetry hypothesis: Liberals ( r = .235) and conservatives ( r = .255) showed no difference in mean levels of bias across studies. Moderator analyses reveal this pattern to be consistent across a number of different methodological variations and political topics. Implications of the current findings for the ongoing ideological symmetry debate and the role of partisan bias in scientific discourse and political conflict are discussed.",
      "cited_by_count": 493,
      "type": "review",
      "source": {
        "name": "Perspectives on Psychological Science",
        "type": "journal",
        "issn": [
          "1745-6916",
          "1745-6924"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "green",
        "oa_url": "https://durham-repository.worktribe.com/preview/1348477/26561.pdf"
      },
      "topics": [
        "Social and Intergroup Psychology",
        "Electoral Systems and Political Participation",
        "Social and Cultural Dynamics"
      ],
      "referenced_works_count": 116,
      "url": "https://openalex.org/W2611901353"
    },
    {
      "openalex_id": "W2144744811",
      "doi": "10.1177/0013916506297831",
      "title": "Value Orientations to Explain Beliefs Related to Environmental Significant Behavior",
      "authors": [
        {
          "name": "Judith I. M. de Groot",
          "openalex_id": "A5015990513",
          "institutions": [
            "University of Groningen"
          ]
        },
        {
          "name": "Linda Steg",
          "openalex_id": "A5037506201",
          "orcid": "https://orcid.org/0000-0002-8375-9607",
          "institutions": [
            "University of Groningen"
          ]
        }
      ],
      "publication_year": 2007,
      "publication_date": "2007-08-02",
      "abstract": "In environmental literature it is argued that three different value orientations may be relevant for understanding environmental beliefs and intentions: egoistic, altruistic, and biospheric. Until now, the distinction between altruistic and biospheric value orientations has hardly been supported empirically. In this article, three studies are reported aimed to examine whether an egoistic, altruistic, and biospheric value orientation can indeed be distinguished empirically by using an adapted value instrument. Also, it is examined whether these value orientations are differently and uniquely related to general and specific beliefs and behavioral intention. Results provide support for the reliability and validity of the value instrument. All studies replicated the distinction into three value orientations, with sufficient internal consistency. Furthermore, when altruistic and biospheric goals conflict, they seem to provide a distinct basis for proenvironmental intentions. The value instrument could therefore be useful to better understand relationships between values, beliefs, and intentions related to environmentally significant behavior.",
      "cited_by_count": 1364,
      "type": "article",
      "source": {
        "name": "Environment and Behavior",
        "type": "journal",
        "issn": [
          "0013-9165",
          "1552-390X"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "green",
        "oa_url": "https://pure.rug.nl/ws/files/168781547/0013916506297831.pdf"
      },
      "topics": [
        "Environmental Education and Sustainability",
        "Environmental Sustainability in Business",
        "Behavioral Health and Interventions"
      ],
      "referenced_works_count": 64,
      "url": "https://openalex.org/W2144744811"
    },
    {
      "openalex_id": "W2495293000",
      "doi": "10.1057/9781137495785_12",
      "title": "Equal but Separate? LGBTI Rights in Contemporary South Africa",
      "authors": [
        {
          "name": "Hande Eslen‐Ziya",
          "openalex_id": "A5072687601",
          "orcid": "https://orcid.org/0000-0001-7113-6771"
        },
        {
          "name": "Aidan McGarry",
          "openalex_id": "A5082909971",
          "orcid": "https://orcid.org/0009-0009-3034-5783"
        },
        {
          "name": "Cheryl Potgieter",
          "openalex_id": "A5084598589",
          "orcid": "https://orcid.org/0000-0002-6404-9968"
        },
        {
          "name": "Finn Reygan",
          "openalex_id": "A5072832597",
          "orcid": "https://orcid.org/0000-0002-8414-2975"
        }
      ],
      "publication_year": 2015,
      "publication_date": "2015-01-01",
      "abstract": "Ideas are \"claims about descriptions of the world, causal relationships or the normative legitimacy of certain actions\" (Parsons 2002, 48). Beland and Waddan argue that ideas are the blueprints that \"reformers can mobilize as a coherent model for policy change\" (2007, 771). Yet, this does not mean that any progressive policy blueprint will be sustainable. Ideas are progressive if they foster respect and support LGBTI rights. Progressivism here is used as a general political philosophy, a reform tradition that has the aim to combat societal injustice, corruption, and inequality. Progressivism advocates social, political, and economic reform or changes usually in opposition to conservative ideologies. Conservative ideologies or conservatism, in this respect, promotes the preservation of traditional institutions and allows minimal and gradual change in society in the name of stability and continuity. Both progressivism and conservatism—as discursive tools—can be pursued by people, groups, or institutions. Based on Goldstein and Keohane's description, we define ideas as beliefs held by people in general (1993). These beliefs may reside within one's general cultural milieu, as well as in the foreground of policy debates as normative concepts. In this respect, we are especially interested in unpacking ideas regarding LGBTI rights and freedoms. How ideas challenge formal institutions that promote LGBTI rights is one of the main questions we tackle in this chapter. This is because it appears evident that in South Africa prejudice and homophobia against LGBTI people, as well as heteronormative beliefs, impact institutions and even subordinate them.",
      "cited_by_count": 4,
      "type": "book-chapter",
      "source": {
        "name": "Palgrave Macmillan US eBooks",
        "type": "ebook platform",
        "issn": null
      },
      "open_access": {
        "is_oa": false,
        "oa_status": "closed",
        "oa_url": null
      },
      "topics": [
        "African Sexualities and LGBTQ+ Issues",
        "Legal Issues in South Africa",
        "LGBTQ Health, Identity, and Policy"
      ],
      "referenced_works_count": 4,
      "url": "https://openalex.org/W2495293000"
    },
    {
      "openalex_id": "W2038347112",
      "doi": "10.3917/rfs.474.0929",
      "title": "Les valeurs de base de la personne : théorie, mesures et applications",
      "authors": [
        {
          "name": "Shalom H. Schwartz",
          "openalex_id": "A5010222716",
          "orcid": "https://orcid.org/0000-0003-2673-9332",
          "institutions": [
            "Hebrew University of Jerusalem"
          ]
        }
      ],
      "publication_year": 2006,
      "publication_date": "2006-11-24",
      "abstract": "Le concept de valeur en sciences sociales a souffert d’une absence de consensus, que ce soit sur la définition des valeurs, sur leur contenu ou sur la structure des relations qu’elles entretiennent les unes avec les autres ; il a également souffert de l’absence de méthodes fiables permettant de mesurer les valeurs. Pour valider une théorie destinée à combler, du moins partiellement, cette lacune, cet article présente des données provenant de plus de soixante-dix pays et utilisant deux instruments de mesure différents. On traite ici des valeurs de base que les individus reconnaissent comme telles dans toutes les cultures. La théorie distingue dix valeurs de base différentes et décrit la dynamique des oppositions et des compatibilités entre elles. Cette dynamique détermine une structure des relations entre valeurs, structure commune à des groupes appartenant à des cultures différentes, ce qui conduit à penser qu’il existerait une organisation universelle des motivations humaines. Les individus, comme les groupes, se distinguent par les priorités qu’ils donnent à ces valeurs. On examine ici d’où proviennent les différences de priorité que les individus accordent aux valeurs, et les conséquences en termes d’attitudes et de comportements qui découlent de ces différences de priorités. On traite ainsi des processus qui influent sur les valeurs, et de ceux par lesquels elles influent sur l’action.",
      "cited_by_count": 830,
      "type": "article",
      "source": {
        "name": "Revue Française de Sociologie",
        "type": "journal",
        "issn": [
          "0035-2969",
          "1958-5691"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "bronze",
        "oa_url": "https://www.cairn.info/load_pdf.php?ID_ARTICLE=RFS_474_0929&download=1"
      },
      "topics": [
        "Cultural Differences and Values",
        "Social Representations and Identity",
        "Social and Cultural Dynamics"
      ],
      "referenced_works_count": 57,
      "url": "https://openalex.org/W2038347112"
    },
    {
      "openalex_id": "W2786983643",
      "doi": "10.1111/1468-4446.12325",
      "title": "Ethno‐nationalist populism and the mobilization of collective resentment",
      "authors": [
        {
          "name": "Bart Bonikowski",
          "openalex_id": "A5023494795",
          "orcid": "https://orcid.org/0000-0003-0107-0644",
          "institutions": [
            "Harvard University Press"
          ]
        }
      ],
      "publication_year": 2017,
      "publication_date": "2017-11-01",
      "abstract": "Abstract Scholarly and journalistic accounts of the recent successes of radical‐right politics in Europe and the United States, including the Brexit referendum and the Trump campaign, tend to conflate three phenomena: populism, ethno‐nationalism and authoritarianism. While all three are important elements of the radical right, they are neither coterminous nor limited to the right. The resulting lack of analytical clarity has hindered accounts of the causes and consequences of ethno‐nationalist populism. To address this problem, I bring together existing research on nationalism, populism and authoritarianism in contemporary democracies to precisely define these concepts and examine temporal patterns in their supply and demand, that is, politicians’ discursive strategies and the corresponding public attitudes. Based on the available evidence, I conclude that both the supply and demand sides of radical politics have been relatively stable over time, which suggests that in order to understand public support for radical politics, scholars should instead focus on the increased resonance between pre‐existing attitudes and discursive frames. Drawing on recent research in cultural sociology, I argue that resonance is not only a function of the congruence between a frame and the beliefs of its audience, but also of shifting context. In the case of radical‐right politics, a variety of social changes have engendered a sense of collective status threat among national ethnocultural majorities. Political and media discourse has channelled such threats into resentments toward elites, immigrants, and ethnic, racial and religious minorities, thereby activating previously latent attitudes and lending legitimacy to radical political campaigns that promise to return power and status to their aggrieved supporters. Not only does this form of politics threaten democratic institutions and inter‐group relations, but it also has the potential to alter the contours of mainstream public discourse, thereby creating the conditions of possibility for future successes of populist, nationalist, and authoritarian politics.",
      "cited_by_count": 606,
      "type": "article",
      "source": {
        "name": "British Journal of Sociology",
        "type": "journal",
        "issn": [
          "0007-1315",
          "1468-4446"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "bronze",
        "oa_url": "https://onlinelibrary.wiley.com/doi/pdfdirect/10.1111/1468-4446.12325"
      },
      "topics": [],
      "referenced_works_count": 126,
      "url": "https://openalex.org/W2786983643"
    },
    {
      "openalex_id": "W4210771594",
      "doi": "10.4324/9781003133520",
      "title": "Anti-Gender Politics in the Populist Moment (Edition 1)",
      "authors": [
        {
          "name": "Agnieszka Graff",
          "openalex_id": "A5018131335",
          "orcid": "https://orcid.org/0000-0003-0468-0376",
          "institutions": [
            "Asociación por los Derechos Civiles",
            "Södertörn University"
          ]
        },
        {
          "name": "Elżbieta Korolczuk",
          "openalex_id": "A5086856279",
          "orcid": "https://orcid.org/0000-0002-8263-5530",
          "institutions": [
            "Asociación por los Derechos Civiles",
            "Södertörn University"
          ]
        }
      ],
      "publication_year": 2021,
      "publication_date": "2021-09-16",
      "abstract": "This book charts the new phase of global struggles around gender equality and sexual democracy: the ultraconservative mobilization against \"gender ideology\" and feminist efforts to counteract it. It argues that anti-gender campaigns, which emerged around 2010 in Europe, are not a simple continuation of the anti-feminist backlash dating back to the 1970s, but part of a new political configuration. Opposition to \"gender\" has become a key element of the rise of right-wing populism, which successfully harnesses the anxiety, shame and anger caused by neoliberalism and threatens to destroy liberal democracy.\\nAnti-Gender Politics in the Populist Moment offers a novel conceptualization of the relationship between the ultraconservative anti-gender movement and right-wing populist parties, examining the opportunistic synergy between these actors. The authors map the anti-gender campaigns as a global movement, putting the Polish case in a comparative perspective. They show that the anti-gender rhetoric is best understood as a reactionary critique of neoliberalism as a socio-cultural formation. The book also studies the recent wave of feminist mass mobilizations, viewing the transnational revolt of women as a left populist movement.\\nThis is an important study for those doing research in politics, cultural studies, gender and sexuality studies and sociology. It will also be useful for activists and policy makers.",
      "cited_by_count": 451,
      "type": "book",
      "source": {
        "name": "BiblioBoard Library Catalog (Open Research Library)",
        "type": "repository",
        "issn": null
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "gold",
        "oa_url": "https://library.oapen.org/handle/20.500.12657/50542"
      },
      "topics": [
        "Populism, Right-Wing Movements",
        "Gender Politics and Representation"
      ],
      "referenced_works_count": 196,
      "url": "https://openalex.org/W4210771594"
    },
    {
      "openalex_id": "W2165242947",
      "doi": "10.1016/j.wsif.2012.10.001",
      "title": "The ‘politics of intimate’ at the intersection of neo-liberalism and neo-conservatism in contemporary Turkey",
      "authors": [
        {
          "name": "Feride Acar",
          "openalex_id": "A5007222247",
          "orcid": "https://orcid.org/0000-0002-2874-2511",
          "institutions": [
            "Middle East Technical University"
          ]
        },
        {
          "name": "Gülbanu Altunok",
          "openalex_id": "A5084165616",
          "institutions": [
            "Bilkent University"
          ]
        }
      ],
      "publication_year": 2012,
      "publication_date": "2012-11-08",
      "abstract": null,
      "cited_by_count": 276,
      "type": "article",
      "source": {
        "name": "Women s Studies International Forum",
        "type": "journal",
        "issn": [
          "0277-5395",
          "1879-243X"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "bronze",
        "oa_url": "https://www.sciencedirect.com/science/article/pii/S0277539512001252"
      },
      "topics": [
        "Turkey's Politics and Society",
        "Gender Politics and Representation",
        "Historical Gender and Feminism Studies"
      ],
      "referenced_works_count": 41,
      "url": "https://openalex.org/W2165242947"
    },
    {
      "openalex_id": "W2902261557",
      "doi": "10.31273/fd.n3.2018.291",
      "title": "Culture/ Religion/ Tradition vs Modern/ Secular/ Foreign",
      "authors": [
        {
          "name": "Chitra Nagarajan",
          "openalex_id": "A5062719276"
        }
      ],
      "publication_year": 2018,
      "publication_date": "2018-11-27",
      "abstract": "This article examines the binary of culture/ religion/ tradition and modern/ secular/ foreign and its impact on women’s human rights struggles in particular in northern Nigeria. This binary is commonly perpetuated by state and non-state actors, including politicians, community leaders and religious leaders, who weaponise culture, religion and tradition to resist the struggle for gender equality. It highlights how progress around some concerns, such as rape of young girls, has occurred concurrently with attacks on other rights, particularly sexual and reproductive rights including abortion and sex outside marriage, and of those with non-normative sexual orientations, gender identities and gender expressions. This hardening of attitudes and narrowing of what is seen as permissible not only obscures the diversity of how people lived and thought in the past but is also far from the reality of how people live their lives presently. It further reflects the increased influence of religious fundamentalism and conservatism in northern Nigeria.[1]&#x0D; &#x0D; [1] I used the term religious fundamentalism as distinct from religious conservatism and to signify the project whereby those engaged in it ‘construct ‘tradition’ in a way that is highly selective, at the same time as dogmatically insisting that their reconstructions of text are ‘sacred’ and so unable to be questioned’ (Cowden and Sahgal, 2017, 15), deny ‘the possibility of interpretation and reinterpretation even while its adherents engage in both’ (Bennoune, 2013, 16) and centre the importance of control of women’s bodies and sexuality and rigid gender roles. Religious fundamentalists ‘believe in the imposition of God’s law, something called the Sharia – their version of it rather than others’ – on Muslims everywhere and in the creation of what they deem to be Islamic states or disciplined diasporic communities ruled by these laws,’ denounce secularists, seek to bring politicised religion into all spheres, want to police, judge and change the behaviour, appearance and comportment of others and aim to sharply limit women’s rights, sometimes in the name of protection, respect and difference (Bennoune, 2013, 16). In contrast, while religious conservatism remains problematic, it does not make claims to possessing the only true interpretation and can be ‘protective of certain traditional spaces for women as well as being capable of reform and change’ (Cowden and Sahgal, 2017, 18).",
      "cited_by_count": 2,
      "type": "article",
      "source": {
        "name": "Feminist Dissent",
        "type": "journal",
        "issn": [
          "2398-4139"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "diamond",
        "oa_url": "https://journals.warwick.ac.uk/index.php/feministdissent/article/download/291/343"
      },
      "topics": [
        "African Sexualities and LGBTQ+ Issues",
        "Historical and Contemporary Political Dynamics",
        "African studies and sociopolitical issues"
      ],
      "referenced_works_count": 21,
      "url": "https://openalex.org/W2902261557"
    },
    {
      "openalex_id": "W2184495610",
      "doi": null,
      "title": "Factors Related to Household Energy Use and Intention to Reduce It : The Role of Psychological and Socio-Demographic Variables",
      "authors": [
        {
          "name": "Wokje Abrahamse",
          "openalex_id": "A5020482298",
          "orcid": "https://orcid.org/0000-0002-8223-8359"
        },
        {
          "name": "Linda Steg",
          "openalex_id": "A5037506201",
          "orcid": "https://orcid.org/0000-0002-8375-9607"
        }
      ],
      "publication_year": 2011,
      "publication_date": "2011-01-01",
      "abstract": "This study explored the relationships between household energy use and householders' intention to reduce their energy use on the one hand, and psychological variables and socio-demographic variables on the other More specifically, the study examined whether the explanation of household energy use and intentions to reduce it could be informed by variables from the theory of planned behavior (TPB; Ajzen, 1985) and by variables from the value-belief-norm theory (VBN; Stern, et al., 1999), alongside socio-demographic variables. Household energy use appeared to be most strongly related to socio-demographic variables (income, household size, age), while attitudinal variables and self-transcendence values (tradition/security and power/achievement) were important too. Intention to reduce household energy use was positively related to perceived behavioral control and attitudes toward energy conservation. Implications of these results for future research in the domain of household energy use and conservation are discussed.",
      "cited_by_count": 342,
      "type": "article",
      "source": {
        "name": "University of Groningen research database (University of Groningen / Centre for Information Technology)",
        "type": "repository",
        "issn": null
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "green",
        "oa_url": "https://pure.rug.nl/ws/files/168778845/24707684.pdf"
      },
      "topics": [
        "Environmental Education and Sustainability",
        "Environmental Sustainability in Business",
        "Social Acceptance of Renewable Energy"
      ],
      "referenced_works_count": 37,
      "url": "https://openalex.org/W2184495610"
    },
    {
      "openalex_id": "W2153789194",
      "doi": "10.1002/wcc.269",
      "title": "Public engagement with climate change: the role of human values",
      "authors": [
        {
          "name": "Adam Corner",
          "openalex_id": "A5108696664",
          "institutions": [
            "Cardiff University",
            "Climate Outreach",
            "Tyndall Centre"
          ]
        },
        {
          "name": "Ezra M. Markowitz",
          "openalex_id": "A5012064715",
          "orcid": "https://orcid.org/0000-0002-8140-2970",
          "institutions": [
            "Columbia University",
            "Earth Island Institute",
            "Princeton University"
          ]
        },
        {
          "name": "Nick Pidgeon",
          "openalex_id": "A5053365910",
          "institutions": [
            "Cardiff University",
            "Tyndall Centre"
          ]
        }
      ],
      "publication_year": 2014,
      "publication_date": "2014-01-21",
      "abstract": "A long history of interdisciplinary research highlights the powerful role that human values play in shaping individuals' engagement with environmental issues. That certain values are supportive of proenvironmental orientation and behavior is now well established. But as the challenge of communicating the risks of climate change has grown increasingly urgent, there has been a rise in interest around how values shape public engagement with this issue. In the current paper, we review the growing body of work that explores the role of human values (and the closely related concept of cultural worldviews) in public engagement with climate change. Following a brief conceptual overview of values and their relationship to environmental engagement in general, we then provide a review of the literature linking value‐orientations and engagement with climate change. We also review both academic and ‘gray’ literature from civil society organizations that has focused on how public messages about climate change should be framed, and discuss the significance of research on human values for climate change communication strategies. This article is categorized under: Perceptions, Behavior, and Communication of Climate Change &gt; Perceptions of Climate Change",
      "cited_by_count": 402,
      "type": "article",
      "source": {
        "name": "Wiley Interdisciplinary Reviews Climate Change",
        "type": "journal",
        "issn": [
          "1757-7780",
          "1757-7799"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "hybrid",
        "oa_url": "https://onlinelibrary.wiley.com/doi/pdfdirect/10.1002/wcc.269"
      },
      "topics": [
        "Climate Change Communication and Perception",
        "Environmental Education and Sustainability",
        "Media Influence and Health"
      ],
      "referenced_works_count": 108,
      "url": "https://openalex.org/W2153789194"
    },
    {
      "openalex_id": "W4307699042",
      "doi": "10.1093/oxfordhb/9780198861201.013.5",
      "title": "Ordoliberalism and Conservatism",
      "authors": [
        {
          "name": "Thomas Biebricher",
          "openalex_id": "A5049457565",
          "orcid": "https://orcid.org/0000-0002-8827-5142",
          "institutions": [
            "Goethe University Frankfurt"
          ]
        }
      ],
      "publication_year": 2022,
      "publication_date": "2022-10-20",
      "abstract": "Abstract Despite its undeniable liberal core, Ordoliberalism is deeply influenced by conservative thought, as it developed specifically in the German tradition. This chapter explores themes and motives that Ordoliberalism draws from or shares with (German) conservatism, These themes range from the crucial significance attributed to matters of culture and religion to the quest for a normative foundation inherent in ‘the natural’—or rather the naturalised. As will become clear, ordoliberal thought in many of its varieties draws on these genuinely conservative ideational resources, particularly, to make the normative case for its reform ideas. Finally, the controversial link between Ordoliberalism and what is referred to as ‘young conservatism’ associated with the ‘Conservative Revolution’ in Germany is analysed and discussed.",
      "cited_by_count": 1,
      "type": "book-chapter",
      "source": {
        "name": "Oxford University Press eBooks",
        "type": "ebook platform",
        "issn": null
      },
      "open_access": {
        "is_oa": false,
        "oa_status": "closed",
        "oa_url": null
      },
      "topics": [
        "Political Economy and Marxism"
      ],
      "referenced_works_count": 15,
      "url": "https://openalex.org/W4307699042"
    },
    {
      "openalex_id": "W2611268999",
      "doi": "10.1146/annurev-psych-122216-011911",
      "title": "Attitudes and Attitude Change",
      "authors": [
        {
          "name": "Dolores Albarracín",
          "openalex_id": "A5022090336",
          "orcid": "https://orcid.org/0000-0002-9878-942X",
          "institutions": [
            "University of Illinois Urbana-Champaign"
          ]
        },
        {
          "name": "Sharon Shavitt",
          "openalex_id": "A5030738654",
          "orcid": "https://orcid.org/0000-0001-6052-3397",
          "institutions": [
            "University of Illinois Urbana-Champaign"
          ]
        }
      ],
      "publication_year": 2017,
      "publication_date": "2017-08-25",
      "abstract": "This review covers research on attitudes and attitude change published between 2010 and 2017. We characterize this period as one of significant progress toward an understanding of how attitudes form and change in three critical contexts. The first context is the person, as attitudes change in connection to values, general goals, language, emotions, and human development. The second context is social relationships, which link attitude change to the communicator of persuasive messages, social media, and culture. The third context is sociohistorical and highlights the influence of unique events, including sociopolitical, economic, and climatic occurrences. In conclusion, many important recent findings reflect the fact that holism, with a focus on situating attitudes within their personal, social, and historical contexts, has become the zeitgeist of attitude research during this period.",
      "cited_by_count": 389,
      "type": "review",
      "source": {
        "name": "Annual Review of Psychology",
        "type": "journal",
        "issn": [
          "0066-4308",
          "1545-2085"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "bronze",
        "oa_url": "https://www.annualreviews.org/doi/pdf/10.1146/annurev-psych-122216-011911"
      },
      "topics": [
        "Cultural Differences and Values",
        "Social and Intergroup Psychology",
        "Consumer Behavior in Brand Consumption and Identification"
      ],
      "referenced_works_count": 142,
      "url": "https://openalex.org/W2611268999"
    },
    {
      "openalex_id": "W2062321291",
      "doi": "10.1080/14650040802203703",
      "title": "Militarism, Realism, Just War, or Nonviolence? Critical Geopolitics and the Problem of Normativity",
      "authors": [
        {
          "name": "Nick Megoran",
          "openalex_id": "A5027634872",
          "orcid": "https://orcid.org/0000-0002-5830-2293",
          "institutions": [
            "Newcastle University"
          ]
        }
      ],
      "publication_year": 2008,
      "publication_date": "2008-08-18",
      "abstract": "Abstract Despite illuminating multiple modalities by which armed conflict is discursively justified, critical geopolitics can be criticised for providing a weak normative engagement with the social institution and practices of warfare. This has limited the impact of this school of thought outside of geography and critical security studies at a time when the ethics of military intervention have been prominent in public debate. This article explores the moral discourse of critical geopolitics through an examination of Gerard Toal's writings on Iraq and Bosnia. This scholarship is reviewed in the light of Coates's typology of major traditions of moral reflection on war – militarism, realism, just war theory, and pacifism/nonviolence. This analysis interrogates Toal's narratives, in which American military intervention was advocated in the Former Yugoslavia and opposed in Iraq. This suggests that rather than a thoroughgoing commitment to pacifism/nonviolence, or a blanket cynicism about American foreign policy, Toal's thinking includes an underlying attachment to some form of just war reasoning. However, its implicit and partial appropriation leads to a certain incoherence and selectivity that calls for further reflection. This presents a challenge to critical geopolitics. If it chooses to engage more explicitly with just war theory, its insights into identity and militarism could in turn inform a reworking of aspects of the theory, thereby facilitating critical geopolitics' engagement with wider public anti-militaristic modes of discourse. However, as this risks blunting the political potential of the project and repeating the mistakes of twentieth-century geopolitical thought, the paper concludes with a call for a wholehearted commitment to nonviolence. Notes 1. L. Dowler and J. Sharp, 'A Feminist Geopolitics?', Space & Polity 5/3 (2001) pp. 165–176: 168–9. 2. P. Routledge, 'Critical Geopolitics and Terrains of Resistance', Political Geography 15/6–7 (1996) pp. 509–531. 3. S. Dalby, 'Geopolitics, the Bush Doctrine, and War on Iraq', The Arab World Geographer 6/1 (2003) pp. 7–18. 4. M. Heffernan, 'Balancing Visions: Comments on Gearóid Ó Tuathail's Critical Geopolitics', Political Geography 19/3 (2000) pp. 347–352: 351. 5. M. Polelle, Raising Cartographic Consciousness: The Social and Foreign Policy Vision of Geopolitics in the Twentieth Century (Oxford: Lexington 1999) p. 5. 6. K. Dodds, Global Geopolitics: A Critical Introduction (London: Pearson Education 2005) p. 228. 7. S. Dalby, 'Writing Critical Geopolitics: Campbell, Ó Tuathail, Reynolds and Dissident Skepticism', Political Geography 15/6–7 (1996) pp. 655–660: 655. 8. L. Dowler and J. Sharp, 'A Feminist Geopolitics?', Space & Polity 5/3 (2001) pp. 165–176: 167. 9. J. P. Sharp, 'Remasculinising Geo-Politics? Comments on Gearoid Ó Tuathail's Critical Geopolitics', Political Geography 19/3 (2000) pp. 361–364: 362. 10. A. Murphy, 'Review of \"Geopolitical Traditions: A Century of Gepolitical Thought\", by Klaus Dodds and David Atkinson', Annals of the Association of American Geographers 91/4 (2001) pp. 767–769: 769. 11. P. Kelly, 'A Critique of Critical Geopolitics', Geopolitics 11/1 (2006) pp. 24–53: 43. 12. Ibid., p. 48. 13. G. Ó Tuathail and S. Dalby, 'Introduction: Rethinking Geopolitics: Towards a Critical Geopolitics', in G. Ó Tuathail and S. Dalby (eds.), Rethinking Geopolitics (London: Routledge 1998) p. 14. 14. S. Dalby, 'Post-Cold War Security in the New Europe', in J. O'Loughlin and H. v. d. Wusten (eds.), The New Political Geography of Eastern Europe (London: Bellhaven 1993) pp. 71–85. 15. P. E. Gottfried, Multiculturalism and the Politics of Guilt: Towards a Secular Theocracy (London: University of Missouri Press 2002). 16. R. Bainton, Christian Attitudes Toward War and Peace: A Historical Survey and Critical Re-evaluation (London: Hodder and Stoughton 1961); for a discussion of this taxonomy, see D. Little, '\"Holy War\" Appeals and Western Christianity: A Reconsideration of Bainton's Approach', in J. Kelsay and J. T. Johnson (eds.), Just War and Jihad: Historical and Theoretical Perspectives on War and Peace in Western and Islamic Traditions (London: Greenwood 1991) pp. 121–139. 17. A. J. Coates, The Ethics of War (Manchester: Manchester University Press 1997). 18. Ibid., p. 41. 19. J. Bourke, An Intimate History of Killing: Face-to-Face Killing in Twentieth-Century Warfare (London: Granta 1999). 20. J. Riley-Smith, What Were The Crusades? (London: Macmillan 1992). 21. M. Mann, States, War and Capitalism: Studies in Political Sociology (Oxford: Basil Blackwell 1988) p. ix. 22. M. Zalewski and C. Enloe, 'Questions about Identity in International Relations', in K. Booth and S. Smith (eds.), International Relations Theory Today (Cambridge: Polity 1995) pp. 279–305: 294. 23. K. Waltz, 'International Politics Is Not Foreign Policy', Security Studies 6/1 (1996) pp. 54–57. 24. K. Waltz, Theory of International Politics (London: McGraw-Hill 1979) p. 107. 25. R. Schweller, 'Fantasy Theory', Review of International Studies 25/1 (1999) pp. 147–150: 150. 26. G. Ó Tuathail, 'The Patterned Mess of History and the Writing of Critical Geopolitics: A Reply to Dalby', Political Geography 15/6/7 (1996) pp. 661–665: 663. 27. J. Mearsheimer, 'Hans Morgenthau and the Iraq War: Realism Versus Neo-Conservatism', www.opendemocracy.net 19-05-2005 (2005). 28. R. Ashley, 'The Geopolitics of Geopolitical Space: Toward a Critical Social Theory of International Politics', Alternatives 12/4 (1987) pp. 403–434: 241. 29. T. Biersteker and C. Weber, 'The Social Construction of State Sovereignty', in T. Biersteker and C. Weber (eds.), State Sovereignty as Social Construct (Cambridge: Cambridge University Press 1996) pp. 4–5. 30. A. Wendt, 'Anarchy Is What States Make Of It: The Social Construction of Power Politics (1992)', in J. Der Derian (ed.), International Theory: Critical Investigations (London: Macmillan 1995) pp. 129–177: 132. 31. For more on war in the Hebrew Bible, see S. Nidditch, War in the Hebrew Bible: A Study in the Ethics of Violence (Oxford: Oxford University Press 1993). 32. See, inter alia, R. Musto, The Catholic Peace Tradition (New York: Orbis Books 1986); A. Kreider, Worship and Evangelism in Pre-Christendom (Cambridge: Grove 1995). 33. J. T. Johnson, 'Historical Roots and Sources of the Just War Tradition in Western Culture', in J. Kelsay and J. T. Johnson (eds.), Just War and Jihad: Historical and Theoretical Perspectives on War and Peace in Western and Islamic Traditions (London: Greenwood 1991) pp. 1–30. 34. Information in this and the following paragraph is distilled from N. Megoran, The War on Terror: How Should Christians Respond? (Nottingham: InterVarsity Press 2007) pp. 133–135. 35. The following discussion is necessarily simplified: much could be written on each of the criteria, and the relationship between them. For example, some theorists have posited the existence of a 'supreme emergency', a complicated situation whereby jus in bello could be set aside if jus ad bellum were satisfied. See B. Orend, 'Is There a Supreme Emergency Exemption?', in M. Evans (ed.), Just War Theory: A Reappraisal (Edinburgh: Edinburgh University Press 2005) pp. 134–153 and M. Walzer, Just and Unjust Wars: A Moral Argument with Historical Illustrations (New York: Basic Books 2000 [orig. 1977]), Chapter 16; against this, see O. O'Donovan, Just War Revisited (Cambridge: Cambridge University Press 2003) p. 10. 36. M. Evans, 'Moral Theory and the Idea of A Just War', in M. Evans (ed.), Just War Theory: A Reappraisal (Edinburgh: Edinburgh University Press 2005) pp. 1–21: 13. 37. O. O'Donovan, Just War Revisited (Cambridge: Cambridge University Press 2003) p. 13. 38. C. Reed, Just War? (London: SPCK 2004). 39. J. Welsh, (ed.), Humanitarian Intervention and International Relations (Oxford: Oxford University Press 2004). 40. J. Kelsay and J. T. Johnson, 'Just War and Jihad: Historical and Theoretical Perspectives on War and Peace in Western and Islamic Traditions' (London: Greenwood 1991). 41. M. Walzer, Just and Unjust Wars: A Moral Argument with Historical Illustrations (New York: Basic Books 2000 [orig. 1977]) p. xxi. 42. Ibid., p. xx. 43. M. Hayden, 'Security Beyond the State: Cosmopolitanism, Peace and the Role of Just War Theory', in M. Evans (ed.), Just War Theory: A Reappraisal (Edinburgh: Edinburgh University Press 2005) pp. 157–176: 157–158. 44. Witness the absurd position of many liberals in 2003, who held that an invasion of Iraq would be morally justified if the United Nations passed a 'second resolution', but not otherwise. 45. M. Walzer, Just and Unjust Wars: A Moral Argument with Historical Illustrations (New York: Basic Books 2000 [orig. 1977]) p. xxi. 46. R. Musto, The Catholic Peace Tradition (New York: Orbis Books 1986) p. 131. 47. J. T. Johnson, 'Just War Theory: Responding Morally to Global Terrorism', in C. W. J. Kegley (ed.), The New Global Terrorism: Characteristics, Causes, Controls (Upper Saddle River: Prentice Hall 2003) pp. 223–238: 238. 48. M. Evans, 'In Humanity's Name: Democracy and the Right to Wage War', in M. Evans (ed.), Just War Theory: A Reappraisal (Edinburgh: Edinburgh University Press 2005) pp. 71–89: 71–72. 49. D. Cole, 'Just War, Penance, and the Church', Pro Ecclesia 11/3 (2002) pp. 313–328; J. Elshtain, Just War Against Terror: The Burden of American Power in a Violent World (New York: Basic Books 2003). 50. K. Lawton, 'Kim Lawton Interviews Jean Bethke Elshtain, March 24, 2006.', PBS Radio (2006), available at http://www.pbs.org/wnet/religionandethics/week930/interview.html, accessed April 2006. 51. L. Griffith, The War on Terrorism and the Terror of God (Cambridge: Eerdmans 2002) p. 20. 52. M. Evans, 'In Defence of Just War Theory', in M. Evans (ed.), Just War Theory: A Reappraisal (Edinburgh: Edinburgh University Press 2005) pp. 203–222: 214. 53. L. Griffith, The War on Terrorism and the Terror of God (Cambridge: Eerdmans 2002) p. 4. 54. S. Zunes et al., 'Introduction', in S. Zunes, L. Kurtz, and S. Asher (eds.), Nonviolent Social Movements: A Geographical Perspective (Oxford: Blackell 1999) pp. 1–5: 1. 55. R. Horsley, Jesus and the Spiral of Violence: Popular Jewish Resistance in Roman Palestine (Cambridge: Harper & Row 1987); R. Horsley, Jesus and Empire: The Kingdom of God and the New World Disorder (Minneapolis: Fortress Press 2003); R. Horsley (ed.), Paul and the Roman Imperial Order (London: Trinity Press 2004); B. Walsh and S. Keesmat, Colossians Remixed: Subverting the Empire (Milton Keynes: Paternoster Press 2004). 56. A. Kreider, Worship and Evangelism in Pre-Christendom (Cambridge: Grove 1995). 57. R. Musto, The Catholic Peace Tradition (New York: Orbis Books 1986). 58. G. Sharp, Power and Struggle (Boston: Porter Sargent 1973) pp. 75–78; S. Zunes et al. (eds.), Nonviolent Social Movements: A Geographical Perspective (Oxford: Blackell 1999). 59. L. Tolstoy, The Kingdom of God is Within You; Christianity and Patriotism (London: J. M. Dent and Co. 1905). 60. Sharp (note 58) p. 82. 61. R. Gregg, The Power of Non-Violence (London: George Routledge and Sons 1936). 62. M. Banerjee, The Pathan Unarmed: Opposition and Memory in the North West Frontier (Oxford: James Currey 2000); E. Easwaran, Nonviolent Soldier of Islam: Badshah Khan, A Man to Match His Mountains (Tomales, CA: Nilgiri Press 1984). 63. M. L. J. King, Strength to Love (Philadelphia: Fortress Press 1981). 64. G. Sharp, The Methods of Nonviolent Action (Boston: Porter Sargent 1973). 65. G. Sharp, The Dynamics of Nonviolent Action (Boston: Porter Sargent 1973); G. Sharp, Power and Struggle (Boston: Porter Sargent 1973). 66. Zunes et al., Nonviolent Social Movements (note 58). 67. Zunes et al., 'Introduction' (note 54) p. 1. 68. Ibid. 69. G. Ó Tuathail, 'The Effacement of Place? US Foreign Policy and the Spatiality of the Gulf Crisis', Antipode 25/1 (1993) pp. 4–31: 26. 70. Ibid., p. 5. 71. G. Ó Tuathail, '\"Just out looking for a fight\": American Affect and the Invasion of Iraq', Antipode (2003) pp. 857–80: 863. 72. G. Ó Tuathail, 'An Anti-Geopolitical Eye: Maggie O'Kane in Bosnia, 1992–3', Gender, Place and Culture 3/2 (1996) pp. 171–185: 171. 73. G. Ó Tuathail, Critical Geopolitics: The Politics of Writing Global Space (London: Routledge 1996) Chapter 6. 74. Ó Tuathail, 'An Anti-Geopolitical Eye' (note 72). 75. G. Ó Tuathail, 'The Ethnic Cleansing of a \"Safe Area\": The Fall of Srebrenica and the Ethics of UN-Governmentality', in J. Proctor and D. Smith (eds.), Geography and Ethics: Journeys in a Moral Terrain (London: Routledge 1999) pp. 120–131. 76. G. Ó Tuathail, 'Theorizing Practical Geopolitical Reasoning: The Case of the United States' Response to the War in Bosnia', Political Geography 21 (2002) pp. 602–628: 603. 77. G. Toal, 'Statement, to Bosnia and Herzegovina: Unfinished Business. Hearing before the Subcommittee on Europe and Emerging Threats of the Committee on International Relations, House of Representatives, 109th Congress, First Session, April 6 2005. Serial no. 109-22' (2005) pp. 11–18: 18. 78. Ó Tuathail, 'Theorizing Practical Geopolitical Reasoning' (note 76) p. 603. 79. G. Toal, 'British Acquiescence in the Destruction of Bosnia', Geopolitics 9/2 (2004) pp. 492–500: 500. 80. Ó Tuathail, 'The Ethnic Cleansing of a \"Safe Area\"' (note 75) p. 125. 81. G. Toal, 'British Acquiescence' (note 79) p. 500. 82. Ó Tuathail, 'The Effacement of Place?' (note 69) p. 17. 83. Ibid., p. 8. 84. N. Chomsky, The New Military Humanism: Lessons From Kosovo (London: Pluto 1999) pp. 75–78. 85. 'Statement of principles' 2005, Henry Jackson Society website, available at <http://zope06.v.servelocity.net/hjs, accessed May 2007. 86. G. Toal, 'British Acquiescence' (note 79) pp. 499–500. 87. Ó Tuathail, 'The Ethnic Cleansing of a \"Safe Area\"' (note 75) p. 131. 88. G. Toal, 'British Acquiescence' (note 79) p. 500. 89. M. Volf, Exclusion and Embrace: A Theological Exploration of Identity, Otherness, and Reconciliation (Nashville: Abingdon Press 1996) p. 306. 90. K. Booth, 'Beyond Critical Security Studies', in Critical Security Studies and World Politics (London: Lynne Rienner 2005) p. 273. 91. Ó Tuathail, Critical Geopolitics (note 73) p. 10. 92. E. J. Popke, 'Recasting Geopolitics: The Discursive Scripting of the International Monetary Fund', Political Geography 13/3 (1994) pp. 255–269: 225. 93. J. Agnew, Geopolitics: Re-Visioning World Politics (London: Routledge 2003). 94. K. Dodds, 'Geopolitics and Foreign Policy: Recent Developments in Anglo-American Political Geography and International Relations', Progress in Human Geography 18/2 (1994) pp. 186–208: 276. 95. S. Dalby, 'Codes, Vision, Knowledge: The Reasoning Practices of Critical Geopolitics', paper presented at the annual conference of Canadian Association of Geographers, Victoria, BC, 2003, p. 12. 96. See for example S. Dalby, 'Post-Cold War Security in the New Europe', in J. O'Loughlin and H. v. d. Wusten (eds.), The New Political Geography of Eastern Europe (London: Bellhaven 1993) pp. 71–85; M. Evangelista, Unarmed Forces: The Transnational Movement to End the Cold War (London: Cornell University Press 1999); M. McGwire, Perestroika and Soviet National Security (Washington: The Brookings Institution 1991); P. Ackerman and J. Duval, A Force More Powerful: A Century of Nonviolent Conflict (New York: St Martin's Press 2000). 97. See the modern classic study by the Mennonite J. H. Yoder, The Politics of Jesus: Vicit Agnus Noster (Carlisle: Paternoster Press 1994 [orig. 1972]); the work of Griffith, King, Kreider, and Tolstoy (cited above) would also fall into this category. For more on the author's adoption of this position, see N. Megoran, 'Christianity and Political Geography: On Faith And Geopolitical Imagination', Brandywine Review of Faith and International Affairs 2/2 (2004) pp. 40–46. 98. S. Dalby, 'Anthropocene Geopolitics: Globalisation, Empire, Environment and Critique', Geography Compass 1/1 (2007) pp. 103–118: 16. 99. M. Polelle, Raising Cartographic Consciousness: The Social and Foreign Policy Vision of Geopolitics in the Twentieth Century (Oxford: Lexington 1999) p. 145.",
      "cited_by_count": 64,
      "type": "article",
      "source": {
        "name": "Geopolitics",
        "type": "journal",
        "issn": [
          "1465-0045",
          "1557-3028"
        ]
      },
      "open_access": {
        "is_oa": false,
        "oa_status": "closed",
        "oa_url": null
      },
      "topics": [
        "War, Ethics, and Justification",
        "Global Peace and Security Dynamics",
        "Global Security and Public Health"
      ],
      "referenced_works_count": 0,
      "url": "https://openalex.org/W2062321291"
    },
    {
      "openalex_id": "W2040603241",
      "doi": "10.1017/s0140525x11000021",
      "title": "Parasite-stress promotes in-group assortative sociality: The cases of strong family ties and heightened religiosity",
      "authors": [
        {
          "name": "Corey L. Fincher",
          "openalex_id": "A5066249339",
          "orcid": "https://orcid.org/0000-0002-8450-6572",
          "institutions": [
            "University of New Mexico"
          ]
        },
        {
          "name": "Randy Thornhill",
          "openalex_id": "A5110450667"
        }
      ],
      "publication_year": 2012,
      "publication_date": "2012-01-31",
      "abstract": "Abstract Throughout the world people differ in the magnitude with which they value strong family ties or heightened religiosity. We propose that this cross-cultural variation is a result of a contingent psychological adaptation that facilitates in-group assortative sociality in the face of high levels of parasite-stress while devaluing in-group assortative sociality in areas with low levels of parasite-stress. This is because in-group assortative sociality is more important for the avoidance of infection from novel parasites and for the management of infection in regions with high levels of parasite-stress compared with regions of low infectious disease stress. We examined this hypothesis by testing the predictions that there would be a positive association between parasite-stress and strength of family ties or religiosity. We conducted this study by comparing among nations and among states in the United States of America. We found for both the international and the interstate analyses that in-group assortative sociality was positively associated with parasite-stress. This was true when controlling for potentially confounding factors such as human freedom and economic development. The findings support the parasite-stress theory of sociality, that is, the proposal that parasite-stress is central to the evolution of social life in humans and other animals.",
      "cited_by_count": 514,
      "type": "article",
      "source": {
        "name": "Behavioral and Brain Sciences",
        "type": "journal",
        "issn": [
          "0140-525X",
          "1469-1825"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "bronze",
        "oa_url": "https://www.cambridge.org/core/services/aop-cambridge-core/content/view/0331C3331E16F6C15BB9A5AF1AA07108/S0140525X11000021a.pdf/div-class-title-parasite-stress-promotes-in-group-assortative-sociality-the-cases-of-strong-family-ties-and-heightened-religiosity-div.pdf"
      },
      "topics": [
        "Cultural Differences and Values",
        "Psychology of Moral and Emotional Judgment",
        "Evolutionary Psychology and Human Behavior"
      ],
      "referenced_works_count": 357,
      "url": "https://openalex.org/W2040603241"
    },
    {
      "openalex_id": "W1997244086",
      "doi": "10.1093/ejil/15.5.907",
      "title": "The Legitimacy of International Law: A Constitutionalist Framework of Analysis",
      "authors": [
        {
          "name": "Mattias Kumm",
          "openalex_id": "A5007379734",
          "orcid": "https://orcid.org/0000-0002-2576-407X"
        }
      ],
      "publication_year": 2004,
      "publication_date": "2004-11-01",
      "abstract": "Does international law suffer from a legitimacy crisis? International law today is no longer adequately described or assessed as the law of a narrowly circumscribed domain of foreign affairs. Its obligations are no longer firmly grounded in the specific consent of states and its interpretation and enforcement is no longer primarily left to states. Contemporary international law has expanded its scope, loosened its link to state consent and strengthened compulsory adjudication and enforcement mechanisms. This partial emancipation from state control means that domestic accountability mechanisms are becoming ineffective as a means to legitimate international law. Correspondingly, the legitimacy of international law is increasingly challenged in domestic settings in the name of democracy and constitutional selfgovernment. This article addresses this challenge. It develops a constitutionalist model for assessing the legitimacy of international law that takes seriously the commitments underlying constitutional democracy. At the heart of this model are four distinct concerns, each captured by a distinct principle. These principles are the formal principle of international legality, the jurisdictional principle of subsidiarity, the procedural principle of adequate participation and accountability as well as the substantive principle of achieving outcomes that are not violative of fundamental rights and are reasonable. Such a framework provides a middle ground between national and international constitutionalists. Whereas the former sometimes suggest that any law not sufficiently connected to domestic legal actors is suspect legitimacy-wise, the latter tend to underplay what is lost democracy-wise as decision-making is ratcheted up from the national to the international level.",
      "cited_by_count": 390,
      "type": "article",
      "source": {
        "name": "European Journal of International Law",
        "type": "journal",
        "issn": [
          "0938-5428",
          "1464-3596"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "bronze",
        "oa_url": "https://academic.oup.com/ejil/article-pdf/15/5/907/1425297/chh503.pdf"
      },
      "topics": [
        "International Law and Human Rights",
        "International Arbitration and Investment Law",
        "Judicial and Constitutional Studies"
      ],
      "referenced_works_count": 3,
      "url": "https://openalex.org/W1997244086"
    },
    {
      "openalex_id": "W2133826741",
      "doi": "10.1257/jep.11.2.3",
      "title": "Distinguished Lecture on Economics in Government: What Central Bankers Could Learn from Academics—and Vice Versa",
      "authors": [
        {
          "name": "Alan S. Blinder",
          "openalex_id": "A5029944461",
          "institutions": [
            "Princeton University"
          ]
        }
      ],
      "publication_year": 1997,
      "publication_date": "1997-05-01",
      "abstract": "Academic writing about monetary policy has been useful to practical central bankers, but more of (certain aspects of) the economists' way of thinking could profitably be imported. On the other hand, academics could improve their analysis, and make it more useful to policymakers, if they would pay more attention to certain ‘real-world’ aspects of monetary policy. The author draws on his experience at the Federal Reserve Board to point out a number of specific lessons for each side.",
      "cited_by_count": 383,
      "type": "article",
      "source": {
        "name": "The Journal of Economic Perspectives",
        "type": "journal",
        "issn": [
          "0895-3309",
          "1944-7965"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "bronze",
        "oa_url": "https://www.aeaweb.org/articles/pdf/doi/10.1257/jep.11.2.3"
      },
      "topics": [
        "Fiscal Policies and Political Economy",
        "Monetary Policy and Economic Impact",
        "Economic Theory and Policy"
      ],
      "referenced_works_count": 25,
      "url": "https://openalex.org/W2133826741"
    },
    {
      "openalex_id": "W2127129904",
      "doi": "10.1177/0022022107300278",
      "title": "Value Orientations and Environmental Beliefs in Five Countries",
      "authors": [
        {
          "name": "Judith I. M. de Groot",
          "openalex_id": "A5015990513",
          "institutions": [
            "University of Groningen"
          ]
        },
        {
          "name": "Linda Steg",
          "openalex_id": "A5037506201",
          "orcid": "https://orcid.org/0000-0002-8375-9607",
          "institutions": [
            "University of Groningen"
          ]
        }
      ],
      "publication_year": 2007,
      "publication_date": "2007-04-30",
      "abstract": "Various scholars argue that egoistic, altruistic, and biospheric value orientations are important for understanding environmental beliefs and behavior. However, little empirical evidence has been provided for the distinction between altruistic and biospheric values. This study examines whether this distinction is valid across different countries (i.e., Austria, Czech Republic, Italy, the Netherlands, and Sweden) by using a new value instrument. Relationships between these value orientations and behavior-specific beliefs (i.e., awareness of environmental consequences and personal norms) are investigated to further examine the validity of the value instrument. Results provide support for the generalization of the three-way distinction. Furthermore, value orientations were related to behavior-specific beliefs in all countries. The authors conclude that the distinction between the three value orientations is valid and useful for examining environmentally relevant behavior.",
      "cited_by_count": 585,
      "type": "article",
      "source": {
        "name": "Journal of Cross-Cultural Psychology",
        "type": "journal",
        "issn": [
          "0022-0221",
          "1552-5422"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "green",
        "oa_url": "https://pure.rug.nl/ws/files/168782061/0022022107300278.pdf"
      },
      "topics": [
        "Environmental Education and Sustainability",
        "Behavioral Health and Interventions",
        "Climate Change Communication and Perception"
      ],
      "referenced_works_count": 58,
      "url": "https://openalex.org/W2127129904"
    },
    {
      "openalex_id": "W2119243990",
      "doi": "10.1111/j.1467-8624.2011.01666.x",
      "title": "Conformity to Peer Pressure in Preschool Children",
      "authors": [
        {
          "name": "Daniel B. M. Haun",
          "openalex_id": "A5002740896",
          "orcid": "https://orcid.org/0000-0002-3262-645X",
          "institutions": [
            "Max Planck Institute for Evolutionary Anthropology",
            "University of Portsmouth",
            "Max Planck Institute for Psycholinguistics"
          ]
        },
        {
          "name": "Michael Tomasello",
          "openalex_id": "A5071512605",
          "orcid": "https://orcid.org/0000-0002-1649-088X",
          "institutions": [
            "Max Planck Institute for Evolutionary Anthropology"
          ]
        }
      ],
      "publication_year": 2011,
      "publication_date": "2011-10-24",
      "abstract": "Both adults and adolescents often conform their behavior and opinions to peer groups, even when they themselves know better. The current study investigated this phenomenon in 24 groups of 4 children between 4;2 and 4;9 years of age. Children often made their judgments conform to those of 3 peers, who had made obviously erroneous but unanimous public judgments right before them. A follow‐up study with 18 groups of 4 children between 4;0 and 4;6 years of age revealed that children did not change their “real” judgment of the situation, but only their public expression of it. Preschool children are subject to peer pressure, indicating sensitivity to peers as a primary social reference group already during the preschool years.",
      "cited_by_count": 302,
      "type": "article",
      "source": {
        "name": "Child Development",
        "type": "journal",
        "issn": [
          "0009-3920",
          "1467-8624"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "bronze",
        "oa_url": "https://onlinelibrary.wiley.com/doi/pdfdirect/10.1111/j.1467-8624.2011.01666.x"
      },
      "topics": [
        "Child and Animal Learning Development",
        "Language, Discourse, Communication Strategies",
        "Social Representations and Identity"
      ],
      "referenced_works_count": 48,
      "url": "https://openalex.org/W2119243990"
    },
    {
      "openalex_id": "W592297356",
      "doi": "10.5860/choice.50-5793",
      "title": "Superfluous southerners: cultural conservatism and the South, 1920-1990",
      "authors": [
        {
          "name": "John J. Langdale",
          "openalex_id": "A5105812490"
        }
      ],
      "publication_year": 2013,
      "publication_date": "2013-05-22",
      "abstract": "In Superfluous Southerners, J. Langdale III tells the story of traditionalist conservatism and its boundaries in twentieth-century America. Because this time period encompasses both the rise of the modern conservative movement and the demise of southern regional distinctiveness, it affords an ideal setting both for observing the potentiality of American conservatism and for understanding the fate of the traditionalist man of letters. Langdale uses the intellectual and literary histories of John Crowe Ransom, Donald Davidson, and Allen Tate the three principal contributors to the Agrarian manifesto I ll Take My Stand and of their three most remarkable intellectual descendants Cleanth Brooks, Richard Weaver, and Melvin Bradford to explore these issues. Langdale begins his study with some observations on the nature of American exceptionalism and the intrinsic barriers which it presents to the traditionalist conservative imagination. While works like Louis Menand s The Metaphysical Club have traced the origins of modern pragmatic liberalism during the late nineteenth century, the nature of conservative thought in postbellum America remains less completely understood. Accordingly, Langdale considers the origins of the New Humanism movement at the turn of the twentieth century, then turning to the manner in which midwesterners Irving Babbitt and Paul Elmer Moore stirred the imagination of the southern Agrarians during the 1920s. After the publication of I ll Take My Stand in 1930, Agrarianism splintered into three distinct modes of traditionalist conservatism: John Crowe Ransom sought refuge in literary criticism, Donald Davidson in sectionalism, and Allen Tate in an image of the religious-wayfarer as a custodian of language. Langdale traces the expansion of these modes of traditionalism by succeeding generations of southerners. Following World War II, Cleanth Brooks further refined the tradition of literary criticism, while Richard Weaver elaborated the tradition of sectionalism. However, both Brooks and Weaver distinctively furthered Tate s notion that the integrity of language remained the fundamental concern of traditionalist conservatism. Langdale concludes his study with a consideration of neoconservative opposition to M.E. Bradford s proposed 1980 nomination as head of the National Endowment for the Humanities and its significance for the southern man of letters in what was becoming postmodern and postsouthern America. Though the post World War II ascendance of neoconservatism drastically altered American intellectual history, the descendants of traditionalism remained largely superfluous to this purportedly conservative revival which had far more in common with pragmatic liberalism than with normative conservatism. ",
      "cited_by_count": 2,
      "type": "article",
      "source": {
        "name": "Choice Reviews Online",
        "type": "journal",
        "issn": [
          "0009-4978",
          "1523-8253",
          "1943-5975"
        ]
      },
      "open_access": {
        "is_oa": false,
        "oa_status": "closed",
        "oa_url": null
      },
      "topics": [
        "Research, Science, and Academia",
        "American Constitutional Law and Politics",
        "American Political and Social Dynamics"
      ],
      "referenced_works_count": 0,
      "url": "https://openalex.org/W592297356"
    }
  ],
  "count": 30,
  "errors": []
}
