[search_philpapers.py] Connecting to Brave API for philpapers_via_brave search...
[search_philpapers.py] Searching philpapers.org: 'tradition normative value', limit=30
[search_philpapers.py] Rate limited, backing off (attempt 1/5)...
[search_philpapers.py] Retrying after 1.2s backoff...
[search_philpapers.py] Retrieved 15 entries...
[search_philpapers.py] Search complete: 15 entries found
{
  "status": "success",
  "source": "philpapers_via_brave",
  "query": "tradition normative value",
  "results": [
    {
      "title": "Samuel Scheffler, Equality and tradition: questions of value in moral and political theory",
      "url": "https://philpapers.org/rec/SCHEAT-8",
      "philpapers_id": "SCHEAT",
      "snippet": "-- Cosmopolitanism, justice, and institutions -- What is egalitarianism? -- Choice, circumstance, and the value of equality -- Is terrorism morally distinctive? -- Immigration and the significance of culture -- The normativity of tradition -- The good of toleration.",
      "page_age": null
    },
    {
      "title": "Florian Steinberger, Three Ways in Which Logic Might Be Normative",
      "url": "https://philpapers.org/rec/STETWI-7",
      "philpapers_id": "STETWI",
      "snippet": "According to tradition, logic is normative for reasoning. Gilbert Harman challenged the view that there is any straightforward connection between logical consequence and norms of reasoning. Authors including John MacFarlane and ...",
      "page_age": null
    },
    {
      "title": "Joseph Endola, Intuitive Hedonism",
      "url": "https://philpapers.org/rec/ENDIH-2",
      "philpapers_id": "ENDIH",
      "snippet": "The hoary philosophical tradition of hedonism – the view that pleasure is the basic ethical or normative value – suggests that it is at least reasonably and roughly intuitive. But philosophers ...",
      "page_age": null
    },
    {
      "title": "Florian Steinberger, Consequence and Normative Guidance",
      "url": "https://philpapers.org/rec/STECAN-11",
      "philpapers_id": "STECAN",
      "snippet": "Logic, the tradition has it, is normative for reasoning. But is that really so? And if so, in what sense is logic normative for reasoning? As Gilbert Harman has reminded us, devising a logic and devising a theory of reasoning are two separate enterprises. Hence, logic&#x27;s normative authority cannot reside in the fact that principles of logic just are norms of reasoning.",
      "page_age": null
    },
    {
      "title": "Samuel Scheffler, Equality and Tradition: Selected Essays",
      "url": "https://philpapers.org/rec/SCHEAT-16",
      "philpapers_id": "SCHEAT",
      "snippet": "Equality and Tradition: Questions of Value in Moral and Political Theory, by Samuel Scheffler.B.",
      "page_age": null
    },
    {
      "title": "Geoffrey S. Holtzman, Normative Moral Neuroscience: The Third Tradition of Neuroethics",
      "url": "https://philpapers.org/rec/HOLNMN",
      "philpapers_id": "HOLNMN",
      "snippet": "Neuroethics is typically conceived of as consisting of two traditions: the ethics of neuroscience and the neuroscience of moral judgment. However, recent work has sought to draw philosophical and ethical implications from the neuroscience of moral judgment. Such work, which concernsnormative moral neuroscience(NMN), is sufficiently distinct and complex to deserve recognition as a third tradition of neuroethics.",
      "page_age": null
    },
    {
      "title": "Timothy Perrine, Value Approaches to Virtue and Vice: Intrinsic, Instrumental, or Hybrid?",
      "url": "https://philpapers.org/rec/PERVAT-5",
      "philpapers_id": "PERVAT",
      "snippet": "According to one tradition, the virtues and vices should be understood in terms of their relation to value. But inside this tradition, there are three distinct proposals: virtues are intrinsically valuable; ...",
      "page_age": null
    },
    {
      "title": "Alberto R. Coll, Normative prudence as a tradition of statecraft",
      "url": "https://philpapers.org/rec/COLNPA",
      "philpapers_id": "COLNPA",
      "snippet": "Coll clearly advocates the Aristotelian notion that &quot;moral principles are ultimately realized only in specific acts which human beings choose to carry out.&quot; He cites Washington, Lincoln, and Churchill as examples ...",
      "page_age": null
    },
    {
      "title": "David O. Brink, Normative Perfectionism and the Kantian Tradition",
      "url": "https://philpapers.org/rec/BRINPA-4",
      "philpapers_id": "BRINPA",
      "snippet": "Finally, because the normative perfectionist, like the Kantian, grounds its ideals and requirements in a conception of persons as rational agents, it provides a promising account of the rational authority of perfectionist demands. This comparison of normative perfectionist and Kantian essentials gives us reason to take the normative perfectionist tradition seriously.",
      "page_age": null
    },
    {
      "title": "William Matthew Diem, On Value and Obligation in Practical Reason: Toward a Resolution of the Is–Ought Problem in the Thomistic Moral Tradition",
      "url": "https://philpapers.org/rec/DIEOVA",
      "philpapers_id": "DIEOVA",
      "snippet": "Within the Thomistic moral tradition, the is-ought gap is regularly treated as identical to the fact-value gap, and these two dichotomies are also regularly treated as being identical to Aristotle and ...",
      "page_age": null
    },
    {
      "title": "Paula Casal, Whaling, Bullfighting, and the Conditional Value of Tradition",
      "url": "https://philpapers.org/rec/CASWBA",
      "philpapers_id": "CASWBA",
      "snippet": "Some of the arguments discussed here for maintaining these traditions appeal to their positive aspects, such as their contribution to social or environmental harmony; other arguments focus on the impermissibility of one group criticizing another group’s practices when its own are vulnerable to comparable criticism. Reflecting on the first kind of argument, the paper responds, building on the work of G. A. Cohen and T. M. Scanlon, that the value of tradition, if any, must be conditional.",
      "page_age": null
    },
    {
      "title": "Mikel Burley, Prioritizing practice in the study of religion: normative and descriptive orientations",
      "url": "https://philpapers.org/rec/BURPPI-5",
      "philpapers_id": "BURPPI",
      "snippet": "Calls to prioritize practice in the study of religion typically claim that attention to lived practices rather than merely to ‘belief’ is needed if a given religious tradition or instance of ...",
      "page_age": null
    },
    {
      "title": "Matthew Lamb, Nature is Normative for Culture: Book Symposium on Culture and the Thomist Tradition: After Vatican II by Tracey Rowland",
      "url": "https://philpapers.org/rec/LAMNIN",
      "philpapers_id": "LAMNIN",
      "snippet": "A Critique Of Culture Showing How Faith And Reason Interact: Book Symposium on Culture and the Thomist Tradition: After Vatican II by Tracey Rowland.David Burrell - 2005 - Nova et Vetera 3.",
      "page_age": null
    },
    {
      "title": "Paul Katsafanas, The Problem of Normative Authority in Kant, Hegel, and Nietzsche",
      "url": "https://philpapers.org/rec/KATTPO-7",
      "philpapers_id": "KATTPO",
      "snippet": "In D. Owen &amp; A. Ridley, Nietzsche, Morality, and the Ethical Tradition (2017) ... Kant and Hegel share a common foundational idea: they believe that the authority of normative claims can be justified only by showing that these norms are self-imposed or autonomous.",
      "page_age": null
    },
    {
      "title": "Marion Eggert, Gregor Paul & Heiner Roetz, Innovation with and against the Tradition. Examples from Chinese, Japanese and Korean Confucianism",
      "url": "https://philpapers.org/rec/EGGIWA",
      "philpapers_id": "EGGIWA",
      "snippet": "Up until the present day, Confucianism has been a major factor in the normative discourses of East Asia. At first glance, it has sided with the preservation of the old and ...",
      "page_age": null
    }
  ],
  "count": 15,
  "errors": []
}
