[search_philpapers.py] Connecting to Brave API for philpapers_via_brave search...
[search_philpapers.py] Searching philpapers.org: 'intrinsic instrumental value tradition', limit=30
[search_philpapers.py] Retrieved 15 entries...
[search_philpapers.py] Search complete: 15 entries found
{
  "status": "success",
  "source": "philpapers_via_brave",
  "query": "intrinsic instrumental value tradition",
  "results": [
    {
      "title": "Dale Dorsey, Can instrumental value be intrinsic?",
      "url": "https://philpapers.org/rec/DORCIV",
      "philpapers_id": "DORCIV",
      "snippet": "It follows, then, that a popular account of the nature of final value – or value as an end – is false: the Moorean identification of final value with intrinsic value cannot properly distinguish between value as an end and value as a means. ... Setup an account with your affiliations in order to access resources via your University&#x27;s proxy server · Sign in / register and customize your OpenURL resolver ... The Goodness of Means: Instrumental and Relational Values, Causation, and Environmental Policies.Patrik Baard - 2019 - Journal of Agricultural and Environmental Ethics 32 (1):183-199.",
      "page_age": null
    },
    {
      "title": "Timothy Perrine, Value Approaches to Virtue and Vice: Intrinsic, Instrumental, or Hybrid?",
      "url": "https://philpapers.org/rec/PERVAT-5",
      "philpapers_id": "PERVAT",
      "snippet": "But inside this tradition, there are three distinct proposals: virtues are intrinsically valuable; virtues are instrumentally valuable; or a hybrid proposal on which virtues are either intrinsically or instrumentally valuable.",
      "page_age": null
    },
    {
      "title": "Shelly Kagan, Rethinking intrinsic value",
      "url": "https://philpapers.org/rec/KAGRIV",
      "philpapers_id": "KAGRIV",
      "snippet": "According to the dominant philosophical tradition, intrinsic value must depend solely upon intrinsic properties. By appealing to various examples, however, I argue that we should at least leave open the possibility that in some cases intrinsic ...",
      "page_age": null
    },
    {
      "title": "Earl Conee, Instrumental value without intrinsic value?",
      "url": "https://philpapers.org/rec/CONIVW",
      "philpapers_id": "CONIVW",
      "snippet": "Instrumental Value in Nature as a Basis for the Intrinsic Value of Nature as a Whole.Robert Elliot - 2005 - Environmental Ethics 27 (1):43-56.",
      "page_age": null
    },
    {
      "title": "Anna Https://Orcidorg Deplazes-Zemp, Beyond Intrinsic and Instrumental: Third-Category Value in Environmental Ethics and Environmental Policy",
      "url": "https://philpapers.org/rec/DEPBIA-2",
      "philpapers_id": "DEPBIA",
      "snippet": "Traditionally, arguments about the environment have invoked instrumental value to highlight the necessity or utility of a healthy environment for people and intrinsic value to emphasize the importance of ...",
      "page_age": null
    },
    {
      "title": "Elizabeth Anderson, Democracy: Instrumental vs. Non‐Instrumental Value",
      "url": "https://philpapers.org/rec/ANDDIV",
      "philpapers_id": "ANDDIV",
      "snippet": "democracy as a way of life democracy ‐ instrumental vs. non‐instrumental value what good is leading a democratic way of life – living in a democratic culture, based on universal and equal membership of permanent residents of a state intrinsic and instrumental values of democracy democratic activities expressing sympathy for fellow citizens, exercising collective autonomy manifesting form of collective learning",
      "page_age": null
    },
    {
      "title": "Robert Elliot, Instrumental value in nature as a basis for the intrinsic value of nature as a whole",
      "url": "https://philpapers.org/rec/ELLIVI",
      "philpapers_id": "ELLIVI",
      "snippet": "One reason they do is because they are struck by the extent to which nature and natural processes give rise to so much that has intrinsic value. The underlying thought is that the value -producing work that nature performs, its instrumentality, imbues nature with a value that is more than merely instrumental.",
      "page_age": null
    },
    {
      "title": "Peter P. Kirschenmann, “Intrinsically” or just “Instrumentally” Valuable? On Structural Types of Values of Scientific Knowledge",
      "url": "https://philpapers.org/rec/KIRIOJ",
      "philpapers_id": "KIRIOJ",
      "snippet": "After some remarks on relevant broader philosophicaldebates about scientific knowledge, I pave a path throughthe (terminological) thicket of structural types of values. Our initial simple opposition is shown to conflate thedistinctions intrinsic/extrinsic and instrumental (or justuseful)/final.",
      "page_age": null
    },
    {
      "title": "Toni Rønnow-Rasmussen, Intrinsic and Extrinsic Value",
      "url": "https://philpapers.org/rec/RNNIAE",
      "philpapers_id": "RNNIAE",
      "snippet": "In Iwao Hirose &amp; Jonas Olson, The Oxford Handbook of Value Theory. New York NY: Oxford University Press USA (2015) ... Section 2.1 identifies three notions of intrinsic value: the finality sense understands it as value for its own sake, the supervenience sense identifies it with value that depends exclusively on the bearer’s internal properties, and the nonderivative sense describes intrinsic value as value that provides justification for other values and is not justified by any other value.",
      "page_age": null
    },
    {
      "title": "Tully Ian, Is Pleasure Merely An Instrumental Good? Reply to Pianalto",
      "url": "https://philpapers.org/rec/TULIPM",
      "philpapers_id": "TULIPM",
      "snippet": "The view that pleasure&#x27;s value might be merely instrumental has not received much support from philosophers. Indeed, few things seem more clearly to be of intrinsic value than pleasure. However, Matthew Pianalto has provided a sophisticated defense of the purely instrumental view.",
      "page_age": null
    },
    {
      "title": "John Sodiq Sanni, Intrinsic or Instrumental Value? African Philosophical Conceptions of Dignity",
      "url": "https://philpapers.org/rec/SANIOI-3",
      "philpapers_id": "SANIOI",
      "snippet": "This chapter seeks to explore and engage with the question of the nature of dignity in African society, drawing on African philosophers’ conceptions of human dignity in personhood within moderate and strict communitarian positions. Is dignity an intrinsic or an instrumental value?",
      "page_age": null
    },
    {
      "title": "Michael J. Zimmerman, The Nature of Intrinsic Value",
      "url": "https://philpapers.org/rec/ZIMTNO-2",
      "philpapers_id": "ZIMTNO",
      "snippet": "Instrumental value in nature as a basis for the intrinsic value of nature as a whole.Robert Elliot - 2005 - Environmental Ethics 27 (1):43-56.",
      "page_age": null
    },
    {
      "title": "Toni Rønnow-Rasmussen, Instrumental values – strong and weak",
      "url": "https://philpapers.org/rec/RNNIV",
      "philpapers_id": "RNNIV",
      "snippet": "While some writers seem to think it means that the object bears a value, and that instrumental value accordingly is a kind of value, other writers seem to think that the object is not a value bearer but is only what is conducive to something ...",
      "page_age": null
    },
    {
      "title": "Erik W. Schmidt, How to Value the Liberal Arts for Their Own Sake without Intrinsic Values",
      "url": "https://philpapers.org/rec/SCHHTV",
      "philpapers_id": "SCHHTV",
      "snippet": "I argue that there is an important problem with framing the value of a liberal arts education through a contrast between intrinsic and instrumental value. The paper breaks down into three sections. First, I argue that the traditional divide between intrinsic and instrumental value conflates two pairs of related concepts and that distinguishing those concepts frees us from an important impasse found in contemporary discussions about the liberal arts.",
      "page_age": null
    },
    {
      "title": "Haig Khatchadourian, “Intrinsic” and “instrumental” good: An untenable dichotomy",
      "url": "https://philpapers.org/rec/KHAIAI",
      "philpapers_id": "KHAIAI",
      "snippet": "The Utility of Intrinsic Value.Joram Graf Haber - 2014 - In G. John M. Abbarno, Inherent and Instrumental Values: Excursions in Value Inquiry.",
      "page_age": null
    }
  ],
  "count": 15,
  "errors": []
}
