[s2_search.py] Searching Semantic Scholar: 'authority tradition legitimacy' (year=2000-2025) (field=Philosophy), limit=30
[s2_search.py] Retrieved 30/30 papers...
[s2_search.py] Cached results (cache key: s2_435ee5893d8ffdb9)
{
  "status": "success",
  "source": "semantic_scholar",
  "query": "authority tradition legitimacy",
  "results": [
    {
      "paperId": "e62ba51517c368831f2ab6134072d010f2fbeb47",
      "title": "Just War: Authority, Tradition, and Practice",
      "authors": [
        {
          "name": "A. Lang",
          "authorId": "97061938"
        },
        {
          "name": "Cian O’Driscoll",
          "authorId": "1410980047"
        },
        {
          "name": "John Williams",
          "authorId": "31690923"
        }
      ],
      "year": 2013,
      "abstract": null,
      "citationCount": 12,
      "doi": "10.5860/choice.51-4108",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/e62ba51517c368831f2ab6134072d010f2fbeb47",
      "venue": "",
      "journal": {
        "name": "",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "e9678b56a1d79e484034c623d36bfce19da2eb3b",
      "title": "Authority, Tradition, and the Creation of Meaning in Medieval Kabbalah: Isaac of Acre's Illumination of the Eyes",
      "authors": [
        {
          "name": "Eitan P. Fishbane",
          "authorId": "117641683"
        }
      ],
      "year": 2004,
      "abstract": null,
      "citationCount": 4,
      "doi": "10.1093/JAAREL/LFH004",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/e9678b56a1d79e484034c623d36bfce19da2eb3b",
      "venue": "",
      "journal": {
        "name": "Journal of the American Academy of Religion",
        "pages": "59-95",
        "volume": "72"
      },
      "publicationTypes": null
    },
    {
      "paperId": "93748f3a633eba99594b2ae9adb90ee565950c77",
      "title": "ALEXANDRE KOJÈVE’S NOTION OF AUTHORITY AND THE CONSTRUCTION OF POLITICAL LEGITIMACY",
      "authors": [
        {
          "name": "Alexandru-Vasile Sava",
          "authorId": "122460399"
        }
      ],
      "year": 2016,
      "abstract": null,
      "citationCount": 0,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/93748f3a633eba99594b2ae9adb90ee565950c77",
      "venue": "",
      "journal": {
        "name": "",
        "pages": "65-84",
        "volume": "10"
      },
      "publicationTypes": null
    },
    {
      "paperId": "2ece9aea05942bc6295721f60b59ef43331f3705",
      "title": "Legitimacy and the Moral Imagination of Power: A Historical–Philosophical Inquiry from Weber to Contemporary Humanistic Thought",
      "authors": [
        {
          "name": "Bożena Iwanowska",
          "authorId": "2259000854"
        }
      ],
      "year": 2025,
      "abstract": "This article offers a historical–philosophical inquiry into political legitimacy as a phenomenon that exceeds formal legality and institutional performance, locating legitimacy within the moral imagination through which societies interpret and justify power. Re-reading Weber’s typology of domination as a humanistic problem of meaning, trust, and binding recognition, the study traces how legitimacy shifts across modern thought from inherited tradition and charismatic belief to rational-legal justification and democratic consent. The analysis integrates classical and contemporary perspectives by treating legitimacy as multidimensional: it rests on lawful acquisition and exercise of power, normative justification of governing rules, and the consent of the governed, while remaining continuously vulnerable to symbolic contestation and ethical evaluation. Special attention is given to the conceptual distinction between legitimacy as a state of recognised authority and legitimisation as an ongoing process of justification, clarification, and public confirmation. The article argues that modern legitimacy is sustained not only by procedures and outcomes but also by the capacity of power to appear morally intelligible—credible in conscience, resonant with shared values, and responsive to demands for dignity and fairness. By framing legitimacy as a moral language and interpretive practice, the study provides an integrative lens for analysing contemporary challenges, including the reconfiguration of authority under digital governance, and shifting regimes of trust.",
      "citationCount": 0,
      "doi": "10.5709/ah-03.03.2025-05",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/2ece9aea05942bc6295721f60b59ef43331f3705",
      "venue": "Acta Humanitatis",
      "journal": {
        "name": "Acta Humanitatis"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "1c8ec42368da9e14a24c7f1f2e7ae06eb85fc298",
      "title": "The “Common Good” of the Classical Legal Tradition: Current Discourse and the Fate of the Concept in Worldviews (Antiquity and the Middle Ages)",
      "authors": [
        {
          "name": "Elena Timoshina",
          "authorId": "2268233972"
        }
      ],
      "year": 2025,
      "abstract": "The article deals with the history of the concept of the common good in the clas­sical legal tradition, for the representatives of which law is as inseparably con­nected with the common good as with justice. As a philosophical and legal con­cept, the common good was a condition for the validity of positive law and the basis for the legitimacy of public authority; as a concept of positive law, it was part of the European Continental tradition of jus commune (common law) of the XII–XVIII centuries: it served as a marker of the public-law nature of so­cial institutions and relations, and was proclaimed as the goal of all human laws. However, in modern philosophy of law and constitutional theory, the concept of the common good has been discredited, and rare attempts to rehabilitate it face aggressive criticism. The aim of the article is to trace the complex fate of the concept of the common good, to understand the reasons for the transfor­mation of its meaning and to evaluate modern projects of its rehabilitation and the reasons for their failure. The aim of the study is to trace the complex fate of the concept of the common good, to understand the reasons for the transfor­mation of its meaning and to evaluate modern projects of its rehabilitation and the reasons for their failure. In this article, the author records the current state of discussions about the common good, shows its changing meaning in the an­cient and medieval worldviews and in the relationship with other concepts of these worldviews. The participation of the citizen in defining and preserving the common good provided by the political institutions of the ancient world ex­cluded individualism as the basis for ethical action. It is shown how in the tran­scendental perspective of the Middle Ages the notion of the common good was inconsistently combined with the Christian idea of personal salvation. As a con­sequence of the Aristotelian turn, the separation and isolation of the common good of the two graces (terrena and Dei), which would later make possible the notion of a secular modern state, is noted.",
      "citationCount": 0,
      "doi": "10.21146/0042-8744-2025-4-5-16",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/1c8ec42368da9e14a24c7f1f2e7ae06eb85fc298",
      "venue": "Voprosy filosofii",
      "journal": {
        "name": "Voprosy filosofii"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "65e9d7a53eacad6357fa3d5135e5d5487651476e",
      "title": "Justice, legitimacy and diversity : political authority between realism and moralism",
      "authors": [
        {
          "name": "Emanuela Ceva",
          "authorId": "14549601"
        },
        {
          "name": "Enzo Rossi",
          "authorId": "144213214"
        }
      ],
      "year": 2013,
      "abstract": null,
      "citationCount": 8,
      "doi": "10.4324/9780203721155",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/65e9d7a53eacad6357fa3d5135e5d5487651476e",
      "venue": "",
      "journal": {
        "name": "",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "698f095e7b2afc30c394969e13893a15a2e8d328",
      "title": "The Jewish Political Tradition, Vol. One: Authority . Edited by Michael Walzer, Menachem Lorberbaum, and Noam J. Zohar. Co-edited by Yair Lorberbaum. New Haven and London: Yale University Press2000. Pp. lvii, 578. (Price not available.) ISBN: 0-300-07822-6.",
      "authors": [
        {
          "name": "D. Kraemer",
          "authorId": "46197351"
        }
      ],
      "year": 2002,
      "abstract": null,
      "citationCount": 1,
      "doi": "10.2307/1051409",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/698f095e7b2afc30c394969e13893a15a2e8d328",
      "venue": "The Journal of Law and Religion",
      "journal": {
        "name": "Journal of Law and Religion",
        "pages": "159 - 162",
        "volume": "17"
      },
      "publicationTypes": [
        "Review"
      ]
    },
    {
      "paperId": "63849d3ac7c25f582a25f99a15d4c5ba3005929f",
      "title": "Republican Auctoritas: Harrington’s dual theory of political legitimacy",
      "authors": [
        {
          "name": "C. Trojan",
          "authorId": "116122185"
        }
      ],
      "year": 2019,
      "abstract": "Neo-republicans position James Harrington (1611–1677) as a seminal figure in a tradition that asks what set of institutions grant the individual freedom from domination. This article argues that the signal emphasis on freedom diverts us from the broader question of legitimacy motivating Harrington’s republicanism. Harrington contends that the liberty property confers is a necessary but insufficient condition for de jure government. The popular liberty that a broad distribution of wealth secures must be supplemented by a Roman concept of authority in order for the regime to become legitimate. Republican legitimacy requires the marriage of popular power and aristocratic virtue; it demands both the wide distribution of property and the integration of authority as auctoritas into the political constitution. The elucidation of Harrington’s dual theory of legitimacy makes it possible to reassess the distance separating a republicanism that follows Harrington from a liberalism that follows Hobbes.",
      "citationCount": 1,
      "doi": "10.1177/1474885118806677",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/63849d3ac7c25f582a25f99a15d4c5ba3005929f",
      "venue": "European Journal of Political Theory",
      "journal": {
        "name": "European Journal of Political Theory",
        "pages": "398 - 420",
        "volume": "20"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "ea88468102bbf5b59c8de785bcc44b4ba67439fc",
      "title": "The conflict myth and the biblical tradition",
      "authors": [
        {
          "name": "Debra Scoggins Ballentine",
          "authorId": "90712205"
        }
      ],
      "year": 2015,
      "abstract": null,
      "citationCount": 31,
      "doi": "10.1093/ACPROF:OSO/9780199370252.001.0001",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/ea88468102bbf5b59c8de785bcc44b4ba67439fc",
      "venue": "",
      "journal": {
        "name": "",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "7c176b1e4896b5ae21fdf3144200e4dd8f7b61f3",
      "title": "Philosophie et politique : Qu'est-ce que l'autorite? = Kojeve, philosophy and politics : what is authority?",
      "authors": [
        {
          "name": "Massimo Palma",
          "authorId": "2060189011"
        },
        {
          "name": "Hager Weslati",
          "authorId": "104271368"
        }
      ],
      "year": 2019,
      "abstract": null,
      "citationCount": 0,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/7c176b1e4896b5ae21fdf3144200e4dd8f7b61f3",
      "venue": "",
      "journal": {
        "name": "",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "6bcb2b5ef28c78d07363c7b8cf25fd3fc9b85e1c",
      "title": "Social Justice and the Legitimacy of Slavery: The Role of Philosophical Asceticism from Ancient Judaism to Late Antiquity by Ilaria L. E. Ramelli (review)",
      "authors": [
        {
          "name": "Anders Martinsen",
          "authorId": "2079094631"
        }
      ],
      "year": 2018,
      "abstract": null,
      "citationCount": 0,
      "doi": "10.1353/EARL.2018.0048",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/6bcb2b5ef28c78d07363c7b8cf25fd3fc9b85e1c",
      "venue": "",
      "journal": {
        "name": "Journal of Early Christian Studies",
        "pages": "506 - 508",
        "volume": "26"
      },
      "publicationTypes": [
        "Review"
      ]
    },
    {
      "paperId": "8113761180e7c5b7eea86edee4eaeea5c364064c",
      "title": "\"An irous man\": Anger and Authority in the Summoner's Tale",
      "authors": [
        {
          "name": "Marc Cels",
          "authorId": "113466339"
        }
      ],
      "year": 2018,
      "abstract": null,
      "citationCount": 0,
      "doi": "10.5325/chaucerrev.53.3.0308",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/8113761180e7c5b7eea86edee4eaeea5c364064c",
      "venue": "",
      "journal": {
        "name": "The Chaucer Review",
        "pages": "308 - 335",
        "volume": "53"
      },
      "publicationTypes": null
    },
    {
      "paperId": "5ab8fca5515879f87794e055a6f599f4d1360793",
      "title": "Reevaluating Qur'anic Hermeneutics: A Comparative Analysis Between Classical Tafsir and Modern Hermeneutical Approaches",
      "authors": [
        {
          "name": "Moh. Nor Ichwan",
          "authorId": "2334488457"
        },
        {
          "name": "Auwal Salisu",
          "authorId": "1580661204"
        }
      ],
      "year": 2024,
      "abstract": "This study discusses the methodological differences between classical interpretation and modern hermeneutic approaches in interpreting the Qur'an. Classical interpretation, represented by works such as Tafsir al-Tabari and Tafsir Ibn Kathir, tends to emphasize the authority of tradition and the literal understanding of the Qur'anic text. In contrast, modern hermeneutics, developed by scholars such as Fazlur Rahman and Nasr Hamid Abu Zayd, offers a more contextual and critical approach to texts, considering historical and social factors. This study aims to explore the strengths and weaknesses of the two approaches and assess the potential for combining the two elements. Using comparative methods and thematic analysis, this study finds that classical interpretation excels in maintaining the text's integrity but is less flexible in responding to contemporary challenges. On the other hand, modern hermeneutics is more relevant to today's socio-political context, although it faces criticism regarding the legitimacy and authority of the text. This study recommends further study of how ijtihad can bridge the gap between tradition and modernity, creating a more inclusive approach to interpreting the Qur'an.",
      "citationCount": 3,
      "doi": "10.24042/kalam.v18i2.24213",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/5ab8fca5515879f87794e055a6f599f4d1360793",
      "venue": "Kalam",
      "journal": {
        "name": "KALAM"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "fe3ad195575c2c5c52c2159279de562fde67f13b",
      "title": "Ayesha S. Chaudhry, Domestic Violence and the Islamic Tradition (Oxford: Oxford University Press, 2013), pp. 288. £34.99.",
      "authors": [
        {
          "name": "Mona Siddiqui",
          "authorId": "1618894078"
        }
      ],
      "year": 2016,
      "abstract": null,
      "citationCount": 0,
      "doi": "10.1017/S0036930614000799",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/fe3ad195575c2c5c52c2159279de562fde67f13b",
      "venue": "Scottish Journal of Theology",
      "journal": {
        "name": "Scottish Journal of Theology",
        "pages": "350 - 351",
        "volume": "69"
      },
      "publicationTypes": null
    },
    {
      "paperId": "edb6b3bbd1b4ea657b793d444e93ac52d8d41359",
      "title": "Causal and Epistemic Relevance in Appeals to Authority",
      "authors": [
        {
          "name": "Sebastiano Lommi",
          "authorId": "115075632"
        }
      ],
      "year": 2015,
      "abstract": null,
      "citationCount": 1,
      "doi": "10.13130/2037-4445/4673",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/edb6b3bbd1b4ea657b793d444e93ac52d8d41359",
      "venue": "",
      "journal": {
        "name": "",
        "pages": "28-41",
        "volume": "6"
      },
      "publicationTypes": null
    },
    {
      "paperId": "a2f7c062ba69389e86ca57e7ea57a3fc02c5dd25",
      "title": "Reclaiming the Natural State: Community Consciousness Beyond the Social Contract",
      "authors": [
        {
          "name": "A. D. Prince Prasanna",
          "authorId": "2391611627"
        }
      ],
      "year": 2025,
      "abstract": "Modern political philosophy has long been anchored in the contractarian imagination — the belief that political legitimacy arises from an agreement among individuals who surrender their natural liberty to an external sovereign. From Hobbes’ Leviathan to Locke’s liberal state and Rousseau’s general will, the social contract tradition conceptualised order as something granted by authority rather than generated by community. This paper argues that such contractarian reasoning contains a moral flaw: it objectifies the state as an entity outside human consciousness, alienating citizens from their collective capacity to govern. Revisiting the origins of political association, I propose the idea of a “natural state” — not a pre-political condition of chaos, but a moral and social order rooted in mutual trust, cooperation, and coordination. The natural state represents a form of community consciousness, where individuals constitute the state through their shared moral awareness rather than through the act of delegation. Drawing from Arendt’s notion of power as people acting in concert, Foucault’s concept of biopower, and Habermas’ idea of communicative rationality, the paper reconstructs the origin of political authority as an expression of human sociability rather than its restraint. By reclaiming the natural state, we rediscover the ethical foundation of political life — one that situates power within the people rather than above them. The paper concludes by framing this vision as a normative ideal for reawakening community consciousness in an increasingly fragmented and technocratic world.",
      "citationCount": 0,
      "doi": "10.31305/rrijm.2025.v10.n10.014",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/a2f7c062ba69389e86ca57e7ea57a3fc02c5dd25",
      "venue": "RESEARCH REVIEW International Journal of Multidisciplinary",
      "journal": {
        "name": "RESEARCH REVIEW International Journal of Multidisciplinary"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "af4b2ec11c52dfc84f5f2c8726ebc33bb8396a43",
      "title": "MINANGKABAU LEADERSHIP PHILOSOPHY: Synthesizing Religion, Adat, and Intellectuals in the History of Islamic Political Thought",
      "authors": [
        {
          "name": "Lukmanul Hakim",
          "authorId": "2334941074"
        },
        {
          "name": "Rahmad Tri Hadi",
          "authorId": "2186708217"
        },
        {
          "name": "Ahmad Ahmad",
          "authorId": "2336523821"
        }
      ],
      "year": 2025,
      "abstract": "This article explores the Minangkabau leadership philosophy through the perspective of the history of Islamic political thought, focusing on the integration of Islamic values, customary principles, and the role of intellectuals in traditional Minangkabau society. The research problem centers on how this local leadership model rooted in concepts such as Tungku Nan Tigo Sajarangan and Tali Nan Tigo Sapilin reflects the evolution and localization of Islamic political concepts, particularly concerning authority, justice, and legitimacy. Using a qualitative method and a historical-analytical approach, the study draws on classical Islamic political texts and local Minangkabau sources to trace continuities and adaptations in political thought. The findings indicate that the Minangkabau leadership tradition embodies a contextualized interpretation of Islamic political ideas that has endured across generations. It suggests that this tradition, when revisited with empirical data from relevant contemporary stakeholders, can offer practical frameworks for cultivating integrity-based and sustainable leadership in modern Muslim societies. This study contributes to broadening the discourse on Islamic political thought by emphasizing indigenous contributions and the relevance of local wisdom in contemporary governance.",
      "citationCount": 0,
      "doi": "10.30821/miqot.v49i1.1357",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/af4b2ec11c52dfc84f5f2c8726ebc33bb8396a43",
      "venue": "Miqot: Jurnal Ilmu-ilmu Keislaman",
      "journal": {
        "name": "MIQOT: Jurnal Ilmu-ilmu Keislaman"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "8e546c4e617e299bb3fc6f030afca520e59e21ce",
      "title": "Realism and Political Liberalism in Normative Political Theory",
      "authors": [
        {
          "name": "Jan Rodin",
          "authorId": "2346626564"
        }
      ],
      "year": 2025,
      "abstract": "This paper casts light on the dialogue between political realism and John Rawls’s political liberalism. I describe political realism on the basis of contemporary realist currents that attempt to render politics an autonomous sphere of human activity, largely through an investigation of sources of normativity apt for guiding political action. I elaborate on what points realists suggest they conflict with political liberalism, and identify three foundational similarities between the two approaches to the legitimation of political authority which should suggest that political realism ought to consider a consensus view of political legitimacy. First, both approaches to normative political theory emerged from the broader tradition of liberal philosophy. Second, both rest on the premise of a pluralistic society, which has certain normative implications. Third, both are attempts to justify the primacy of the political over the metaphysical. When considered together, these assumptions point to a demand for a theoretical inquiry into a consensus view of realist legitimacy.",
      "citationCount": 0,
      "doi": "10.20901/pm.61.4.04",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/8e546c4e617e299bb3fc6f030afca520e59e21ce",
      "venue": "Politička Misao",
      "journal": {
        "name": "Politička misao"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "6856e8ee4a599b8e4a683dc966c5e8aaeb0e65d1",
      "title": "The Epistemology of Ijtihad Irsyadi in Fatwas: A Deconstruction of Takhrij Mażhabi through Case Studies of the Lirboyo Fatwa Council",
      "authors": [
        {
          "name": "Muhammad Ibtihajuddin",
          "authorId": "2395236133"
        },
        {
          "name": "Abdul Fattaah",
          "authorId": "2395239262"
        },
        {
          "name": "Moch. Nurcholis",
          "authorId": "2395237959"
        },
        {
          "name": "Zakka Asvi Auful Shohi Muhammad",
          "authorId": "2395239883"
        }
      ],
      "year": 2025,
      "abstract": "The rigidity of the takhrīj mażhabi methodology in pesantren fatwa traditions necessitates a new epistemological approach that is more responsive to contemporary realities. This study aims to explore ijtihād irsyādi as a methodological alternative that maintains continuity with classical tradition while enabling contextual creativity grounded in maqāṣid al-sharī’ah. Employing a qualitative-descriptive-analytical-exploratory approach and a case study method focused on the fatwas of the Lajnah Bahtsul Masail (LBM) Lirboyo from 2019 to 2024, the analysis reveals significant epistemological transformation in istinbath structures. Key findings demonstrate that ijtihād irsyadī prioritizes maslahat (public interest), referential flexibility, and social interpretation as legal foundations, replacing the deductive-formalistic patterns of madhhab-based takhrīj. This approach reinterprets classical authority through maqāṣid frameworks without negating its legitimacy, as evidenced in the 2023 BPJS Healthcare fatwa that teleologically reconstructs social insurance concepts via taḥrīr al-mafhūm (conceptual liberation), tanqīḥ al-manāṭ (ratio legis purification), and ta'līl maqāṣidī (teleological justification). The novelty lies in articulating an adaptive, integrative fatwa epistemology that proactively engages temporal dynamics, offering a reformative paradigm for Indonesian pesantren fatwa methodologies and a substantive contribution to renewing contemporary Islamic legal thought.",
      "citationCount": 0,
      "doi": "10.22515/jurnalalhakim.v7i02.12412",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/6856e8ee4a599b8e4a683dc966c5e8aaeb0e65d1",
      "venue": "Jurnal Al-Hakim: Jurnal Ilmiah Mahasiswa, Studi Syariah, Hukum dan Filantropi",
      "journal": {
        "name": "Jurnal Al-Hakim: Jurnal Ilmiah Mahasiswa, Studi Syariah, Hukum dan Filantropi"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "9f9bd92c39ea24734ad880203d51a49910c3dcce",
      "title": "Human Rights and the Just War Tradition: Striving towards a framework of justification for humanitarian military interventions",
      "authors": [
        {
          "name": "J. Nieuwenhuis",
          "authorId": "116504761"
        }
      ],
      "year": 2015,
      "abstract": null,
      "citationCount": 0,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/9f9bd92c39ea24734ad880203d51a49910c3dcce",
      "venue": "",
      "journal": {
        "name": "",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "4c7cedd98a856a52722a356b78bf1eb5df0a9199",
      "title": "Qur’an Translation",
      "authors": [
        {
          "name": "Adil Lachgar",
          "authorId": "2201171379"
        }
      ],
      "year": 2023,
      "abstract": "The Holy Qur’an is the Holy Book of Islam and the most important of the three sources of authority which underpin Muslim religious life, the other two being the revelation by the Prophet Muhammad (peace be upon him) during his life (hadith, ‘sayings’) and the Prophet’s own practice (Sunna, ‘tradition’). The importance attached to the Qur’an stems from the belief that it contains, verbatim, the Word of God, as revealed piecemeal to the Prophet Muhammad (peace be upon him) by Angel Gabriel between 610 and 632 AD. It is therefore considered inimitable, and this has important implications for the legitimacy and the (authorized) methods of translating it.",
      "citationCount": 8,
      "doi": "10.32996/ijtis.2023.3.4.1",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/4c7cedd98a856a52722a356b78bf1eb5df0a9199",
      "venue": "International Journal of Translation and Interpretation Studies",
      "journal": {
        "name": "International Journal of Translation and Interpretation Studies"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "c534800c539b7ac9e48165926e4f68ca64c1743c",
      "title": "Science legitimacy and the postmodern condition of knowledge",
      "authors": [
        {
          "name": "Maria Formosinho",
          "authorId": "98151070"
        },
        {
          "name": "S. Formosinho",
          "authorId": "3087278"
        },
        {
          "name": "C. Reis",
          "authorId": "144311673"
        }
      ],
      "year": 2014,
      "abstract": "We start by showing how science is as much a personal as a social endeavour, carefully driven between convictions and scepticism, depending on strictly defined criteria that are made possible through a conjunction of social norms intimately connected to epistemological principles. If the sociological contexts play an important role, we must recognize that science compensates their influence with the experimental gathering of evidences. However knowledge always requires a link to tradition, believe and authority, i.e., tacit knowledge and a fiduciary framework. Objectivity can also be supported by science’s success to describe and transform reality, within a renewed process that continuously expands what we know and can transform. This attests the power of science that meanwhile was separated from the ethical dimension required to all kind of knowledge appliance, thus redirecting us to the sociological contexts of science. We then refer to how science’s sociological structures consequently changed when the dimension, cost and importance of science for economic progress was such that responsibility for it was taken from the hands of scientists. The age of competition for scarce resources marks the end of pure intellectual competition in which science’s progress was conditioned mainly by individual creativity. That’s why sociological factors regain nowadays a much more important role to play in science dynamics. The paper concludes by presenting how a new sociologically framework of scientific knowledge is emerging: the “fourth age of research” driven by international collaborations between elite research groups, strongly guided for markets, and once again science’s autonomy is at stake.",
      "citationCount": 0,
      "doi": "10.14687/IJHS.V11I1.2776",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/c534800c539b7ac9e48165926e4f68ca64c1743c",
      "venue": "",
      "journal": {
        "name": "journal of new results in science",
        "pages": "427-447",
        "volume": "11"
      },
      "publicationTypes": null
    },
    {
      "paperId": "8f218422888995ba3ff89b5a65da8a80c85b1221",
      "title": "Cosmopolitanism, just war theory and legitimate authority",
      "authors": [
        {
          "name": "Cécile Fabre",
          "authorId": "48964488"
        }
      ],
      "year": 2008,
      "abstract": null,
      "citationCount": 78,
      "doi": "10.1111/J.1468-2346.2008.00749.X",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/8f218422888995ba3ff89b5a65da8a80c85b1221",
      "venue": "",
      "journal": {
        "name": "International Affairs",
        "pages": "963-976",
        "volume": "84"
      },
      "publicationTypes": null
    },
    {
      "paperId": "c9a32407654d9e7652ed4098bd4e7effa317b33b",
      "title": "Authority, Representation, and the Contradictions of Posttraditional Governing",
      "authors": [
        {
          "name": "T. Catlaw",
          "authorId": "115531277"
        }
      ],
      "year": 2006,
      "abstract": null,
      "citationCount": 36,
      "doi": "10.1177/0275074005283191",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/c9a32407654d9e7652ed4098bd4e7effa317b33b",
      "venue": "",
      "journal": {
        "name": "The American Review of Public Administration",
        "pages": "261 - 287",
        "volume": "36"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "9cfab8ca0354c321e51a7be7266c59ef418650fb",
      "title": "The Science Canopy: Religion, Legitimacy, and the Charisma of Science",
      "authors": [
        {
          "name": "James R. Lewis",
          "authorId": "2109240509"
        }
      ],
      "year": 2010,
      "abstract": "Academics usually think of religion as legitimating other social institutions. However, one often finds apologists appealing to the authority of science as a strategy for supporting the truths of their particular tradition. In a social environment where diverse religious claims compete with each other, it is probably inevitable that different groups seek alternate sources of legitimacy. Science is an attractive legitimator because of its prestige and because of the popular view of science as an objective arbiter of ‘truth’. After examining the notion of ‘legitimation strategies’ derived from Max Weber’s discussion of the legitimation of authority, the article analyzes the specific ways in which religious groups appeal to the authority of science.",
      "citationCount": 6,
      "doi": "10.33356/TEMENOS.6939",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/9cfab8ca0354c321e51a7be7266c59ef418650fb",
      "venue": "",
      "journal": {
        "name": "Temenos",
        "volume": "46"
      },
      "publicationTypes": null
    },
    {
      "paperId": "5119b1214162dd4a8a4bf901b84dbce938c1b5ab",
      "title": "Democratic Legitimacy and the Reasoned Will of the People",
      "authors": [
        {
          "name": "Walter J. Riker",
          "authorId": "118565744"
        }
      ],
      "year": 2008,
      "abstract": null,
      "citationCount": 4,
      "doi": "10.1007/978-1-4020-6879-9_6",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/5119b1214162dd4a8a4bf901b84dbce938c1b5ab",
      "venue": "",
      "journal": {
        "name": "",
        "pages": "77-94",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "aec081dbf16540752837e50b1d58e5ce5dfc60a1",
      "title": "The legitimacy bases for Confucianists’ political order construction",
      "authors": [
        {
          "name": "Hu Ruijun",
          "authorId": "2085350723"
        }
      ],
      "year": 2008,
      "abstract": null,
      "citationCount": 0,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/aec081dbf16540752837e50b1d58e5ce5dfc60a1",
      "venue": "",
      "journal": null,
      "publicationTypes": null
    },
    {
      "paperId": "14430e1c82859c714fdf1c1d245acdeae202f524",
      "title": "Penser l'infinité : Thomas d'Aquin et Bonaventure face à la tradition des pères grecs",
      "authors": [
        {
          "name": "André Gravil",
          "authorId": "133601167"
        }
      ],
      "year": 2009,
      "abstract": null,
      "citationCount": 0,
      "doi": "10.3917/leph.094.0555",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/14430e1c82859c714fdf1c1d245acdeae202f524",
      "venue": "",
      "journal": null,
      "publicationTypes": null
    },
    {
      "paperId": "1a4da7657ae26c389e8f84446434cb9283abca93",
      "title": "Moral and the Legitimacy of Traditional Politics of China",
      "authors": [
        {
          "name": "Ren Jian-tao",
          "authorId": "1479478155"
        }
      ],
      "year": 2005,
      "abstract": null,
      "citationCount": 0,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/1a4da7657ae26c389e8f84446434cb9283abca93",
      "venue": "",
      "journal": {
        "name": "Journal of Central China Normal University",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "5063f895b8e6185f27b87ab4d0dc19bc98a896e2",
      "title": "The conversions of ʿAbdallāh ibn Salām (d. 43/633): A legendary moment in the biography of Muḥammad's Jewish companion",
      "authors": [
        {
          "name": "S. A. Stafford",
          "authorId": "2045370210"
        }
      ],
      "year": 2021,
      "abstract": "Abstract The Jewish scholar ʿAbdallāh b. Salām is a legendary figure from early Islam who is regarded in Islamic tradition as the archetypal Jewish convert to Islam during the Prophet's career, the pre-eminent authority on Jewish scriptures in seventh-century Arabia, and a renowned Companion. This study examines the traditions on Ibn Salām's conversion that were recorded in the biographical literature and Quranic commentaries of classical Islam and identifies the literary tropes from Muḥammad's biography featured in these traditions. Scrutiny of the evidence shows that the reports on the date and circumstances of Ibn Salām's conversion were shaped by a number of factors, including, the biases of his descendants, Quranic exegesis, and anti-Jewish polemics. Ibn Salām's legendary conversion served as a vehicle for diverse groups of Muslims to promote their doctrines and supply the Prophet with Biblical legitimacy.",
      "citationCount": 1,
      "doi": "10.1017/S0041977X21000720",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/5063f895b8e6185f27b87ab4d0dc19bc98a896e2",
      "venue": "Bulletin of the School of Oriental and African Studies",
      "journal": {
        "name": "Bulletin of the School of Oriental and African Studies",
        "pages": "237 - 261",
        "volume": "84"
      },
      "publicationTypes": null
    }
  ],
  "count": 30,
  "errors": []
}
