[s2_search.py] Searching Semantic Scholar: 'living tradition' (year=2010-2025) (field=Philosophy), limit=25
[s2_search.py] Retrieved 25/25 papers...
[s2_search.py] Cached results (cache key: s2_e2328d3afa88f9ee)
{
  "status": "success",
  "source": "semantic_scholar",
  "query": "living tradition",
  "results": [
    {
      "paperId": "cce9408965937645e4820cafb4437a8ff43557c4",
      "title": "Review of Monastic Ecological Wisdom: A Living Tradition",
      "authors": [
        {
          "name": "Katherine Howard",
          "authorId": "2319736550"
        }
      ],
      "year": 2024,
      "abstract": null,
      "citationCount": 0,
      "doi": "10.69755/2995-2212.1299",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/cce9408965937645e4820cafb4437a8ff43557c4",
      "venue": "The Journal of Social Encounters",
      "journal": {
        "name": "The Journal of Social Encounters"
      },
      "publicationTypes": [
        "JournalArticle",
        "Review"
      ]
    },
    {
      "paperId": "23b2170a9323ec1101f7d5df0c811ceb88f66106",
      "title": "Monastic ecological wisdom: a living tradition",
      "authors": [
        {
          "name": "James M. M. Francis",
          "authorId": "144969388"
        }
      ],
      "year": 2024,
      "abstract": null,
      "citationCount": 0,
      "doi": "10.1080/14704994.2024.2405267",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/23b2170a9323ec1101f7d5df0c811ceb88f66106",
      "venue": "Rural Theology",
      "journal": {
        "name": "Rural Theology",
        "pages": "171 - 171",
        "volume": "22"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "9bcc97f5b1dc7f9b44ad605ae770be09ecb09c72",
      "title": "The Source of Living Tradition",
      "authors": [
        {
          "name": "Elizaveta Lozhkina",
          "authorId": "2283418459"
        }
      ],
      "year": 2023,
      "abstract": "An International online conference under the heading “Kalyk kyloslen vizyl oshmesyesyz” – “The Source of Living Tradition” – “Elava traditiooni lätetel”, dedicated to the 70th jubilee of Udmurt folklorist Tatiana Vladykina, was held on October 4–6 2023. Tatiana Vladykina is a well-known Udmurt folklorist, Doctor of Philology, Professor of Folkloristics, laureate of the State award of the Udmurt Republic in the field of literature and art, foreign honorary member of the Finno-Ugric Society (Finland), laureate of the “Soul of Udmurtia” award of the Udmurt Republic in the field of traditional culture, leading researcher of the Department of Philological Research of the Udmurt Institute of History, Language and Literature of the UdmFRC UB RAS.",
      "citationCount": 0,
      "doi": "10.7592/ybbs6.15",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/9bcc97f5b1dc7f9b44ad605ae770be09ecb09c72",
      "venue": "Yearbook of Balkan and Baltic Studies",
      "journal": {
        "name": "Yearbook of Balkan and Baltic Studies"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "18805d51a332126dc1230d9f1d3150c6120b8c88",
      "title": "The conception of Living Tradition in the context of the life and work of Jaroslav Pelikan",
      "authors": [
        {
          "name": "Anna S. Pronina",
          "authorId": "2277111050"
        }
      ],
      "year": 2023,
      "abstract": "The article considers the issue of the formation of the idea of a Living Tradition in the scientific and social activities of the American scientist Jaroslav Pelikan (1923–2006). In the life and intellectual path of a scientist, three stages — early, middle and late ones — are conditionally identified. The article shows that the concept of Living Tradition is the result of the development of two sides of Pelican’s life and that the study of the Christian tradition can lead to a change in confessional affiliation. Particular attention is paid to the middle and late periods of his intellectual and spiritual searches, at the stage of which the scientist discovers the heritage of the Ancient Church. The article also highlights the Pelikan’s theological features of the conception of the Living Tradition. Through the idea of a Living Tradition, the scientist reconciles the continuity of the tradition of the Church and the changes within this continuum. The article shows that the conception of Living Tradition is closely connected with the idea of catholicity and continuity of the Church. The author claims that, firstly, the Pelikan, in the idea of Tradition, adopted the language of representatives of the Catholic school of Tubingen and the Orthodox Neo-Patristic school. At the same time, the theological thought of J. Pelikan continues to move within the strict framework of the set research goal — historical research and justification of continuity and changes in the Church. It is also shown that J. Pelikan’s views on the conception of Living Tradition are largely dictated by his correspondence polemic with his predecessor A. von Harnack. In addition, the article concludes that the Pelikan in his understanding of Tradition is not so sensitive to the Divine within Tradition, understood as the action of the Holy Spirit in the Church. At the end of the article, it is demonstrated that at the late stage of his work, Pelikan fails to fully solve the problem of Tradition. This research can be useful for everyone who is interested in the life and work of modern theologians and Christian historians.",
      "citationCount": 0,
      "doi": "10.21638/spbu28.2023.405",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/18805d51a332126dc1230d9f1d3150c6120b8c88",
      "venue": "Issues of Theology",
      "journal": {
        "name": "Issues of Theology"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "1bd841ecfdf1eb13ab57c437efb8b9089d4961e0",
      "title": "Living Tradition in Orthodox Theological Spirituality and/in Contemporary Society: Comments on Traditionalism, Traditions and Renewal",
      "authors": [
        {
          "name": "N. Dumitraşcu",
          "authorId": "115127492"
        }
      ],
      "year": 2021,
      "abstract": "In this article I aim to discuss the resources and methods by which Tradition can adapt to the needs of contemporary society, without losing any of its power and content. What is the difference between “Tradition” and “Traditionalism” and to what extent does the latter distort the actualization of the Gospel message? Does the diversity of local or regional “traditions” affect the unity and character of the Tradition? Can we talk about adaptability or renewal of Tradition? What does “formalism” mean and how harmful is it for receiving the authentic content of Tradition?",
      "citationCount": 0,
      "doi": "10.1177/00405736211004861",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/1bd841ecfdf1eb13ab57c437efb8b9089d4961e0",
      "venue": "Theology Today",
      "journal": {
        "name": "Theology Today",
        "pages": "73 - 87",
        "volume": "78"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "6798ccd0b5e0890ab59fd4e4088a47c2ca2abd38",
      "title": "Human Rights in Catholic Social Thought: A Living Tradition and Some Urgent Challenges Today",
      "authors": [
        {
          "name": "David Hollenbach",
          "authorId": "120446739"
        }
      ],
      "year": 2019,
      "abstract": "The Catholic church’s stance toward human rights has developed dramatically during the 70 years since the UN General Assembly proclaimed the Universal Declaration of Human Rights in 1948. In this paper, I will first illustrate several of the developments and suggest some reasons why they occurred. Second, I will outline the Catholic community’s significant practical contribution to human rights in recent decades. Finally, I will sketch two areas where further development is happening or needed today: the rights of refugees and the rights of women. Thus, I will illustrate that a ‘living tradition’ shapes the Catholic approach to human rights. The historian of Christian doctrine Jaroslav Pelikan described a tradition as ‘the living faith of the dead,’ in contrast with traditionalism, which he called ‘the dead faith of the living.’1 The church’s living commitment to human rights is especially important today. Some commentators maintain today that belief in the importance of human rights is becoming a ‘dead faith.’ For example, Stephen Hopgood argues that the failure to protect human rights in regions like Cambodia, Rwanda, and Syria means we are in ‘the endtimes of human rights.’ Yascha Mounk sees the rise of nationalist populism and its often",
      "citationCount": 2,
      "doi": "10.1177/0021140019849422",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/6798ccd0b5e0890ab59fd4e4088a47c2ca2abd38",
      "venue": "Irish Theological Quarterly",
      "journal": {
        "name": "Irish Theological Quarterly",
        "pages": "259 - 267",
        "volume": "84"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "1a32aafc7732e2c8734661f1880ab47c5ada25d2",
      "title": "Living Tradition and Learning Agency: Interpreting the ‘Score’ and Personal Rendition",
      "authors": [
        {
          "name": "J. Sullivan",
          "authorId": "145430163"
        }
      ],
      "year": 2018,
      "abstract": null,
      "citationCount": 1,
      "doi": "10.1007/978-3-319-62803-5_7",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/1a32aafc7732e2c8734661f1880ab47c5ada25d2",
      "venue": "",
      "journal": {
        "name": "",
        "pages": "93-114",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "81e84a344ffcadd56ab648ef321f9362ad1d379c",
      "title": "The concept of a living tradition",
      "authors": [
        {
          "name": "Martin Beckstein",
          "authorId": "113342396"
        }
      ],
      "year": 2017,
      "abstract": null,
      "citationCount": 27,
      "doi": "10.1177/1368431016668185",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/81e84a344ffcadd56ab648ef321f9362ad1d379c",
      "venue": "",
      "journal": {
        "name": "European Journal of Social Theory",
        "pages": "491 - 510",
        "volume": "20"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "4cdd73a86fa0f779d9718eee4691135df2faa37f",
      "title": "Wilberforce, Nightingale and King Jr: The Wesleyan Tradition as a Basis for Social Justice and Ethical Living",
      "authors": [
        {
          "name": "Daniel Dei",
          "authorId": "2329827955"
        }
      ],
      "year": 2024,
      "abstract": "Abstract This article probes the Wesleyan tradition’s contribution to ethical living and social justice in contemporary discussions. It provides a brief overview of the Wesleyan tradition, connects it to personal faith and social duty, emphasizes the Holy Spirit’s role in transforming people and groups, as well as the importance of communal holiness. Through critical analysis and theological reflections, this article demonstrates that key principles in the Wesleyan tradition can inform broader Christian engagement in ethical living and social activism in various contexts, with reference to the lives and examples of William Wilberforce, Martin Luther King Jr, and Florence Nightingale. Accordingly, it is demonstrated that Christians today can work towards a just, diverse, equitable, and inclusive society through an application of the key principles of the Wesleyan tradition.",
      "citationCount": 0,
      "doi": "10.2478/holiness-2024-0014",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/4cdd73a86fa0f779d9718eee4691135df2faa37f",
      "venue": "Holiness",
      "journal": {
        "name": "Holiness",
        "pages": "72 - 88",
        "volume": "9"
      },
      "publicationTypes": [
        "JournalArticle",
        "Review"
      ]
    },
    {
      "paperId": "f2aad1025428e0df880cdb267fa3a5a7793accda",
      "title": "Tangling with Orthodox Tradition in the Modern West: Natural Law, Homosexuality, and Living Tradition",
      "authors": [
        {
          "name": "B. Gallaher",
          "authorId": "122805331"
        }
      ],
      "year": 2018,
      "abstract": null,
      "citationCount": 4,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/f2aad1025428e0df880cdb267fa3a5a7793accda",
      "venue": "",
      "journal": {
        "name": "",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "cc69dbae927937cb842a61777f8d0486578e2a81",
      "title": "“Ma’Sembong” as a Living Tradition of Tompaso’s Society",
      "authors": [
        {
          "name": "Donna Sampaleng",
          "authorId": "101974539"
        },
        {
          "name": "M. Liando",
          "authorId": "116248376"
        }
      ],
      "year": 2018,
      "abstract": "This study aims to examine a tradition that exists in the familial community of Tompaso Minahasa, Ma'sembong. It is an activity of togetherness that has profound philosophical meaning. The Tompaso tradition is very different from what is known as Mapalus. Ma'Sembong is one of the auxiliary traditions that are inspired and lived up from one generation to the next generation of the Tompaso community. It may also be from also the philosophy of life of the Minahasa people \"Si Tou Timou Tumou Tou\" and is closely related to the North Sulawesi motto \"Torang Samua Basudara\". They are increasingly echoing in the application of the order of life which refers to mutual cooperation but Ma'Sembong philosophy is more profound than just being together. In this study, researchers conducted data selection and validation process using qualitative ethnography",
      "citationCount": 0,
      "doi": "10.2991/icss-18.2018.307",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/cc69dbae927937cb842a61777f8d0486578e2a81",
      "venue": "",
      "journal": {
        "name": "",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "0452f5f2cf1865859527f4d47f26547974713c78",
      "title": "\"That Jewish Belief in the Living God of Israel\": Jewish Tradition in the Thought of Ze'ev Jabotinsky",
      "authors": [
        {
          "name": "Elad Nahshon",
          "authorId": "2225959267"
        }
      ],
      "year": 2023,
      "abstract": "ABSTRACT:Scholars who have dealt with Jabotinsky's attitude toward Jewish tradition have shared the premise that he was a secular thinker who went through a significant ideological shift in the 1930s, or at least displayed a more favorable approach to religion thereafter for political reasons. However, close examination of his early writings shows that almost all the views he expressed in the 1930s are to be found decades before. Hence, Jabotinsky should be viewed as a thinker who for most of his life held a multifaceted, yet fairly consistent approach to tradition: criticizing Jewish halakha and calling for its reform, while considering religion a great moral force for human progress, describing Jewish tradition as integral to national culture, past and future, and to a certain extent, even romanticizing religious experience. This inclination establishes Jabotinsky as a moderate-secularist easily able to ally himself politically with Religious-Zionists while remaining a non-observant Jew.",
      "citationCount": 1,
      "doi": "10.2979/is.2023.a903073",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/0452f5f2cf1865859527f4d47f26547974713c78",
      "venue": "Israel Studies",
      "journal": {
        "name": "Israel Studies",
        "pages": "76 - 95",
        "volume": "28"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "2ccc8569eceecac119367fd7e2bda87b607e31ee",
      "title": "British Marxism and Cultural Studies : Essays on a living tradition",
      "authors": [
        {
          "name": "P. Bounds",
          "authorId": "89773012"
        },
        {
          "name": "D. Berry",
          "authorId": "47490668"
        }
      ],
      "year": 2016,
      "abstract": null,
      "citationCount": 2,
      "doi": "10.4324/9781315570174",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/2ccc8569eceecac119367fd7e2bda87b607e31ee",
      "venue": "",
      "journal": {
        "name": "",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "119b6fdaa7f8a9145291c609af85e49739f2db85",
      "title": "THE LIVING TRADITION OF LIVING IN THE LAW : Paul ’ s Use of Leviticus 18 : 5",
      "authors": [
        {
          "name": "E. Onggosanusi",
          "authorId": "2714652"
        }
      ],
      "year": 2017,
      "abstract": "This essay addresses Paul’s quotations of Leviticus 18:5 in Galatians and Romans. Starting from the interpretive tradition of Leviticus 18:5, intertextuality between the quotation and the surrounding texts is traced along with echoes of Leviticus 18:5 throughout each epistle. It is demonstrated that Paul interpreted Leviticus 18:5 in Galatians in connection to the reward of life. In Romans, on the other hand, Paul interpreted Leviticus 18:5 as the law written on the hearts of those who are in Christ –thus fulfilling its covenantal function. Rather than implying inconsistency, Paul’s different applications of Leviticus 18:5 are consistent with the unity of his view on the law.",
      "citationCount": 0,
      "doi": "10.46567/ijt.v4i1.49",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/119b6fdaa7f8a9145291c609af85e49739f2db85",
      "venue": "",
      "journal": null,
      "publicationTypes": null
    },
    {
      "paperId": "6fb193f89c40e087d474f108ddd9d7ff586e9c33",
      "title": "Jonathan Edwards and Justification: Embodying a Living Tradition",
      "authors": [
        {
          "name": "J. Huggins",
          "authorId": "145437167"
        }
      ],
      "year": 2014,
      "abstract": null,
      "citationCount": 0,
      "doi": "10.1163/15697312-14080104",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/6fb193f89c40e087d474f108ddd9d7ff586e9c33",
      "venue": "",
      "journal": {
        "name": "Journal of Reformed Theology",
        "pages": "169-202",
        "volume": "8"
      },
      "publicationTypes": null
    },
    {
      "paperId": "17b3704a9caf10f5c7c129d8a5f19b9d9d3a8441",
      "title": "Renewing Confucianism as a Living Tradition in 21st Century China: Reciting Classics, Reviving Academies and Restoring Rituals",
      "authors": [
        {
          "name": "Yong Chen",
          "authorId": "2115838902"
        }
      ],
      "year": 2012,
      "abstract": null,
      "citationCount": 5,
      "doi": "10.1163/9789004230231_006",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/17b3704a9caf10f5c7c129d8a5f19b9d9d3a8441",
      "venue": "",
      "journal": {
        "name": "",
        "pages": "63-84",
        "volume": ""
      },
      "publicationTypes": [
        "Review"
      ]
    },
    {
      "paperId": "c4290afced605d00e292b8ad8062682f9b79a8a7",
      "title": "Buddhism as a 'living tradition' : The foundation for Buddhism without borders",
      "authors": [
        {
          "name": "K. Gregory",
          "authorId": "96932035"
        }
      ],
      "year": 2012,
      "abstract": null,
      "citationCount": 0,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/c4290afced605d00e292b8ad8062682f9b79a8a7",
      "venue": "",
      "journal": {
        "name": "",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "3ee2dcddebffcc3aee8e92652bc7deebb5bcb94d",
      "title": "The Mukaekō Ritual at Taimadera: A Living Tradition of Medieval Japanese Pure Land Buddhism",
      "authors": [
        {
          "name": "M. Dix",
          "authorId": "90471030"
        }
      ],
      "year": 2010,
      "abstract": null,
      "citationCount": 0,
      "doi": "10.18357/ILLUMINE2120031569",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/3ee2dcddebffcc3aee8e92652bc7deebb5bcb94d",
      "venue": "",
      "journal": {
        "name": "",
        "pages": "17-24",
        "volume": "2"
      },
      "publicationTypes": null
    },
    {
      "paperId": "004979412ef56b3d8d5ea867258918f32dbecc16",
      "title": "The Nandimitrāvadāna : a living text from the Buddhist tradition",
      "authors": [
        {
          "name": "R. Chen",
          "authorId": "2219971384"
        }
      ],
      "year": 2018,
      "abstract": null,
      "citationCount": 4,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/004979412ef56b3d8d5ea867258918f32dbecc16",
      "venue": "",
      "journal": {
        "name": "",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "6594c5eb9f04a472bbd424046038fcea3bdcd674",
      "title": "Christological Transformation of the Motif of “Living Water” (John 4; 7): Prophetic Messiah Expectations and Wisdom Tradition",
      "authors": [
        {
          "name": "Andrea Taschl-Erber",
          "authorId": "2079622470"
        }
      ],
      "year": 2018,
      "abstract": "“Living water” connects Jesus’s dialogue with the Samaritan woman at Jacob’s well (John 4) with his teaching in the temple at the festival of Sukkot (John 7). Referring to a multifaceted biblical imagery, the theme of water interweaves elements of well stories, including Moses traditions (especially the gift of water out from the rock in the desert, later parallelized with the gift of the Torah), eschatological hopes (the fountain coming forth from the temple, the outpouring of the spirit), and sapiental images (wisdom and teaching, or the Torah, as fountain of life). Providing the life-giving water, Jesus is presented on the one hand as the “prophet like Moses” depicted in Deut. 18. On the other hand, he acts in the role of Wisdom, who invites those who are thirsty to come. In John 4 as well as in John 7, the gift of the water of life is connected with messiah discourses. While alluding to popular expectations of “the prophet” and “the messiah,” the Fourth Gospel’s presentation of the Χριστός goes beyond. Integrating the Wisdom strand with the concept of the Logos into its Christology, Jesus is portrayed to be more than a/the prophet.",
      "citationCount": 1,
      "doi": "10.1163/9789004376045_012",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/6594c5eb9f04a472bbd424046038fcea3bdcd674",
      "venue": "Reading the Gospel of John’s Christology as Jewish Messianism",
      "journal": {
        "name": "Reading the Gospel of John’s Christology as Jewish Messianism"
      },
      "publicationTypes": null
    },
    {
      "paperId": "511fdcd6b701f77cf032f8a359b0db543a5acf05",
      "title": "From Catholic Social Thought to Catholic Social Living: A Narrative of the Tradition",
      "authors": [
        {
          "name": "B. Brady",
          "authorId": "67156206"
        }
      ],
      "year": 2018,
      "abstract": null,
      "citationCount": 1,
      "doi": "10.5840/jcathsoc201815219",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/511fdcd6b701f77cf032f8a359b0db543a5acf05",
      "venue": "",
      "journal": {
        "name": "Journal of Catholic Social Thought",
        "pages": "317-352",
        "volume": "15"
      },
      "publicationTypes": null
    },
    {
      "paperId": "5f15070b6d90aa10c262c5cbf491606cce0145b7",
      "title": "Nomos Empsychos: towards a Historiography of the Greek Living Law Idea",
      "authors": [
        {
          "name": "Ákos Tussay",
          "authorId": "2120709892"
        }
      ],
      "year": 2024,
      "abstract": "\nIn the Middle Ages, the idea of legislative sovereignty was expressed with reference to a host of commonplace arguments, such as pater legis, Sol Iustitiae, or lex animata. And many believe that it was the Roman legal concept of animate law which eventually laid the foundation for the elaboration of the idea of absolute power in the late Middle Ages. If this hypothesis is correct, the philosophic background of some late medieval and early modern absolutistic doctrines of political government could be sought after as early as the classical Greek descriptions of a king who is nomos empsychos, that is, a living law. In this article, I intend to consider this intellectual tradition, and raise some doubts about the merits of the above claim, arguing instead for a separate consideration of the individual sources of the nomos empsychos concept. As such, I am tracing the genealogy of the expression to the fifth-century Pythagorean, Archytas of Tarentum, and I am demonstrating that originally the nomos empsychos was inseparably associated with an intrinsically Archytean tradition.",
      "citationCount": 1,
      "doi": "10.1163/20512996-12340447",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/5f15070b6d90aa10c262c5cbf491606cce0145b7",
      "venue": "POLIS",
      "journal": {
        "name": "Polis: The Journal for Ancient Greek and Roman Political Thought"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "3cefb2a0154c362c64e07e6bc5783c89ca8640a4",
      "title": "The Ethical Message in Huang-Lao Manuscripts: Applying the Laozian Living Riddle as a \"Model of Modeling\"",
      "authors": [
        {
          "name": "Sharon Small",
          "authorId": "1381681212"
        },
        {
          "name": "Galia Patt-Shamir",
          "authorId": "1457359528"
        }
      ],
      "year": 2024,
      "abstract": "Abstract:The objective in this article is to apply a Daoist model of an ethic derived from the Laozi on writings of the Huang Lao tradition to offer a unique Daoist cosmically derived ethic in its own terms. Having our point of departure in the Laozi we refer to its paradoxical language as a living riddle that is inherent in the tradition, and as such it suggests a \"model of modeling.\" We find this model in Laozi 25, according to which self-so (ziran 自然) serves as foundation for an ethic that is neither dichotomizing nor resting on human moral conventions, but serves rather as a guiding philosophy of living. On this basis we explore the question of an ethic in the Huang Lao tradition.",
      "citationCount": 1,
      "doi": "10.1353/pew.2024.a925191",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/3cefb2a0154c362c64e07e6bc5783c89ca8640a4",
      "venue": "Philosophy East & West",
      "journal": {
        "name": "Philosophy East and West",
        "pages": "233 - 256",
        "volume": "74"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "62b95166138ff0477a75eab95eae96bf18887a20",
      "title": "Beyond mere repetition: On tradition, creativity and theological speech",
      "authors": [
        {
          "name": "R. Vosloo",
          "authorId": "20910181"
        }
      ],
      "year": 2023,
      "abstract": "This article argues for understanding Christian theological speech, including a Reformed engagement with confessions, as ‘traditioned creativity’. The argument is introduced by highlighting a theological hermeneutic that underlies the Belhar confession’s accompanying letter. This discussion points towards an account of Christian discourse that is ‘traditioned’ by the past but also moves beyond the mere repetition of the tradition’s authoritative statements. The article, therefore, affirms the need to distinguish between a living tradition and a narrow traditionalism. In addition, the article also interrogates some forms of theological rhetoric in which ‘tradition’ functions to insert control over spaces and people, often exhibiting totalising discourses and over-triumphant claims.Contribution: The conclusion links a hermeneutic of tradition (that sees Christian speech, doctrine and action as ‘traditioned creativity’) to some metaphors that can further illuminate what it means for a tradition to be open to the future in a way that displays vulnerability and vitality.",
      "citationCount": 2,
      "doi": "10.4102/hts.v79i2.9051",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/62b95166138ff0477a75eab95eae96bf18887a20",
      "venue": "HTS Teologiese Studies/Theological Studies",
      "journal": {
        "name": "HTS Teologiese Studies / Theological Studies"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "5689d97a802869e4a7666a1954922baa6e994e33",
      "title": "Practicing Philosophy in the Experience of Living: Philosophy as a Way of Life in the American Philosophical Tradition",
      "authors": [
        {
          "name": "Kenneth W. Stikkers",
          "authorId": "113719969"
        }
      ],
      "year": 2015,
      "abstract": null,
      "citationCount": 1,
      "doi": "10.1163/9789004301993_004",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/5689d97a802869e4a7666a1954922baa6e994e33",
      "venue": "",
      "journal": {
        "name": "",
        "pages": "34-57",
        "volume": ""
      },
      "publicationTypes": null
    }
  ],
  "count": 25,
  "errors": []
}
