[s2_search.py] Searching Semantic Scholar: 'tradition normative value political philosophy' (year=2000-2025) (field=Philosophy), limit=40
[s2_search.py] Retrieved 40/40 papers...
[s2_search.py] Cached results (cache key: s2_5010d234e4a6bb57)
{
  "status": "success",
  "source": "semantic_scholar",
  "query": "tradition normative value political philosophy",
  "results": [
    {
      "paperId": "aac2ae216d38edda23d22214c0b2784cc694fbef",
      "title": "Individualistic Versus Relational Ethics – A Contestable Concept for (African) Philosophy",
      "authors": [
        {
          "name": "P. Andanda",
          "authorId": "14082801"
        },
        {
          "name": "M. Düwell",
          "authorId": "48419141"
        }
      ],
      "year": 2024,
      "abstract": "Thaddeus Metz, in his book “A Relational Moral Theory” compares the relational African view to Western theories of right action with a focus on Kant (respective contemporary Kantianism) and Utilitarianism. In focussing on the opposition between a relational and an individualistic view, Metz questions the interpretation of basic normative assumptions that are guiding central Western moral and political institutions. He particularly focusses on Kantian and Utilitarian approaches to which he ascribes substantive moral assumptions in terms of utility respective autonomy. In this paper, we reconstruct Metz’s position on the opposition between a relational and an individualistic view on ethics. We then investigate whether his relational conceptualisation is a convincing reconstruction of African views and question his take on Western positions, focussing in particular on views around individual rights and communality as presented in the Kantian tradition. We highlight the value of ubuntu in intercultural discourse to foster ethical and moral reasoning in a holistic way and conclude that any reflection on ethics necessarily involves an understanding of our common human nature, which is at the core of philosophical anthropology.",
      "citationCount": 2,
      "doi": "10.1007/s10677-024-10445-0",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/aac2ae216d38edda23d22214c0b2784cc694fbef",
      "venue": "Ethical Theory and Moral Practice",
      "journal": {
        "name": "Ethical Theory and Moral Practice"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "039fc44d22f43da10414beee45305dd432223fbd",
      "title": "The Moral and Political Dimension of Economics. The Fact-Value Dichotomy",
      "authors": [
        {
          "name": "Vasco Almeida",
          "authorId": "113756056"
        }
      ],
      "year": 2016,
      "abstract": "Since the neoclassical school, the separation between facts and values, is and ought, positive and normative, has become a concern in conventional economic analyses. Economics should focus on facts, and present general principles, leaving the choice of various technical alternatives to policy makers. This article addresses the following questions: can economics, seen as a positive science, be separated from the political dimension? Is it possible to separate facts from values or are they necessarily intertwined? After showing how the separation between economics and moral philosophy unfolded throughout the history of economic thought, the article analyses the factvalue dichotomy discussion and concludes that facts and values are necessarily intertwined. Then, the article shows that the premises and theories of conventional economic theories contain hidden values, despite being presented as universal truths on which policies are based, and thus fail to discuss the various perspectives of the problems. Reviving a tradition commenced by Aristotle, the article concludes by arguing that economics is necessarily moral and political. However, the acknowledgement of the normative nature of economics cannot compromise the pursuit of objectivity.",
      "citationCount": 2,
      "doi": "10.18778/1899-2226.19.4.01",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/039fc44d22f43da10414beee45305dd432223fbd",
      "venue": "",
      "journal": {
        "name": "Annales. Ethics in Economic Life",
        "pages": "7-21",
        "volume": "19"
      },
      "publicationTypes": null
    },
    {
      "paperId": "cdc1e87b91d9c598bf7ce6341e7495ee964c4722",
      "title": "Hegel's Value",
      "authors": [
        {
          "name": "Dean Moyar",
          "authorId": "104098973"
        }
      ],
      "year": 2021,
      "abstract": "It has long been recognized that Hegel’s Philosophy of Right offers the only systematic alternative to the dominant social contract tradition in modern political philosophy. The difficulty has been to characterize Hegel’s view of justice as having the same kind of intuitive appeal that has made social contract theory, with its voluntary consent and assignment of rights and privileges, such an attractive model. Hegel’s Value argues that Hegelian justice depends on a proper understanding of Hegel’s theory of value and on the model of life through which the overall conception of value, the Good, is operationalized. Through an examination of key episodes in Phenomenology of Spirit and a detailed reading of the entire Philosophy of Right, Hegel’s Value shows how Hegel develops his account of justice through an inferentialist method whereby the content of right unfolds into increasingly thick normative structures. The theory of value that Hegel develops in tandem with the account of right relies on a productive unity of self-consciousness and life, of pure thinking and the natural drives. The book argues that Hegel’s expressive account of the free will enables him to theorize rights not simply as abstract claims, but rather as realizations of value in social contexts of mutual recognition. Hegel’s account of justice is a living system of institutions centered on a close relation of the economic and political spheres and on an understanding of the law as developing through practices of public reason.",
      "citationCount": 6,
      "doi": "10.1093/oso/9780197532539.001.0001",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/cdc1e87b91d9c598bf7ce6341e7495ee964c4722",
      "venue": "",
      "journal": null,
      "publicationTypes": null
    },
    {
      "paperId": "ec0da3bcc079808c836e981bea5dcf9a6a673c63",
      "title": "Unbelievable Errors: An Error Theory about All Normative Judgements Bart Streumer Oxford: Oxford University Press, 2017, 256pp, $61 ISBN 9780198785897",
      "authors": [
        {
          "name": "David Kaspar",
          "authorId": "101020260"
        }
      ],
      "year": 2019,
      "abstract": "would be. Moreover, the notion that non-human natural species have intrinsic value is hard to discern in themainstreammedieval theological tradition. But religious traditions should be capable of evolution in the face of present conditions, and Attfield draws an attractive picture of what an expanded religious-based environmental ethic might look like. Finally, a question. Although Attfield has much to say about the origins of current environmental problems and the various practical and political programmes intended to tackle them, he is relatively subdued in his criticism of the governments, corporations, industrial enterprises and individuals (including citizens of the richer countries) who cause them. (The single passing reference in the book to President Trump is the somewhat bland remark that his decision to withdraw the USA from the 2015 Paris Agreement on climate change ‘could prove disastrous’ (114).) While there is no doubting the depth of Attfield’s personal concern about the environment, the question is whether philosophers should display more anger at the appalling damage done to nature, abandoning the style of sweet reasonableness that pervades much of their writing. Ought philosophers to up the ante, setting out the motives for nature’s spoliation more forthrightly and firmly: greed, selfishness, callousness, imprudence and short-termism, laziness, failures of sympathy and imagination, the refusal to recognise disturbing facts that stare us in the face? The philosopher’s medium may be rational argument, but when the chips are really down something of the fighting spirit of the activist may be called for too.",
      "citationCount": 0,
      "doi": "10.1017/S0031819119000202",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/ec0da3bcc079808c836e981bea5dcf9a6a673c63",
      "venue": "Philosophy",
      "journal": {
        "name": "Philosophy",
        "pages": "690 - 694",
        "volume": "94"
      },
      "publicationTypes": null
    },
    {
      "paperId": "cdb2d614e0fc97f308edae6374a15c4153892b6b",
      "title": "If Data Is The New Oil, When Is The Extraction of Value From Data Unjust?",
      "authors": [
        {
          "name": "M. Loi",
          "authorId": "151501082"
        },
        {
          "name": "Paul-Olivier Dehaye",
          "authorId": "2614846"
        }
      ],
      "year": 2017,
      "abstract": null,
      "citationCount": 13,
      "doi": "10.5167/uzh-159945",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/cdb2d614e0fc97f308edae6374a15c4153892b6b",
      "venue": "",
      "journal": {
        "name": "",
        "pages": "137-178",
        "volume": "7"
      },
      "publicationTypes": null
    },
    {
      "paperId": "f6c10b693529501640fc79e30ff4a7de9f6f69ff",
      "title": "The Social Contract Tradition(s): Agreements and Reconstructions",
      "authors": [],
      "year": 2016,
      "abstract": null,
      "citationCount": 0,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/f6c10b693529501640fc79e30ff4a7de9f6f69ff",
      "venue": "",
      "journal": null,
      "publicationTypes": null
    },
    {
      "paperId": "3f4c5440b6fe41cf302ea3f91fad92e7721f2a3b",
      "title": "Political Conceptions in the Violence:The comparison of Marx's and Hannah Arendt's violence views",
      "authors": [
        {
          "name": "Cui Wen-ku",
          "authorId": "1489344301"
        }
      ],
      "year": 2015,
      "abstract": null,
      "citationCount": 0,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/3f4c5440b6fe41cf302ea3f91fad92e7721f2a3b",
      "venue": "",
      "journal": {
        "name": "Journal of Shanxi University",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "e8ec3039559f9c1be0e6f8e901c1b9dd34a46046",
      "title": "Political Jurisprudence or Institutional Normativism? Maintaining the Difference Between Arendt and Fuller",
      "authors": [
        {
          "name": "Michael A. Wilkinson",
          "authorId": "143922461"
        }
      ],
      "year": 2014,
      "abstract": null,
      "citationCount": 0,
      "doi": "10.5553/NJLP/.000020",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/e8ec3039559f9c1be0e6f8e901c1b9dd34a46046",
      "venue": "",
      "journal": {
        "name": "Netherlands journal of legal philosophy",
        "pages": "240-259",
        "volume": "43"
      },
      "publicationTypes": null
    },
    {
      "paperId": "1e3695904f23bab201c205a95bb3a618d9567f74",
      "title": "Confucian democracy as popular sovereignty",
      "authors": [
        {
          "name": "R. Herr",
          "authorId": "48682912"
        }
      ],
      "year": 2019,
      "abstract": "ABSTRACT Is Confucian democracy philosophically justifiable? In recent decades, prominent Confucian theorists have answered this question in the negative, arguing that the political system that is consistent with Confucianism is political meritocracy or elite rule. This position presupposes an antithetical relation between democracy and Confucianism. In order to counter such a position, this article proposes a philosophically justifiable normative conception of Confucian democracy. By carefully examining democracy theories of Jean Jacques Rousseau and Carl Schmitt in the civic humanist republican tradition and Confucian political philosophy in the Mencian tradition, this article demonstrates that the substantive value of democracy as popular sovereignty is a fundamental idea undergirding and safeguarding the ideal Confucian politics.",
      "citationCount": 4,
      "doi": "10.1080/09552367.2019.1653529",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/1e3695904f23bab201c205a95bb3a618d9567f74",
      "venue": "Asian Philosophy",
      "journal": {
        "name": "Asian Philosophy",
        "pages": "201 - 220",
        "volume": "29"
      },
      "publicationTypes": null
    },
    {
      "paperId": "eebe93d3e2f817ae56d56235f3abbc201025292c",
      "title": "Global legal pluralism as fact and norm",
      "authors": [
        {
          "name": "Turkuler Isiksel",
          "authorId": "104506981"
        }
      ],
      "year": 2013,
      "abstract": null,
      "citationCount": 17,
      "doi": "10.1017/S2045381713000130",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/eebe93d3e2f817ae56d56235f3abbc201025292c",
      "venue": "Global Constitutionalism",
      "journal": {
        "name": "Global Constitutionalism",
        "pages": "160 - 195",
        "volume": "2"
      },
      "publicationTypes": null
    },
    {
      "paperId": "8955d147a036d913b0ee486102ef73c8883a2032",
      "title": "Relational Equality, Justice and the Boundary Problem",
      "authors": [
        {
          "name": "Sara Amighetti",
          "authorId": "118162486"
        }
      ],
      "year": 2019,
      "abstract": null,
      "citationCount": 0,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/8955d147a036d913b0ee486102ef73c8883a2032",
      "venue": "",
      "journal": {
        "name": "",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "e3c8874455abaa742ba512681ff08de945bf4c43",
      "title": "МОДЕРНИЗАЦИЯ КЛАССИЧЕСКОГО ОБРАЗА МОРАЛЬНОГО ДОЛЖЕНСТВОВАНИЯ В ЭТИКЕ ДОБРОДЕТЕЛИ А. МАКИНТАЙРА",
      "authors": [
        {
          "name": "Л. Р. Асханова",
          "authorId": "1689047318"
        }
      ],
      "year": 2017,
      "abstract": null,
      "citationCount": 0,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/e3c8874455abaa742ba512681ff08de945bf4c43",
      "venue": "",
      "journal": {
        "name": "",
        "pages": "3-13",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "5d24fd50e52c146a2f08d270a1277ab52f803376",
      "title": "WHAT IS A POLITICAL VALUE? POLITICAL PHILOSOPHY AND FIDELITY TO REALITY",
      "authors": [
        {
          "name": "Matt Sleat",
          "authorId": "117397763"
        }
      ],
      "year": 2016,
      "abstract": "Abstract: This essay seeks to defend the claim that political philosophy ought to be appropriately guided by the phenomenon of politics that it seeks to both offer a theory of and, especially in its normative guise, offer a theory for. It does this primarily through the question of political values. It begins by arguing that for any value to qualify as a value for the political domain, it must be intelligible in relation to the constitutive features of politics as a human activity. It then examines the extent to which the preconditions for the realization of values in practice ought to figure in our considerations as to whether they are values that fit or belong to our social world. We can understand these parts of the essay as responding to two related questions, respectively: (i) Is this a political value at all? — which is to ask, is it a value that is appropriate for the political realm?; and then (ii) Is this a political value for us? The final section responds to the often-made complaint that political philosophy ought not to make any concessions to the actual world of politics as it really is, arguing that attending to the realities of politics, and in particular the constitutive conditions of political activity, gives meaning to the enterprise as the theorization of politics (and not something else). Furthermore those same conditions provide the limits of intelligibility beyond which ideals and values can no longer be, in any meaningful sense, ideals and values for the political sphere.",
      "citationCount": 41,
      "doi": "10.1017/S0265052516000285",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/5d24fd50e52c146a2f08d270a1277ab52f803376",
      "venue": "Social Philosophy and Policy",
      "journal": {
        "name": "Social Philosophy and Policy",
        "pages": "252 - 272",
        "volume": "33"
      },
      "publicationTypes": null
    },
    {
      "paperId": "75467510799783d0a86a3b4dd27f02081b972b0a",
      "title": "Knowledge of Politics: Conceptual Synthesis of Folk Psychology, Political Science and Political Philosophy (About the Idea of ​​Political Conceptology by V.P. Makarenko)",
      "authors": [
        {
          "name": "S.G. Chukin",
          "authorId": "2283354215"
        }
      ],
      "year": 2024,
      "abstract": "The article examines the idea of ​​political conceptology proposed by V.P. Makarenko and implemented by him in relation to current political problems. The author considers it the answer to the question of what knowledge about politics can be, bridging the gap between normative and descriptive knowledge of political phenomena. As a form of political knowledge, conceptology is a synthesis of ordinary views on politics, political philosophy and political science. It significantly weakens restrictions on language and style, allows for value judgments, a mixture of scientific and journalistic approaches, and the use of artistic images, which allows for maximum individualization of the objects under consideration. Content flexibility of concepts (as V.P. Makarenko understands and uses them) makes them a valuable methodological tool in social cognition.",
      "citationCount": 0,
      "doi": "10.18522/2949-0707.2024.2.3845",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/75467510799783d0a86a3b4dd27f02081b972b0a",
      "venue": "Политическая концептология: журнал метадисциплинарных исследований",
      "journal": {
        "name": "Политическая концептология: журнал метадисциплинарных исследований"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "e5001b85af276c3cee4babd93747c5c2a0630d14",
      "title": "Fairness as Equality of Opportunity: Normative Guidance from Political Philosophy",
      "authors": [
        {
          "name": "Falaah Arif Khan",
          "authorId": "1410017982"
        },
        {
          "name": "Eleni Manis",
          "authorId": "119219282"
        },
        {
          "name": "J. Stoyanovich",
          "authorId": "1682824"
        }
      ],
      "year": 2021,
      "abstract": "Recent interest in codifying fairness in Automated Decision Systems (ADS) has resulted in a wide range of formulations of what it means for an algorithmic system to be fair. Most of these propositions are inspired by, but inadequately grounded in, political philosophy scholarship. This paper aims to correct that deficit. We introduce a taxonomy of fairness ideals using doctrines of Equality of Opportunity (EOP) from political philosophy, clarifying their conceptions in philosophy and the proposed codification in fair machine learning. We arrange these fairness ideals onto an EOP spectrum, which serves as a useful frame to guide the design of a fair ADS in a given context. \nWe use our fairness-as-EOP framework to re-interpret the impossibility results from a philosophical perspective, as the in-compatibility between different value systems, and demonstrate the utility of the framework with several real-world and hypothetical examples. Through our EOP-framework we hope to answer what it means for an ADS to be fair from a moral and political philosophy standpoint, and to pave the way for similar scholarship from ethics and legal experts.",
      "citationCount": 10,
      "doi": null,
      "arxivId": "2106.08259",
      "url": "https://www.semanticscholar.org/paper/e5001b85af276c3cee4babd93747c5c2a0630d14",
      "venue": "arXiv.org",
      "journal": {
        "name": "ArXiv",
        "volume": "abs/2106.08259"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "b475ba219d090df2e18c72642364091aa9c0c5df",
      "title": "The varieties of idealization and the politics of economic growth: a case study on modality and the methodology of normative political philosophy",
      "authors": [
        {
          "name": "D. Plunkett",
          "authorId": "34646264"
        }
      ],
      "year": 2021,
      "abstract": "ABSTRACT Are societies required to pursue continual economic growth as a matter of justice? In “The Value of Economic Growth”, Julie Rose considers three arguments in favor of the need for continual economic growth, each of which revolves around the instrumental value of economic growth for promoting an important good that is needed for a just society. In each case, Rose argues that there are mechanisms other than economic growth that could allow a society to deliver the relevant goods, and thus meet the demands of justice with respect to those goods. I raise a set of issues for Rose’s argument that put pressure on the normative significance of her discussion. At the heart of these issues are ones about which possibilities Rose considers and which idealizations she makes. These issues tie into more general questions about the aims and methodology of normative work in social/political philosophy. Thus, in addition to being a contribution to the debate over the politics of economic growth, this paper can be understood partly as a case study in how reflection on these kinds of issues – ones about modality, idealization, and methodology – can matter to how we evaluate specific arguments in social/political philosophy.",
      "citationCount": 3,
      "doi": "10.1080/0020174X.2021.1977176",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/b475ba219d090df2e18c72642364091aa9c0c5df",
      "venue": "Inquiry",
      "journal": {
        "name": "Inquiry",
        "pages": "1908 - 1946",
        "volume": "67"
      },
      "publicationTypes": null
    },
    {
      "paperId": "7f750f9d7d2de63e1f21b94ceec38dc8f17ded4d",
      "title": "Toward a Tradition of Ghanaian Political Philosophy",
      "authors": [
        {
          "name": "M. Ajei",
          "authorId": "103319917"
        }
      ],
      "year": 2020,
      "abstract": "This chapter discusses the contributions of Kwame Nkrumah, Kwasi Wiredu, William. E. Abraham, and Kwame Gyekye to the corpus of African philosophy. It elaborates their normative perspectives on three themes: the relevance of tradition to modernity, the appropriate form of democracy as means of legitimating political power in Africa, and the relative status of person and community; it also reflects on the significance of these themes in postcolonial African social and political philosophical discourse. The chapter then points out points of convergence and divergence among these individuals and how they relate with Western philosophical perspectives and argues that their work configures a coherent discourse that justifies joining them in a tradition of Ghanaian political philosophy.",
      "citationCount": 0,
      "doi": "10.1093/oxfordhb/9780190253752.013.4",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/7f750f9d7d2de63e1f21b94ceec38dc8f17ded4d",
      "venue": "",
      "journal": {
        "name": "",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "6a4511e98ea03ecf66d311ace11ec12195adbf50",
      "title": "Does Normative Behaviourism Offer an Alternative Methodology in Political Theory?",
      "authors": [
        {
          "name": "Eva Erman",
          "authorId": "115756263"
        },
        {
          "name": "Niklas Möller",
          "authorId": "145497600"
        }
      ],
      "year": 2023,
      "abstract": "A central distinction for Jonathan Floyd is that between the traditional method of pursuing political theory conducted by mainstream theorists, which he calls ‘mentalism’, and his suggested method, so-called ‘normative behaviourism’. While the former relies on patterns of thought (e.g. intuitions, value commitments, principles or considered judgements) to justify normative theories, the latter instead relies on patterns of behaviour. Floyd argues that normative behaviourism offers an alternative methodology to mainstream mentalism, a new – and better – way of doing political philosophy. Our aim in this article is to reject this claim: normative behaviourism does not offer an alternative methodology in political theory. First, we show that normative behaviourism, contrary to Floyd’s claim, is as dependent on value premises as mainstream, ‘mentalist’ political theory. Second, we illustrate the structural similarities between normative behaviourism and mainstream political theory from a methodological standpoint by comparing the former with an influential normative theory, namely, utilitarianism.",
      "citationCount": 9,
      "doi": "10.1177/14789299231151803",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/6a4511e98ea03ecf66d311ace11ec12195adbf50",
      "venue": "Political Studies Review",
      "journal": {
        "name": "Political Studies Review",
        "pages": "454 - 461",
        "volume": "21"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "e75180e457ce1643541a4d0c5f61d5fb095c818b",
      "title": "Relying on Intuitions in Moral and Political Philosophy: A Practice with No Support",
      "authors": [
        {
          "name": "Jens Jørund Tyssedal",
          "authorId": "147168291"
        }
      ],
      "year": 2025,
      "abstract": null,
      "citationCount": 0,
      "doi": "10.1007/s10892-025-09535-7",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/e75180e457ce1643541a4d0c5f61d5fb095c818b",
      "venue": "Journal of Ethics",
      "journal": {
        "name": "The Journal of Ethics",
        "pages": "863 - 890",
        "volume": "29"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "cf8e848d74465a6e71d3bf6acf1d81bd0061abb2",
      "title": "Formation of digital political philosophy in modern society",
      "authors": [
        {
          "name": "N. Koz'yakova",
          "authorId": "2331998530"
        }
      ],
      "year": 2024,
      "abstract": "Modern digital political philosophy occupies a special place among socio-humanitarianism in the chosen aspect of the study, as it is a new teaching and research area. This is due to the fact that its field includes the study of the creation and changes in the rules that regulate all spheres of social life, including theoretical and methodological support and practical everyday life. In the XXI century there has been an aggravation of contradictions between the intensive transformations taking place and the measured course of life. On the one hand, these are the values of changing the future, and on the other hand, the values of preserving the past, i.e., tradition and innovation. Modern man has enormous opportunities both to change the world and himself. The aim of the article is to explore the scientific-theoretical model of contemporary digital political philosophy by means of systematisation and analysis of the main approaches that reflect contemporary political-philosophical debates. The main method of research is historical and cultural analysis of contemporary problems in the field of artificial intelligence facing political philosophy. The viewpoint that digital political methodology for the science of the future will be of predominant importance is gradually being established in the world. The theoretical relevance of the study lies in the fact that it offers an example of digital methodological analysis, which can become a toolkit, with its help it is possible to develop in the future an interdisciplinary approach in the management of modern political problems in the field of artificial intelligence facing society. The practical relevance is that this study can be used in the educational process at the university level, as digital political philosophy will be able to supplement the academic level of students with a general understanding of what digitalisation in politics is and in what areas its application is necessary. It is concluded that digital political philosophy is the basis for the future revolution of neural networks, basic political science problems are performed by artificial intelligence much faster and better than real political actors, axiological agenda as well as multimedia content are also created unaided.",
      "citationCount": 0,
      "doi": "10.12737/2587-6295-2024-8-3-76-85",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/cf8e848d74465a6e71d3bf6acf1d81bd0061abb2",
      "venue": "Journal of Political Research",
      "journal": {
        "name": "Journal of Political Research"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "719938cae25f5a09b19205509647c275b8305021",
      "title": "Introduction to Value-Relevant and Normative Tradition in Philosophy of the Social Sciences",
      "authors": [
        {
          "name": "Ruhi Can Alkın",
          "authorId": "2092239406"
        },
        {
          "name": "Ramazan Yelken",
          "authorId": "113192139"
        }
      ],
      "year": 2014,
      "abstract": null,
      "citationCount": 1,
      "doi": "10.18491/BIJOP.96819",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/719938cae25f5a09b19205509647c275b8305021",
      "venue": "",
      "journal": {
        "name": "Beytulhikme : An International Journal of Philosophy",
        "pages": "15-27",
        "volume": "4"
      },
      "publicationTypes": null
    },
    {
      "paperId": "42ebc33655a37bfeb459528c979194ee81283690",
      "title": "The open society and the future of political philosophy",
      "authors": [
        {
          "name": "J. P. Messina",
          "authorId": "2303784325"
        }
      ],
      "year": 2024,
      "abstract": "\n This paper defends traditional political philosophy against the challenges Gaus leverages against it in The Open Society and Its Complexities. Granting Gaus that consensus on the principles of political philosophy is not forthcoming and that complexity undermines many of our most ambitious reform efforts, the paper argues that much work remains for political philosophy as it has been practiced for centuries. This is for three reasons. First, Gaus's own defense of the open society requires resources from the very traditions that he tends to dismiss. Secondly, the kinds of reform Gaus encourages us to focus on in light of complexity presuppose answers to philosophical questions, answers that philosophers have long attempted to provide. Thirdly, not all politically salient philosophical questions are aimed at action guidance. Despite the value in Gaus's analysis, I conclude that political philosophy's future will look, at least in part, like its storied past.",
      "citationCount": 1,
      "doi": "10.1093/pq/pqae043",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/42ebc33655a37bfeb459528c979194ee81283690",
      "venue": "The Philosophical Quarterly",
      "journal": {
        "name": "The Philosophical Quarterly"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "78f57b5faa7bf44ccff954781351b77be45c4043",
      "title": "Reply to Discussion of Origins of Moral-Political Philosophy in Early China: Contestation of Humaneness, Justice, and Personal Freedom",
      "authors": [
        {
          "name": "Tao Jiang",
          "authorId": "143872550"
        }
      ],
      "year": 2023,
      "abstract": null,
      "citationCount": 3,
      "doi": "10.1353/pew.2023.a898081",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/78f57b5faa7bf44ccff954781351b77be45c4043",
      "venue": "",
      "journal": {
        "name": "Philosophy East and West",
        "pages": "475 - 485",
        "volume": "73"
      },
      "publicationTypes": null
    },
    {
      "paperId": "2a2192f821380e176a8d6a1a8c6cdb5b72ab215e",
      "title": "Johann Arnason’s unanswered question: To what end does one combine historical-comparative sociology with social and political philosophy?",
      "authors": [
        {
          "name": "P. Wagner",
          "authorId": "49432218"
        }
      ],
      "year": 2023,
      "abstract": "Johann Arnason’s work combines the most erudite historical-comparative sociology, discussing highly knowledgeably enormous stretches of world-history, with the most subtle social and political philosophy, drawing creatively on the traditions of hermeneutics and phenomenology. Invariably, his works introduce more nuance and sophistication into the analysis of even very well studied socio-historical phenomena. At the same time, he addresses such major phenomena in terms of modernity, democracy and capitalism, agreeing that there often – maybe always – is a combination of empirical, conceptual and normative issues at work when analysing human history. Nevertheless, readers of his work may at the same time be impressed by the nuance and sophistication and at a loss with regard to what such further refinement of our socio-historical knowledge entails in terms of understanding our own time in its historical context. Searching through Johann Arnason’s work, this article identifies unexplored questions in the conceptual and historical relation between civilization, modernity, and equality and tries to understand why they have been left open.",
      "citationCount": 1,
      "doi": "10.1177/07255136231154280",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/2a2192f821380e176a8d6a1a8c6cdb5b72ab215e",
      "venue": "Thesis Eleven",
      "journal": {
        "name": "Thesis Eleven",
        "pages": "3 - 20",
        "volume": "174"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "abaf639af541cb31914e4f07bb90f36896089616",
      "title": "Oakeshott on Practice, Normative Thought and Political Philosophy",
      "authors": [
        {
          "name": "D. Orsi",
          "authorId": "47902323"
        }
      ],
      "year": 2015,
      "abstract": null,
      "citationCount": 4,
      "doi": "10.1080/09608788.2015.1007117",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/abaf639af541cb31914e4f07bb90f36896089616",
      "venue": "",
      "journal": {
        "name": "British Journal for the History of Philosophy",
        "pages": "545 - 568",
        "volume": "23"
      },
      "publicationTypes": null
    },
    {
      "paperId": "343d5c908f6381ccbfd741af0884a117c63d7c19",
      "title": "Value-Free yet Policy-Relevant? The Normative Views of Climate Scientists and Their Bearing on Philosophy",
      "authors": [
        {
          "name": "Torbjørn Gundersen",
          "authorId": "46198451"
        }
      ],
      "year": 2020,
      "abstract": "This article contributes to the philosophical debate on values in science by exploring how scientists themselves understand the proper role of moral, political, and social values in expert practice. I present findings from interviews with climate scientists who have participated as authors in the Intergovernmental Panel on Climate Change (IPCC). The climate scientists subscribe to the value-free ideal as a regulative ideal that applies both to the provision of knowledge to policymakers and how they engage with political issues in the public sphere. Yet their views on the moral responsibility of scientists and the aim of providing policy-relevant output challenge the value-free ideal. The article suggests ways in which their views can be relevant to the philosophical discussion.",
      "citationCount": 14,
      "doi": "10.1162/posc_a_00334",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/343d5c908f6381ccbfd741af0884a117c63d7c19",
      "venue": "Perspectives in Science",
      "journal": {
        "name": "Perspectives on Science",
        "pages": "89-118",
        "volume": "28"
      },
      "publicationTypes": null
    },
    {
      "paperId": "3c2bd0004e8efe830d46ccd1e8fe72efeace28b5",
      "title": "THE MANUSMRITI AS A SOURCE OF POLITICAL PHILOSOPHY AND LEGAL CULTURE IN INDIA",
      "authors": [
        {
          "name": "I. Petlenko",
          "authorId": "2022369139"
        }
      ],
      "year": 2025,
      "abstract": "B a c k g r ou nd . The article examines the significance of the Manusmriti in the context of modern political and social discourse. The article rationale is underpinned by intense coexistence of traditional Hindu ideas about the social order and modern constitutional principles of equality, secularism and human rights.\n\nMet hod s. The study is based on an interdisciplinary approach that combines historical-legal, textual, comparative, and general scientific methods. This allows for a comprehensive analysis of the development of Indian legal thought within its historical, religious, and political contexts, taking into account both normative sources and political rhetoric.\n\nRe su lt s . The study is novel in that it combines historical and legal analysis of the Manusmriti with the political philosophy of modern India, focusing on the narrative of authorities and its symbolic sources. It is the first systematic study in the Ukrainian scientific context on how the image of the ruler as a \"servant of the Dharma\" (and its transformation into a concept pradhan sevak) fits into the democratic discourse. The article also analyses the use of ancient Indian legal heritage in the political legitimation of modern decisions, while pointing out the critical narrative of caste and gender inequality that is formed in response.\n\nC onc lu si on s . The conclusions emphasize the dual status of the Manusmriti: on the one hand, as a source of historical legal tradition and, on the other – as a text that is criticized for gender and caste discrimination. The article proves that despite the official distancing from the ancient legal codes, the cultural influence of the Manusmriti continues to shape political rhetoric and social perceptions in India of the XXI century.",
      "citationCount": 0,
      "doi": "10.17721/2523-4064.2025/12-16/23",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/3c2bd0004e8efe830d46ccd1e8fe72efeace28b5",
      "venue": "Bulletin of Taras Shevchenko National University of Kyiv Philosophy",
      "journal": {
        "name": "Bulletin of Taras Shevchenko National University of Kyiv. Philosophy"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "c45832e6987439bd2dda20182e0945194649be97",
      "title": "Reinterpreting Justice in Al-Farabi’s Political Philosophy: Relevance to Contemporary Islamic Human Rights Thought",
      "authors": [
        {
          "name": "Syukri",
          "authorId": "2369358815"
        },
        {
          "name": "Adenan",
          "authorId": "2369496748"
        },
        {
          "name": "Syahminan",
          "authorId": "2369489638"
        }
      ],
      "year": 2025,
      "abstract": "This study critically explores Al-Farabi’s conception of justice in his political philosophy and evaluates its normative potential and conceptual limitations in the context of contemporary human rights discourse. The central research question investigates the extent to which Al-Farabi’s vision of the al-Madina al-Fadila (Virtuous City) can serve as a philosophical framework for bridging classical Islamic values with modern human rights principles. Rather than assuming full compatibility, the study interrogates the tension between Al-Farabi’s virtue-based, hierarchical model of justice and contemporary demands for equality, intersectional rights, and democratic participation. Employing a qualitative, library-based method and a philosophical hermeneutic approach, the research analyzes key texts—particularly Ara’ Ahl al-Madina al-Fadila and Tahsil al-Sa‘ada—alongside contemporary literature on Islamic legal reform and human rights theory. The findings demonstrate that Al-Farabi’s emphasis on rational leadership, ethical governance, and communal well-being—while historically bounded—offers interpretive value for rethinking legal reform through maqasid al-shari‘ah and contextual ijtihad. However, the study also underscores the epistemological challenges of adapting metaphysical frameworks to rights-based paradigms. It concludes that Al-Farabi’s thought should inspire—not dictate—Islamic legal innovation by contributing ethical and rational principles that remain critically grounded within both Islamic tradition and contemporary socio-legal realities. Academically, this research contributes to the growing body of interdisciplinary scholarship at the intersection of Islamic philosophy, political theory, and human rights, offering a nuanced reappraisal of classical Islamic thought as a dynamic resource for ethical-legal reform in pluralistic modern societies.",
      "citationCount": 0,
      "doi": "10.32332/milrev.v4i1.10466",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/c45832e6987439bd2dda20182e0945194649be97",
      "venue": "MILRev: Metro Islamic Law Review",
      "journal": {
        "name": "MILRev: Metro Islamic Law Review"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "553e38e9b6af6c4de911682a60cfe120e6f49f82",
      "title": "INTERDISCIPLINARY APPROACHES IN GENERAL THEORY OF LAW: BETWEEN SOCIOLOGY, POLITICAL PHILOSOPHY AND LINGUISTICS",
      "authors": [
        {
          "name": "V. Pekarchuk",
          "authorId": "116097710"
        },
        {
          "name": "Y. Petrovska",
          "authorId": "2170270353"
        },
        {
          "name": "A. Popruzhna",
          "authorId": "150917325"
        }
      ],
      "year": 2025,
      "abstract": "The relevance of the study is stipulated by the urgency to update the theoretical and legal paradigm in the aspect of an open, pluralistic and reflexive model of law integrating the achievements of related sciences into its arsenal and responding to the challenges of the modern world.\n\nThe purpose of the article is to outline interdisciplinary approaches in the general theory of law – sociological, philosophical and linguistic – as promising directions for the development of the methodology of legal phenomena.\n\nThe article explores the interdisciplinary dimension of the general theory of law in the context of the modern transformation of legal understanding. Attention is focused on the fact that openness to other scientific subjects is not only a consequence of methodological search, but also a reaction to the crisis of the normative paradigm. Interdisciplinarity is considered as an ontologically justified necessity to understand law not only as a system of norms, but as a complex social, political and linguistic phenomenon.\n\nThe potential of the sociology of law as a tool for identifying the actual operation of norms, analyzing the gap between law and social practice, studying informal regulators and institutional interaction is revealed. The sociological perspective allows us to study law as an element of social order, which does not simply exist in the form of formal norms, but is implemented in the behavior of society members, and in institutional interaction.\n\nIt is noted that political philosophy allows us to critically assess legal reality, comprehend the value principles of normative decisions, and also determine the ideological guidelines that underlie legal regulation. Political philosophy allows us to comprehend how different ideas about freedom, equality, authority and the common good shape different models of the legal system.\n\nSpecial attention is paid to the linguistic approach to law, within which law is considered as a linguistic practice that forms and structures legal reality. Taken together, these directions demonstrate the urgency to go beyond normative positivism and expand the research framework of the general theory of law by integrating it into a broader humanitarian context.\n\nKey words: linguistic approach, methodology of law, normativism, law, legal reality, legal understanding, political philosophy, sociology of law.",
      "citationCount": 0,
      "doi": "10.32755/sjlaw.2025.02.087",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/553e38e9b6af6c4de911682a60cfe120e6f49f82",
      "venue": "Scientific Herald of Sivershchyna. Series: Law",
      "journal": {
        "name": "Scientific Herald of Sivershchyna. Series: Law"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "5a780cd69550947ae849625e54807dd9b44673a7",
      "title": "Global standards and the philosophy of consumption: Toward a consumer‐driven governance of global value chains",
      "authors": [
        {
          "name": "Guli-Sanam Karimova",
          "authorId": "134013312"
        },
        {
          "name": "L. Heidbrink",
          "authorId": "2076878167"
        },
        {
          "name": "Johannes Brinkmann",
          "authorId": "2276926072"
        },
        {
          "name": "Stephen A. LeMay",
          "authorId": "2244685762"
        }
      ],
      "year": 2023,
      "abstract": "This study delves into the significant ethical criteria in the context of global standards. It addresses the moral wrongdoings and adverse side effects associated with global value chains as discussed in the business ethics literature. The methodology involves theoretical application and synthesis. The study employs ethical principles from deontology, consequentialism, and political cosmopolitanism to establish normative criteria such as “injustice and harm to others” and “bad outcomes.” It further investigates how these criteria should influence consumers' decisions, actions, and responsibilities. These criteria are then used to examine the moral wrongdoings and negative effects mentioned in global standards. The study explores how global standards implicitly express consumers' roles in governing global value chains. It scrutinizes consumers' actions and decisions by applying ethical frameworks to global standards. The study outlines consumers' individual and political responsibilities in achieving the goals of global standards. The research findings have implications for governments, consumers, and organizations in practicing shared responsibility. The aim of this research is to provide normative guidance for responsible actions.",
      "citationCount": 3,
      "doi": "10.1111/beer.12648",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/5a780cd69550947ae849625e54807dd9b44673a7",
      "venue": "Business Ethics, the Environment &amp; Responsibility",
      "journal": {
        "name": "Business Ethics, the Environment &amp; Responsibility"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "82a5a55694ab9802b75ca38b262107394c4c38b4",
      "title": "THE NORMATIVE FOUNDATIONS OF ( SOCIAL ) INSURANCE : TECHNOLOGY , SOCIAL PRACTICE AND POLITICAL PHILOSOPHY",
      "authors": [
        {
          "name": "Landes",
          "authorId": "50519242"
        }
      ],
      "year": 2017,
      "abstract": null,
      "citationCount": 3,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/82a5a55694ab9802b75ca38b262107394c4c38b4",
      "venue": "",
      "journal": null,
      "publicationTypes": null
    },
    {
      "paperId": "3cec25f38f8a1f2e2f7a79173a2dc5ca9024fb6e",
      "title": "Norberto Bobbio’s political philosophy, between theory and ideology",
      "authors": [
        {
          "name": "Valentina Pazé",
          "authorId": "2075939857"
        },
        {
          "name": "Massimo Cuono",
          "authorId": "2097951082"
        }
      ],
      "year": 2022,
      "abstract": "ABSTRACT The article explores Norberto Bobbio’s thought regarding the complex relationship between theory and ideology, and the possible mutual influences between them. The essay first clarifies what Bobbio means by ‘theory’ and what connection he establishes between theory and political philosophy. The first section reconstructs Bobbio’s distinction between four ways of conceiving political philosophy, and his preference for the formal value-free approach of what he defines as a ‘general theory of politics’. The second section focuses on whether a general theory of politics, seeking to clarify the basic concepts of political language and provide purely descriptive definitions, is in fact possible. The third section deals with this same question starting from a debate between Bobbio, Passerin d’Entreves and Scarpelli sparked in 1954 by Felix Oppenheim’s book Dimensions of Freedom. Likewise, Bobbio’s last course in political philosophy on the topic of ‘revolution’ offers insights into his ‘empirical-analytical’ method, in which conceptual analysis is deeply related to the observation of reality and the study of history (fourth section). To conclude, the last paragraph returns to the complex relationship between theory and ideology in Bobbio’s thought, by highlighting elements of continuity and discontinuity, with the tradition of analytical philosophy.",
      "citationCount": 0,
      "doi": "10.1080/13569317.2022.2129219",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/3cec25f38f8a1f2e2f7a79173a2dc5ca9024fb6e",
      "venue": "Journal of Political Ideologies",
      "journal": {
        "name": "Journal of Political Ideologies",
        "pages": "313 - 329",
        "volume": "27"
      },
      "publicationTypes": null
    },
    {
      "paperId": "a6fc65e7e216b0f9dec283397e59317ad9fe0355",
      "title": "Science Fiction and Political Philosophy",
      "authors": [
        {
          "name": "Timothy McCranor",
          "authorId": "148219845"
        },
        {
          "name": "Steven Michels",
          "authorId": "2363221827"
        }
      ],
      "year": 2020,
      "abstract": "Sometimes called the “literature of ideas,” science fiction is a natural medium for normative political philosophy. Science fiction’s focus on technology, space and time travel, non-human lifeforms, and parallel universes cannot help but invoke the perennial questions of political life, including the nature of a just social order and who should rule; freedom, free will, and autonomy; and the advantages and disadvantages of progress. Rather than offering a reading of a work inspired by a particular thinker or tradition, each chapter presents a careful reading of a classic or contemporary work in the genre (a novel, short story, film, or television series) to illustrate and explore the themes and concepts of political philosophy.",
      "citationCount": 0,
      "doi": "10.5040/9781978730120",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/a6fc65e7e216b0f9dec283397e59317ad9fe0355",
      "venue": "",
      "journal": null,
      "publicationTypes": [
        "Book"
      ]
    },
    {
      "paperId": "dec0355eead7b78916eecc5a1790cd5c1563322d",
      "title": "Kant’s trust in the political value of labour and global mobility. A non-ideal account of cosmopolitan normativity",
      "authors": [
        {
          "name": "Madrid Sánchez",
          "authorId": "2222352513"
        }
      ],
      "year": 2023,
      "abstract": "This account first endorses the normative strength of Kant?s cosmopolitan\n right, even if it is not lacking in non-ideal traits, and then takes issue\n with Flikschuh?s well-known interpretation of what she labels Kant?s\n ?dilemma of sovereignty?. Second, I tease out some of the non-ideal features\n underpinning Kant?s cosmopolitanism with the help of the Kantian theory of\n labour, which in turn helps reveal the material conditions behind the\n qualifications of the subject who in Kant?s view is able to move through the\n world. Finally, I draw some conclusions about the advantages of a non-ideal\n approach for upgrading the normative value of global mobility in Kant?s\n juridical philosophy.",
      "citationCount": 0,
      "doi": "10.2298/fid2302305s",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/dec0355eead7b78916eecc5a1790cd5c1563322d",
      "venue": "Filozofija i Društvo",
      "journal": {
        "name": "Filozofija i drustvo"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "fe98300e372279eef0eb121b1659d661bf796b33",
      "title": "Philosophy and Intercultural Communication: The Phenomenon of a Human Being in the Confucian Tradition",
      "authors": [
        {
          "name": "T. Danylova",
          "authorId": "2095871599"
        }
      ],
      "year": 2023,
      "abstract": "Purpose. This paper aims to investigate the phenomenon of a human being within the Confucian tradition as well as its interpretations from intercultural perspective. Theoretical basis. One of the ways to understand the deepest level of the intercultural dialogue is to reveal the interpretations of a human being in philosophical traditions, since they refer to the formation of personality and identity within a given culture including interpersonal, intergroup, and intercultural relations. Humanism based on the unity of Human and Heaven runs like a red thread through the philosophical teachings of Confucius, Mencius, Xunzi, Zhu Xi, Wang Yangming defining the ideas of human nature, his/her duties, his/her place and roles in society that shaped the Chinese mentality. Originality. Quite often, Chinese concepts (for example, human dignity beyond the ideas of democracy and mass political participation, guanxi, mianzi) are incomprehensible to the representatives of the Western civilization, which leads to the challenges in intercultural communication. The interpretation of these ideas in the context of Confucianism allows to understand them from the perspective of Others and expand the set of patterns of cultural perception. This ultimately leads to the awareness that there are many social, political, cultural realities, which we perceive through the lens of our own concepts and attitudes. The participants of an intercultural dialogue realize that each of them has a unique experience, own way of posing a problem and resolving it, and no one is better or worse. Conclusions. Confucian philosophy shaped the worldview of Chinese people, defined values, goals, meanings, attitudes, communication models, which affected all spheres of Chinese life and culture. The study of the philosophical heritage of the great Chinese civilization enhances the cultural competence of the intercultural communicators and expands the field of dialogue to the level of global communication.",
      "citationCount": 0,
      "doi": "10.15802/ampr.v0i23.283637",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/fe98300e372279eef0eb121b1659d661bf796b33",
      "venue": "Anthropological Measurements of Philosophical Research",
      "journal": {
        "name": "Anthropological Measurements of Philosophical Research"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "6468e38b215d18a81abe2ea49370c81fac782b1f",
      "title": "Fundamental Rights and the EU Internal Market: Just how Fundamental are the EU Treaty Freedoms? A Normative Enquiry Based on John Rawls’ Political Philosophy",
      "authors": [
        {
          "name": "N. D. Boer",
          "authorId": "66112643"
        }
      ],
      "year": 2013,
      "abstract": "This article assesses whether the EU Treaty freedoms - the free movement of goods, persons, services and capital - should be considered as fundamental rights which are hierarchically equal to other fundamental rights. It uses the political philosophy of John Rawls to assess why we should attach priority to certain rights and which rights should therefore be considered fundamental rights. On this basis it is argued that we should recognise two main types of fundamental rights, namely basic rights and liberties associated with Rawls' first principle of justice and the rights associated with the principle of fair equality of opportunity. This is followed by an analysis of the interpretation that the European Court of Justice (CJEU) gives to the Treaty freedoms. On the basis of the normative framework, it is argued that the Treaty freedoms can be seen as fundamental rights insofar as they embody the value of equality of opportunity. Nonetheless, the CJEU increasingly seems to rely on a broader market access approach rather than an equal treatment approach in interpreting the Treaty freedoms. It is argued that where equal treatment is not at stake, the Treaty freedoms should not be seen as fundamental rights. Therefore, in cases where there is a conflict between a fundamental right and a Treaty freedom the CJEU should carefully distinguish between these two different interpretations of the Treaty freedoms. In cases where it is merely market access that is at stake, the CJEU should regard the protection of fundamental rights as more important, and be very careful in allowing a restriction of fundamental rights in order to protect the exercise of the Treaty freedom. On the other hand, in cases where the Treaty freedoms can be seen as protecting equality of opportunity and where they conflict with other fundamental rights, the Court is justified in construing the conflict as a right-right conflict in which a fair balance has to be sought.",
      "citationCount": 6,
      "doi": "10.18352/ULR.219",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/6468e38b215d18a81abe2ea49370c81fac782b1f",
      "venue": "",
      "journal": {
        "name": "Utrecht law review",
        "pages": "148-168",
        "volume": "9"
      },
      "publicationTypes": null
    },
    {
      "paperId": "6fd62de8c5de72437111599762df6f4beb970dcc",
      "title": "A philosophy of the theory of “acts of citizenship” woven into the fabric of a political anthropology of citizenship",
      "authors": [
        {
          "name": "Martin Roy",
          "authorId": "1796559"
        },
        {
          "name": "C. Neveu",
          "authorId": "2074634220"
        }
      ],
      "year": 2023,
      "abstract": "ABSTRACT The significance of Engin F. Isin’s theory of ‘acts of citizenship’ lies not only in its popularity amongst social scientists but, principally, in its engagement with a political anthropology of citizenship. In a collaborative spirit and committed to a political anthropology of citizenship, we critically engage with Isin’s theory, demonstrating how it builds on various normative difficulties that should be acknowledged by anyone using it as methodology, especially for those engaged in anthropologizing the field of citizenship studies. Our examination begins by showing how the theory draws from theoretical works belonging to the causalist school of the philosophy of action, which allows us to untangle the tacit didascaly through which Isin values the introduction of the concept of ‘act’ into our language(s) of citizenship. By tackling its underlying normative bias, we make clear the fundamental element of Isin’s argument: the refusal to reduce citizenship to mere unpurposive processes. Yet, it is unclear, we argue, how citizenship can effectively be captured through purposive processes by investigating ‘acts of citizenship’. Finally, we demonstrate how anthropology allows us to critically address the reductionism at play in the normative distinction between ‘active’ and ‘activist’ citizenship, constituting the very core of Isin’s theory.",
      "citationCount": 5,
      "doi": "10.1080/13621025.2023.2171254",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/6fd62de8c5de72437111599762df6f4beb970dcc",
      "venue": "Citizenship Studies",
      "journal": {
        "name": "Citizenship Studies",
        "pages": "385 - 405",
        "volume": "27"
      },
      "publicationTypes": null
    },
    {
      "paperId": "90b33a87a85727d3032fbb3c3830f38079cfc95e",
      "title": "Fundamental Rights and the EU Internal Market: Just How Fundamental are the EU Treaty Freedoms? A Normative Enquiry Based on John Rawls’ Political Philosophy",
      "authors": [
        {
          "name": "Nik de Boer",
          "authorId": "2366466414"
        }
      ],
      "year": 2013,
      "abstract": null,
      "citationCount": 0,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/90b33a87a85727d3032fbb3c3830f38079cfc95e",
      "venue": "",
      "journal": {
        "name": "LSN: Treaties (Topic)"
      },
      "publicationTypes": null
    },
    {
      "paperId": "1748ce074f37b263d633e976cd3ec00477e3fc97",
      "title": "The Declamatory Tradition of Normative Inquiry: Towards an Aesthetic History of Legal and Political Thought",
      "authors": [
        {
          "name": "M. Del Mar",
          "authorId": "31290883"
        }
      ],
      "year": 2019,
      "abstract": null,
      "citationCount": 0,
      "doi": "10.1007/s42439-019-00012-y",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/1748ce074f37b263d633e976cd3ec00477e3fc97",
      "venue": "Jus Cogens",
      "journal": {
        "name": "Jus Cogens",
        "pages": "151 - 171",
        "volume": "1"
      },
      "publicationTypes": null
    },
    {
      "paperId": "b57ae4c9b4cf41356508906b9d0ff04b939b3c7f",
      "title": "The normative stakes of Foucault's engagement with neoliberalism: Seduction, invention, and normalization",
      "authors": [
        {
          "name": "Leonard D’Cruz",
          "authorId": "2291924797"
        }
      ],
      "year": 2024,
      "abstract": "This article critically examines Foucault's engagement with neoliberalism. While Foucault declares that his analysis of this tradition is primarily descriptive, I argue that he continually questions whether neoliberalism is less disciplinary and biopolitically normalizing than traditional forms of liberalism. Although Foucault does not endorse neoliberalism as a prescriptive solution to these problems of normalization, his interest in such problems is consistent with his tendency to privilege freedom over other values like justice and equality. This helps to clarify the normative stakes of Foucault's analysis while rejecting any suggestion that he was invested in neoliberalism as a comprehensive political program. Indeed, I repudiate the claim that he was “seduced” by neoliberalism. Furthermore, I reject the idea that he was trying to “invent” a distinctively socialist governmentality through the prism of neoliberalism. Finally, I consider the broader significance of this discussion for normative political philosophy.",
      "citationCount": 0,
      "doi": "10.1111/sjp.12589",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/b57ae4c9b4cf41356508906b9d0ff04b939b3c7f",
      "venue": "The Southern Journal of Philosophy",
      "journal": {
        "name": "The Southern Journal of Philosophy"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    }
  ],
  "count": 40,
  "errors": []
}
