[s2_search.py] Searching Semantic Scholar: 'constitutional tradition democracy' (year=2018-2025) (field=Philosophy), limit=30
[s2_search.py] Retrieved 30/30 papers...
[s2_search.py] Cached results (cache key: s2_56d6f506ab65db82)
{
  "status": "success",
  "source": "semantic_scholar",
  "query": "constitutional tradition democracy",
  "results": [
    {
      "paperId": "a1cbb58d4b8a31f100bcd0e92e838452eae4ae09",
      "title": "Is There an Indonesian Constitutional Democracy? Welcoming the War on the Tradition of Meaning",
      "authors": [
        {
          "name": "Pranoto Iskandar",
          "authorId": "2310846471"
        }
      ],
      "year": 2024,
      "abstract": null,
      "citationCount": 1,
      "doi": "10.2139/ssrn.4949436",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/a1cbb58d4b8a31f100bcd0e92e838452eae4ae09",
      "venue": "Social Science Research Network",
      "journal": {
        "name": "SSRN Electronic Journal"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "4927dcf79874db577e150a5e90fb896da8917969",
      "title": "Between Authority and Usurpation? Common Good and Constitutional Government",
      "authors": [
        {
          "name": "Richard Ekins",
          "authorId": "2315365624"
        }
      ],
      "year": 2024,
      "abstract": "\n The classical tradition of law and government supports lawful authority and condemns usurpation. But the common good sometimes provides a reason to sweep aside existing constitutional arrangements. This article considers the way in which authority and usurpation feature in Adrian Vermeule’s recent book, Common Good Constitutionalism, and thus reflects on the nature of constitutional government. Vermeule’s work combines a commendable philosophy of government with a questionable philosophy of legal reasoning, which weakens the force of Vermeule’s account of American constitutional law and practice. Reflection on the scope of the common good—on whose common good counts—has important implications for how, and for whom, authority should be exercised. Collective agency is important in securing the common good and representative democracy is an important means to unite a people in common action for their good. Constitutional government should aim to command popular support. Forms of constitutional government are contingent, but usurpation of lawful public authority is an evil that should be avoided.",
      "citationCount": 0,
      "doi": "10.1093/ajj/auae008",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/4927dcf79874db577e150a5e90fb896da8917969",
      "venue": "The American Journal of Jurisprudence",
      "journal": {
        "name": "The American Journal of Jurisprudence"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "60bba2c9851c983ee8fcf5c25c85e3b66078b85f",
      "title": "Machiavelli, Epicureanism and the Ethics of Democracy",
      "authors": [
        {
          "name": "Christopher Holman",
          "authorId": "145384651"
        }
      ],
      "year": 2023,
      "abstract": "\nRecent scholarship on the political thought of Niccolò Machiavelli has demonstrated the extent to which the latter's republicanism is of a populist type, and a potentially important resource for contemporary democratic theory. Although work has been produced on the constitutional form of the Machiavellian republic, less effort has been made to articulate the theoretical assumptions upon which the advocacy of such a republic is ethically grounded. Here, I attempt to locate the democratic ethical imperative in the affirmation of a fundamental human difference. Influenced by the Epicurean tradition, Machiavelli's natural philosophy considers material entities as absolute singularities lacking internal teleological direction, their movement the productive result of contingent encounters. One cannot assume a natural or pre-social identity of desire between persons. Democracy is the ethically preferred regime because it is the one that is capable of facilitating the expression of this human uniqueness.",
      "citationCount": 2,
      "doi": "10.3167/th.2023.7017404",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/60bba2c9851c983ee8fcf5c25c85e3b66078b85f",
      "venue": "Theoria",
      "journal": {
        "name": "Theoria"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "f0cbff151c1c4839d121a0cdb8f68c23dcc4af54",
      "title": "Pope Benedict XVI's Critique of Legal Positivism with Special Regards to the Role of Tradition in Contemporary Legal Systems",
      "authors": [
        {
          "name": "Vid Žepič",
          "authorId": "2197908315"
        }
      ],
      "year": 2023,
      "abstract": ": Pope Benedict XVI’s 2011 address to the Bundestag can be interpreted as a comprehensive synthesis of his perspective on the foundations of law as a subsystem within society. He underscored the paramount importance of constitutional democracy and the state, governed by an implementation of the rule of law that is both free and dedicated to upholding human dignity. Furthermore, he exhorted politicians and citizens alike to persistently pursue justice, to critically assess the law as responsible individuals, and to aspire to higher moral standards. In addition to this, he cast doubt on the adequacy of scientific legal positivism and scientism in comprehending law and the realm of reason. Stemming from his scepticism concerning the sufficiency of positivism in the formulation and interpretation of law, he emphasized the significance of European “legal heritage”. According to Benedict, this tradition originated from the cultural triangle of Jerusalem, Athens, and Rome, and serves as an indicator of a “rational legal order”. As Pope Benedict XVI’s address was directed towards scholars in the field of jurisprudence and legal historians, my analysis of the speech is accompanied by a brief examination of the role of the notion of “le-gal tradition” within the selected European contemporary legal systems.",
      "citationCount": 0,
      "doi": "10.34291/bv2023/03/zepic",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/f0cbff151c1c4839d121a0cdb8f68c23dcc4af54",
      "venue": "Bogoslovni vestnik",
      "journal": {
        "name": "Bogoslovni vestnik"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "5837e966c408c5e51dc44f0f5bfe48942175ec89",
      "title": "The Authoritarian Nature of Common Good Constitutionalism",
      "authors": [
        {
          "name": "Michael A. Wilkinson",
          "authorId": "143922461"
        }
      ],
      "year": 2024,
      "abstract": "\n How are we to evaluate the project of common good constitutionalism? This new movement, which dismisses positivism and liberalism, progressivism and originalism, aims to overturn the entire canon of modern political and constitutional theory. In its place, it aims to restore a classical tradition of natural law jurisprudence, which is said to have been lost over the last century of constitutional law and practice. In so doing it uses one of liberalism’s own juristic heroes, Ronald Dworkin, in order to free conservatism from the tethers of fidelity to constitutional text and the principle of popular sovereignty underwriting it. Common good constitutionalism’s intervention in the constitutional culture wars of the present is authoritarian not because of its opposition to liberalism, but because of its steadfast refusal of any link between constitutional authority and democracy.",
      "citationCount": 1,
      "doi": "10.2139/ssrn.4283813",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/5837e966c408c5e51dc44f0f5bfe48942175ec89",
      "venue": "Social Science Research Network",
      "journal": {
        "name": "SSRN Electronic Journal"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "5c626666f529178a81a456c5e0fd61ccc0723d90",
      "title": "The Impact of the Spirit of the Scientific Revolution on Human Rights in Modern Constitutions",
      "authors": [
        {
          "name": "Xingyi Li",
          "authorId": "2323615328"
        }
      ],
      "year": 2024,
      "abstract": "This paper explores the profound impact of the Scientific Revolution on modern constitutional law and human rights. It traces the evolution from early constitutional forms in classical antiquity to the transformative shifts introduced during the Enlightenment. The paper highlights the development of constitutional law from its rudimentary beginnings, such as the Magna Carta, to the more sophisticated frameworks of modern constitutions shaped by the Enlightenment ideals of equality, liberty, and democracy. The Newtonian Revolution's introduction of scientific rationalism—emphasizing skepticism, empiricism, and secularism—played a crucial role in shaping contemporary legal systems. This intellectual shift fostered the rise of legal positivism, which allows laws to evolve in response to societal changes, contrasting with the immutable nature of natural law. Ultimately, the legacy of scientific rationalism is evident in modern legal systems' adaptability and commitment to justice, balancing tradition with progress to address the complexities of contemporary society.",
      "citationCount": 0,
      "doi": "10.62051/53hppx79",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/5c626666f529178a81a456c5e0fd61ccc0723d90",
      "venue": "Transactions on Social Science, Education and Humanities Research",
      "journal": {
        "name": "Transactions on Social Science, Education and Humanities Research"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "97ed1f5674cde3ba9cf0d4310a71d112626b14e2",
      "title": "Why Liberalism Failed",
      "authors": [
        {
          "name": "A. Groth",
          "authorId": "2605546"
        }
      ],
      "year": 2018,
      "abstract": null,
      "citationCount": 243,
      "doi": "10.1080/23739770.2018.1507077",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/97ed1f5674cde3ba9cf0d4310a71d112626b14e2",
      "venue": "",
      "journal": {
        "name": "Israel Journal of Foreign Affairs",
        "pages": "295 - 298",
        "volume": "12"
      },
      "publicationTypes": null
    },
    {
      "paperId": "a6e7024896613091b32de384d604d5ad6b9d12d0",
      "title": "“Journeying Together:” Does a Synodal Church Improve Respect for the Human Person?",
      "authors": [
        {
          "name": "D. Bogner",
          "authorId": "1580217904"
        }
      ],
      "year": 2023,
      "abstract": "This paper will discuss the question of whether synodality is sufficient to address those “systemic” causes that have often led to sexual abuse. A distinction will be made between synodality as an attitude and a synodically structured church constitution. It is to be assumed that there are strong forces in the church that understand the term as a vague “inclusion of different voices”, but are not prepared to make changes in canonical law and ecclesiology. Such changes would be necessary, however, to make the desired improvements binding and effective. The basic idea behind this analysis is that “synodality” is an instrument from the social-philosophical mindset of antiquity. A synodically structured community today requires further elements from the constitutional tradition of democracy and the rule of law to ensure sufficient protection for individuals against sexual abuse and its subsequent cover-up.",
      "citationCount": 3,
      "doi": "10.55476/001c.72064",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/a6e7024896613091b32de384d604d5ad6b9d12d0",
      "venue": "Journal of moral theology",
      "journal": {
        "name": "Journal of Moral Theology"
      },
      "publicationTypes": null
    },
    {
      "paperId": "9722f808e46a930fa2b86b7e4e81d6742caeca39",
      "title": "POVO, DEMOCRACIA E A AN-ARQUIA DA POLÍTICA: UMA CRÍTICA AO CONSTITUCIONALISMO A PARTIR DE JACQUES RANCIÈRE",
      "authors": [
        {
          "name": "Reinaldo Silva Cintra",
          "authorId": "2229109717"
        }
      ],
      "year": 2023,
      "abstract": null,
      "citationCount": 0,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/9722f808e46a930fa2b86b7e4e81d6742caeca39",
      "venue": "",
      "journal": null,
      "publicationTypes": null
    },
    {
      "paperId": "4c2a49d99c3bbed981e2c401742241dd133d574d",
      "title": "Kosten-Nutzen-Analyse als normatives Entscheidungsverfahren: zweifelhafte und durchgreifende ethische und rechtliche Einwände",
      "authors": [
        {
          "name": "F. Ekardt",
          "authorId": "29836325"
        }
      ],
      "year": 2021,
      "abstract": "With the cost-benefit analysis, economists cultivate a specific decision-making procedure that is also partially accepted in politics. The objections raised in the tradition of criticizing utilitarianism and against the economization of decision-making, such as the criticism of balancing, of an allegedly lack of distributive justice, or of the tendency to describe human beings in behavioral scientific terms as self-interested, are, however, hardly convincing upon closer examination. But first, the empiricist theoretical basis of (covertly normative) cost-benefit analysis seems untenable. This refers to its idea that normative questions have to be transformed into questions of factual preferences. Second, there are massive collisions with a liberal-democratic constitutional law whose principles are at the same time basic ethical principles. This concerns both the rights of freedom (which must not depend on the ability to pay) and the model of democracy and respect for the rule of law. Third, there are insoluble application problems for cost-benefit analysis, which becomes visible especially (but not only) in the context of climate protection, both in overall considerations and in individual analyses, such as the construction of a coal-fired power plant.",
      "citationCount": 0,
      "doi": "10.3790/jre.29.1.27",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/4c2a49d99c3bbed981e2c401742241dd133d574d",
      "venue": "Jahrbuch für Recht und Ethik / Annual Review of Law and Ethics",
      "journal": {
        "name": "Jahrbuch für Recht und Ethik / Annual Review of Law and Ethics"
      },
      "publicationTypes": null
    },
    {
      "paperId": "53023b0600793a520e6270a0284b29982ff29f0a",
      "title": "Neoliberalismo e Ciência Política: contribuições teóricas sobre a crise da democracia",
      "authors": [
        {
          "name": "J. Guimarães",
          "authorId": "114801033"
        },
        {
          "name": "C. Cruz",
          "authorId": "146350154"
        }
      ],
      "year": 2021,
      "abstract": "This article proposes a reflection, systematization, and orientation of a broad international literature on neoliberalism, aimed at working on its political concept and making its use more rigorous, delimited, andregulated in Political Science. With this objective in view, the article inscribes the concept in the historical tradition of liberalism, through an approach grounded in political philosophy. It follows a historical and contextual approach to structure a narrative of the political expansion process of neoliberalism, identifies the rise of neoliberalism as a legitimizing principle of the States and, finally, summarizes the relationship between the predominance of neoliberalism and the legal and constitutional changes in the liberal State. In conclusion, some theoretical contributions that this political concept of neoliberalism can offer for contemporary reflection on the deadlocks of democracy are introduced.",
      "citationCount": 0,
      "doi": "10.5216/SEC.V24.60911",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/53023b0600793a520e6270a0284b29982ff29f0a",
      "venue": "",
      "journal": {
        "name": "Sociedade E Cultura",
        "volume": "24"
      },
      "publicationTypes": null
    },
    {
      "paperId": "cabaf1e7747676bd046a33b35c0dd5b8a189ca40",
      "title": "Reconstituting We the People: Frederick Douglass and Jurgen Habermas in Conversation",
      "authors": [
        {
          "name": "Paul Gowder",
          "authorId": "15337701"
        }
      ],
      "year": 2019,
      "abstract": "In a condition of genuine egalitarian inclusion, a “constitutional conception” of popular sovereignty derived primarily from the “constitutional patriotism” associated with Jürgen Habermas can resolve the key challenges associated with the countermajoritarian problem in constitutional theory as well as the problem of constituent power in democratic theory. It does so by providing a conceptual basis for an understanding of the the constitutional demos as a corporate body extending across time capable of ongoing legitimation. However, the constitutional conception cannot justify states, such as the United States, characterized by the durable exclusion of some legitimate members of the polis from political institutions. Even under the constitutional conception, the United States is not a legitimate constitutional democracy in virtue of its treatment of Black Americans. Nonetheless, there is an important tradition in Black American constitutional thought, beginning with Frederick Douglass, which represents American constitutional institutions as conditionally worthy of attachment in virtue of their latent normative potential. The correct conception of constitutional legitimacy for the United States combines Douglass's insights, and those of his intellectual heirs, with those working in the tradition which Habermas represents.",
      "citationCount": 2,
      "doi": "10.31228/osf.io/csr9x",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/cabaf1e7747676bd046a33b35c0dd5b8a189ca40",
      "venue": "",
      "journal": {
        "name": "Northwestern University Law Review",
        "pages": "335-414",
        "volume": "114"
      },
      "publicationTypes": null
    },
    {
      "paperId": "b2aca84f6bc472252656ed2a11cf1a003ba30b83",
      "title": "A Covenant of the Heart: Martin Luther King Jr., Civil Disobedience, and the Beloved Community",
      "authors": [
        {
          "name": "J. M. Patterson",
          "authorId": "144217507"
        }
      ],
      "year": 2018,
      "abstract": null,
      "citationCount": 4,
      "doi": "10.1086/695641",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/b2aca84f6bc472252656ed2a11cf1a003ba30b83",
      "venue": "American Political Thought",
      "journal": {
        "name": "American Political Thought",
        "pages": "124 - 151",
        "volume": "7"
      },
      "publicationTypes": null
    },
    {
      "paperId": "c819fb1fa33aa87d308d1ed0a7e2c16c9a6bcec5",
      "title": "Interpreting Machiavelli’s Tribunes of the Plebs",
      "authors": [
        {
          "name": "Jérémie Barthas",
          "authorId": "2086089843"
        }
      ],
      "year": 2018,
      "abstract": null,
      "citationCount": 3,
      "doi": "10.5325/GOODSOCIETY.26.1.0055",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/c819fb1fa33aa87d308d1ed0a7e2c16c9a6bcec5",
      "venue": "",
      "journal": {
        "name": "The Good Society",
        "pages": "55 - 70",
        "volume": "26"
      },
      "publicationTypes": null
    },
    {
      "paperId": "dd203a30dac8ea6f01a4964e466c150a27bc42d1",
      "title": "The Foundations of Constitutional Democracy: The Kelsen-Natural Law Controversy",
      "authors": [
        {
          "name": "Nathan Gibbs",
          "authorId": "4074467"
        }
      ],
      "year": 2024,
      "abstract": "Abstract In the immediate post-war period, a set of thinkers, most notably Jacques Maritain, developed influential natural law theories of constitutional democracy. The central tenet of the natural law approach to the post-war settlement was that, without the type of foundational understanding of the constitutional system it was proposing, the new democratic political institutions would relapse into totalitarianism. In response to this natural law challenge, Hans Kelsen sought to explicate and defend a self-consciously secular and relativistic understanding of the basis of constitutional democracy. This article will examine the debate between the Kelsenian and the natural law view of constitutional democracy. The debate raises questions of foundational importance, and a number of issues are of particular concern in the present global context. These issues concern the role of moral pluralism and its relevance to the structure of constitutional democracy, and the relationship between universal values and the common good of particular communities.",
      "citationCount": 3,
      "doi": "10.1017/cjlj.2024.3",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/dd203a30dac8ea6f01a4964e466c150a27bc42d1",
      "venue": "Canadian Journal of Law & Jurisprudence",
      "journal": {
        "name": "Canadian Journal of Law & Jurisprudence",
        "pages": "79 - 107",
        "volume": "37"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "5e2273256e42134d36afe3b9023564143952fbeb",
      "title": "On Populism and Civil Society: The Challenge to Constitutional Democracy by Andrew Arato and Jean L. Cohen",
      "authors": [
        {
          "name": "María Pía Lara",
          "authorId": "2269400878"
        }
      ],
      "year": 2023,
      "abstract": "I will critically explore Arato and Cohen’s work on populism acknowledging areas of agreement while noting gaps in their reasoning particularly regarding the complex relations between capitalism and democracy and the recent erosion of democracy replacing it with authoritarian regimes that are better suited for neoliberal policies.",
      "citationCount": 0,
      "doi": "10.1177/01914537231211026",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/5e2273256e42134d36afe3b9023564143952fbeb",
      "venue": "Philosophy &amp; Social Criticism",
      "journal": {
        "name": "Philosophy & Social Criticism",
        "pages": "855 - 861",
        "volume": "50"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "1b7a2c29da8197f552ebd2ba34586387a70de072",
      "title": "Can democracy save children’s lives? Addressing the constitutional problem of expertise",
      "authors": [
        {
          "name": "Brice Laurent",
          "authorId": "2290536357"
        }
      ],
      "year": 2025,
      "abstract": "This comment critically examines Collins, Evans, and Reyes-Galindo’s (CE&RG) concept of ‘virtual diversity’, proposed as a norm to safeguard scientific expertise in policy-making. CE&RG argue that scientists should acquire ‘interactional expertise’ in relevant ‘non-scientific domains’, enabling informed policy advice while preserving scientific integrity. This comment describes CE&RG’s dualist approach, which separates epistemic and political concerns, and discusses its implications. It shows that for virtual diversity to contribute to the quality of and trust in expertise, this approach needs to be radically re-worked to include legitimacy-building processes. Using examples such as South Africa’s AIDS policy and the COVID-19 pandemic, the comment argues that defending expertise requires ensuring the robustness of both scientific and political representations, of, in other terms, addressing expertise as a constitutional problem. Without a broader critical constitutional analysis, CE&RG’s proposal risks reinforcing the crisis of expertise it seeks to remedy.",
      "citationCount": 3,
      "doi": "10.1177/03063127241310461",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/1b7a2c29da8197f552ebd2ba34586387a70de072",
      "venue": "Social Studies of Science",
      "journal": {
        "name": "Social Studies of Science",
        "pages": "288 - 294",
        "volume": "55"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "b0a7148fbc118d94b35d367c3d5950bd44e8b4ae",
      "title": "The making of constitutional democracy: from creation to application of law",
      "authors": [
        {
          "name": "Conor Crummey",
          "authorId": "115473854"
        }
      ],
      "year": 2022,
      "abstract": "Paolo Sandro’s book is the latest volume in Hart Publishing’s excellent ‘Law and Practical Reason’ series. The book’s theoretical scope is wide, engaging with analytical legal philosophy (of both Anglo-American and continental varieties), constitutional theory, philosophy of language, and continental administrative law. It will be of interest to scholars in each of these disciplines and others besides. A consistent through line, uniting these variegated elements, is the claim that there is a conceptual distinction between the creation of law and its application, and that this distinction is vital for legal and constitutional theory. Sandro argues that two unfortunate conclusions would follow from the theoretical breakdown of the distinction between law creation and application. First, law would lose its capacity to solve coordination problems and guide action; a function that Sandro considers a key part of the concept of law (17). Secondly, it would entail that legal practice is anti-democratic, as it would follow that law is not, as we generally suppose it is, made by our elected representatives (2). A conceptual distinction between law creation and application, then, is a necessary legitimacy condition of constitutional democracies. Framing the debate in this way comes with limitations. The claim, in essence, is that if we don’t accept the creation/application distinction, then law is not legitimate in the way that we think it is. But Sandro’s main interlocutors – legal realists of classical and modern stripes – would be perfectly happy to accept this conclusion. They may even respond, ‘yes, precisely’. It isn’t clear, then, that Sandro succeeds in talking to his targets and not past them, but we can leave this to the realists to decide. We can still take these claims seriously on their own terms. As mentioned, one of the book’s great contributions is the staging of scholarly encounters between theorists from multiple theoretical backgrounds and disciplines. A critique of Hobbes is held up alongside engagement with Kojin Karatani’s analysis of ‘isonomia’. Familiar general jurisprudential debates on judicial ‘discretion’ are viewed through the lens of traditions of administrative discretion in Germany, Italy and France. And various continental constitutional theorists are given a prominence that is often unjustifiably denied to them in Anglophone literature. This is an ambitious project, in other words, and almost any reader who is expert in one particular area with which Sandro engages is likely to be rewarded with an encounter between their own discipline and some less familiar one. This alone makes it a welcome addition to the constitutional theory canon, broadly defined. While the breadth of the book’s scope is undoubtedly a boon, it does, as other reviewers have noted, make it rather difficult to summarise the book or to do justice to all its arguments. I will therefore offer only a brief outline of the book’s structure, before focussing",
      "citationCount": 2,
      "doi": "10.1080/20403313.2022.2143668",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/b0a7148fbc118d94b35d367c3d5950bd44e8b4ae",
      "venue": "Jurisprudence",
      "journal": {
        "name": "Jurisprudence",
        "pages": "127 - 133",
        "volume": "14"
      },
      "publicationTypes": [
        "JournalArticle",
        "Review"
      ]
    },
    {
      "paperId": "93286b7fb26defe600d5509565e79ca85bfb9196",
      "title": "Democracy, Demagoguery, Tyranny: Why the Rhetorical Tradition Matters Today",
      "authors": [
        {
          "name": "Robin L. Reames",
          "authorId": "2342065165"
        }
      ],
      "year": 2025,
      "abstract": "Abstract:It is the role of scholars to shine the light of tradition on problems of today so the value of the rhetorical tradition is clear to a larger audience of students, citizens, and non-experts, even as these same scholars undertake the difficult, demanding work of unearthing, reinterpreting, and understanding anew the buried wisdom of that tradition. This is a rallying cry to reclaim the history of rhetoric as a theory of persuasion about contingency: to comprehend anew how the essential unpredictability of human judgment and action are guided by the power of words.",
      "citationCount": 0,
      "doi": "10.1353/rht.2025.a976411",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/93286b7fb26defe600d5509565e79ca85bfb9196",
      "venue": "Rhetorica: A Journal of the History of Rhetoric",
      "journal": {
        "name": "Rhetorica",
        "pages": "235 - 250",
        "volume": "43"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "fb23c635429936ac3ec263e9a44afefcc173abda",
      "title": "John Rawls and \"Our Tradition\" of Democracy",
      "authors": [
        {
          "name": "James T. Kloppenberg",
          "authorId": "115945830"
        }
      ],
      "year": 2022,
      "abstract": "Abstract:The notion of a clear distinction between Rawls's liberalism and social democracy rests on a caricatured conception of the liberal tradition and Rawls's place in it. From Rousseau, John Adams, and Madison through Tocqueville to Dewey, notable political theorists have sought to balance the two principles at the core of Rawls's A Theory of Justice. In this essay I sketch the ways in which American thinkers and activists escaped the cages in which commentators have tried to confine them, not only the false binary between liberalism and democratic socialism but also that between secularism and religious belief. As Rawls himself tried to make clear in his later writing, his ideal of justice drew from earlier theorists who understood the constitutive role of social interaction and inherited traditions, and he envisioned a society with room for people animated by comprehensive philosophical and religious ideas not shared by everyone else. Rawls's political liberalism, historicist as well as pluralist, was attuned as much to the threat inequality poses to freedom as to the endangered status of freedom in mass society. Rawls's ideas, especially as articulated in his book Justice as Fairness, remain a vital resource for social democrats who prize social and economic equality as well as individual liberty.",
      "citationCount": 2,
      "doi": "10.3138/ttr.43.1.21",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/fb23c635429936ac3ec263e9a44afefcc173abda",
      "venue": "The Tocqueville Review",
      "journal": {
        "name": "The Tocqueville Review/La revue Tocqueville",
        "pages": "21 - 50",
        "volume": "43"
      },
      "publicationTypes": null
    },
    {
      "paperId": "78e40dc03caa4873473173bc183f843061405bbc",
      "title": "The Economic Tradition and the Problem of Social Order: Hans Albert’s Critique of Welfare Economics and the Perspective of Constitutional Political Economy",
      "authors": [
        {
          "name": "V. Vanberg",
          "authorId": "118763109"
        }
      ],
      "year": 2021,
      "abstract": null,
      "citationCount": 4,
      "doi": "10.1007/s41412-021-00106-3",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/78e40dc03caa4873473173bc183f843061405bbc",
      "venue": "Homo Oeconomicus",
      "journal": {
        "name": "Homo Oeconomicus",
        "pages": "83-111",
        "volume": "39"
      },
      "publicationTypes": null
    },
    {
      "paperId": "01ec718bb3625fe6d2b81a625297c0d89265e2df",
      "title": "The logical foundations of constitutional democracy between legal positivism and natural law theory",
      "authors": [
        {
          "name": "H. Kliemt",
          "authorId": "47737726"
        }
      ],
      "year": 2021,
      "abstract": "Rejecting all knowledge claims concerning right and wrong in matters practical James Buchanan concurred with legal positivism that invalid law cannot be identified by its substantive content but only by an inherited defect in its factual creation. Beyond correct creation Buchanan proposed as a quasi-natural law constraint that unanimity in the shadow of individual veto power must at least be conceivable if a norm is to be law. The emerging hybrid conception of constitutional law is symptomatic for Buchanan’s never-ending but ultimately futile efforts to incorporate Kantian ideals of interpersonal respect into constitutional economics without imposing them as personal values.",
      "citationCount": 4,
      "doi": "10.1007/s11127-021-00888-9",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/01ec718bb3625fe6d2b81a625297c0d89265e2df",
      "venue": "Public Choice",
      "journal": {
        "name": "Public Choice",
        "pages": "269 - 281",
        "volume": "195"
      },
      "publicationTypes": null
    },
    {
      "paperId": "a4ce67519560c783b18fe3d20898662903954638",
      "title": "The Establishment of Theoretical Bases for the Rule of the People in the Medieval Theological Tradition: Genealogy of the Constitutional Law Doctrine",
      "authors": [
        {
          "name": "S. Zenin",
          "authorId": "32015612"
        }
      ],
      "year": 2021,
      "abstract": "The proposed article makes an attempt at a study of the processes of the origination and development of theoretical bases for the idea of the rule of the people in the medieval theological tradition. The author systematically analyzes the systems of ideas of Aurelius Augustinus, Thomas Aquinas, Manegold of Lautenbach, John of Salisbury and other thinkers. The paper notes that the development of the rule of the people doctrine in the medieval theological tradition has secured the establishment of a theoretical framework. The idea of the rule of the people is developed during the studied period taking into account two interdependent tendencies. On the one hand, it is drawn up as the main argument in justification of derivativeness and limitation of the monarch’s secular authorities. On the other hand, it is established as a theoretical basis of a new legitimate ground for the king’s rule.",
      "citationCount": 1,
      "doi": "10.18572/1812-3805-2021-1-3-14",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/a4ce67519560c783b18fe3d20898662903954638",
      "venue": "",
      "journal": {
        "name": "",
        "pages": "3-14",
        "volume": "1"
      },
      "publicationTypes": null
    },
    {
      "paperId": "20368290684ecc696b9b182e5add19f0d84038fb",
      "title": "Constitutional Idolatry and Democracy: Challenging the Infatuation with Writtenness by Brian Christopher Jones [Edward Elgar, 2020, 208pp, ISBN 978-1788971096, £75 (h/bk)]",
      "authors": [
        {
          "name": "M. Gordon",
          "authorId": "121118666"
        }
      ],
      "year": 2021,
      "abstract": "Brian Christopher Jones has written a fascinating and important book exploring the limits of written constitutions and the ways in which they are idolised. This is an impressive critique of dominant constitutional thinking, and is all the more welcome because it asks questions about written constitutions which are increasingly unasked. The idea that a State’s constitution should be codified in a written text, which has supremacy over most other legal rules and is often enforced by the courts, is clearly the modern global norm. Inevitably there are differences in how these ideas are implemented in varying national contexts, and a few countries, such as the UK, New Zealand and Israel, remain (to differing extents) reluctant adopters. Yet the idea of the written constitution appears to be a magnetic force at the centre of constitutional studies, to which even outlier states will eventually be drawn. Or, at the very least, the dominance of the written constitution requires continuous justification of the decision to maintain the uncodified model, while prompting reductive and unfulfilling debates about whether a State can have a constitution at all without a single written text. Jones presents a powerful challenge to the idea of the written constitution, seeking to unsettle mainstream assumptions about the superiority of such constitutional texts. The book approaches this task in an ambitious way, setting out to assess the broader impact of written constitutions on democracy, on politics and on citizens. The willingness to engage with the effectiveness of written constitutions is a particular strength—Jones’ detailed deconstruction of the educative function of written constitutions in Chapter 3 is concerning and illuminating in equal measure, and his sceptical analysis of ‘We the People’ myths raises some crucial concerns about the democratic character of modern constitutionalism. There are also powerful arguments in Chapters 5 and 6 demonstrating the extent to which written constitutions protecting entrenched individual rights have placated citizens rather than reinvigorated democracy, and the weak connection between the quality of a written constitution and the success or survival of a State. These are rich lines of argument, and there are others, such as his finding that the language of constitutional ‘guardianship’ has enjoyed a modern resurgence, and that its unwelcome paternalism (especially when such terms are attached to the judiciary) may engender constitutional complacency in citizens. All of these different strands combine effectively in support of the most important contribution Jones makes in his book. This is his development of the idea of constitutional idolatry, so that it applies not only to particular constitutions in particular States, but to the concept of the written constitution itself. Jones provides ample evidence to challenge the contemporary infatuation with written constitutions, and shows a number of the risks of overstating what this form of constitutionalism can achieve. Jones makes a persuasive case against constitutional idolatry but—at the risk of focusing on what he has not written about—those overall conclusions raise some challenging questions for the future. In particular, and indeed perhaps because I am highly sympathetic to the critique made by Jones, the book left me thinking: if not written constitutions, then what? In broad terms Jones has an answer to this, arguing that we need to end the idolisation of written constitutions, and reassert faith in",
      "citationCount": 0,
      "doi": "10.1017/S0020589321000063",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/20368290684ecc696b9b182e5add19f0d84038fb",
      "venue": "International and Comparative Law Quarterly",
      "journal": {
        "name": "International and Comparative Law Quarterly",
        "pages": "531 - 532",
        "volume": "70"
      },
      "publicationTypes": null
    },
    {
      "paperId": "1b0ce44c27d0b76382044cb86273235780035ff7",
      "title": "Confucian meritocracy, political legitimacy and constitutional democracy",
      "authors": [
        {
          "name": "Zhuoyao Li",
          "authorId": "51255171"
        }
      ],
      "year": 2020,
      "abstract": "The article will argue that neither what may be called ‘multiple legitimacies’ nor what Leigh Jenco refers to as the hybrid view of legitimacy provides substantial guidance in reconceiving legitimacy in the increasingly pluralistic region of East Asia. Instead, a more helpful view of political legitimacy can be drawn from John Rawls’s liberal principle of legitimacy. I will demonstrate that Rawls’s classic formulation can be deprived of its liberal connotation by taking constitutional essentials as the source of legitimation for political authority. On the basis of this principle of pluralistic legitimacy, it will become clear that a pluralistic understanding of political legitimacy does not rule out Confucian meritocracy, but it does make a strong case for an antiperfectionist state, even if it might be nondemocratic.",
      "citationCount": 3,
      "doi": "10.1177/0191453720948403",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/1b0ce44c27d0b76382044cb86273235780035ff7",
      "venue": "",
      "journal": {
        "name": "Philosophy & Social Criticism",
        "pages": "1076 - 1092",
        "volume": "46"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "a3d47c3a261ca2602394559e3c43b4b4cb74c1a2",
      "title": "Edward Willis, Review of Brian Christopher Jones, Constitutional Idolatry and Democracy: Challenging the Infatuation with Writtenness.",
      "authors": [
        {
          "name": "Edward Willis",
          "authorId": "145140997"
        }
      ],
      "year": 2021,
      "abstract": null,
      "citationCount": 0,
      "doi": "10.1093/icon/moab086",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/a3d47c3a261ca2602394559e3c43b4b4cb74c1a2",
      "venue": "International Journal of Constitutional Law",
      "journal": {
        "name": "International Journal of Constitutional Law"
      },
      "publicationTypes": [
        "Review"
      ]
    },
    {
      "paperId": "a469c59dba99ff39f97661dd6e98320782df181a",
      "title": "Constitutional Idolatry and Democracy: Challenging the Infatuation With Writtenness",
      "authors": [
        {
          "name": "B. Jones",
          "authorId": "46927927"
        }
      ],
      "year": 2020,
      "abstract": null,
      "citationCount": 6,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/a469c59dba99ff39f97661dd6e98320782df181a",
      "venue": "",
      "journal": {
        "name": "",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "5ed235a0cf7a3db1ea3978346f5c7f7cd48f4928",
      "title": "The Moral Justification of Civil Disobedience in a Constitutional Democracy: An Appraisal of Rawls’ Notion of Civil Disobedience",
      "authors": [
        {
          "name": "E. Ezedike",
          "authorId": "114338331"
        },
        {
          "name": "Itelimo Morrison",
          "authorId": "1581822493"
        }
      ],
      "year": 2019,
      "abstract": "The paper examined the moral implications of civil disobedience in a constitutional democracy, using John Rawls’ notion of civil disobedience as a conceptual framework. It deals with the moral problem of justifying a civil revolt against an unjust government in a democratic setting. The paper adopts the method of textual analysis and uses John Rawls seminal work, A Theory of Justice , as its primary text. In the sum, Rawlsian theory of justice is a mid-way between the liberal principle and egalitarian principle. To secure the human capacity for free choice and pursuit of common good, Rawls posits that we must accept the first principle of justice, which protects the equal liberties of citizenship as contained in the social contract. Although his ideas have attracted a lot of criticisms from both the right and left of the ideological spectrum, the paper thinks Rawls’ position makes a lot of moral sense. The objective of the paper is to defend, on moral grounds, the idea of civil disobedience when those in power become unjust and oppressive in relation to the social contract. It concluded with the view that the political class hold power and authority on trust and this makes it morally justifiable to resist the abuse of such powers since it contradicts the values of integrity, fairness and justice. Moreover, the equal dignity of human beings as moral persons dictates equal liberty and freedom of action that negates the arrogation of powers by a select State official who are in minority. Key Words : moral, justification, justice, civil disobedience, democracy",
      "citationCount": 1,
      "doi": "10.4314/afrrev.v13i4.8",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/5ed235a0cf7a3db1ea3978346f5c7f7cd48f4928",
      "venue": "",
      "journal": {
        "name": "African Research Review",
        "pages": "86-95",
        "volume": "13"
      },
      "publicationTypes": null
    },
    {
      "paperId": "db0b8162907e8f1ac98a083ce8edf2ab0cc7644c",
      "title": "Resenha de 'How to save a Constitutional Democracy', de Tom Ginsburg e Aziz Huq",
      "authors": [
        {
          "name": "Paulo Rodrigues",
          "authorId": "2069253252"
        },
        {
          "name": "Pedro De Araújo Fernandes",
          "authorId": "2058640635"
        }
      ],
      "year": 2019,
      "abstract": "Referencia completa da obra: Ginsburg, Tom; Huq, Aziz Z. How to save a Constitutional Democracy. Chicago: University of Chicago Press, 2018. 306 p.",
      "citationCount": 0,
      "doi": "10.11606/issn.2176-8099.pcso.2019.165735",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/db0b8162907e8f1ac98a083ce8edf2ab0cc7644c",
      "venue": "",
      "journal": {
        "name": "",
        "pages": "304-308",
        "volume": "26"
      },
      "publicationTypes": null
    },
    {
      "paperId": "9a114c2293f70255ddd24180913e20e716f28b0d",
      "title": "Back to the future? Crisis of constitutional democracy and traces of a Bolshevik past",
      "authors": [
        {
          "name": "Nagalia Shubhra",
          "authorId": "1583154822"
        }
      ],
      "year": 2019,
      "abstract": "Today, the world over a debate is going on regarding the usefulness of the forms of democracy that different states have adopted over time. The meaning and associations with the concept of democracy and its attendant political forms have changed at critical points in history. These changes have been attributed both to, evolutionary and revolutionary impulses that have expanded or transformed the ways in which democracy and the relationship of its political forms with the people had been primarily understood. The most enduring association of democracy with freedom and equality is a historical product that came into being with the onset of capitalism with its philosophical basis in political liberalism. The dominance of capitalist liberal democracy has given such stability to this association that “democracy” can no longer be imagined in any other political imaginary and that its associated meanings of freedom and equality are self-evident and inherent not only to the concept itself but to capitalism. The paper interrogates such ahistorical understanding of the concept of democracy and recuperates the radical history of contentions over its meanings and its most abiding political form i. e. constitutional democracy. The transcendence of national boundaries towards a global citizenship has put a strain on the fundamental operative terrain of constitutional democracy. The values of freedom and equality laid out in the Constitution premised on a liberal contract are more undermined today, than ever before with transnational capital and global citizenship breaking the bounds of constitutional purview. This has brought the concept and political forms of constitutional democracy into a state of crisis today. Can re-looking at the past traces of suppressed contentions over the meaning and forms of democracy give us any insight as to how we can work through the constitutional crisis today? If the meaning and associations with democracy is not eternal but historical, can we bring it them within other political imaginaries?",
      "citationCount": 0,
      "doi": "10.33581/2520-6338-2019-4-36-46",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/9a114c2293f70255ddd24180913e20e716f28b0d",
      "venue": "Journal of the Belarusian State University. History",
      "journal": {
        "name": "Journal of the Belarusian State University. History"
      },
      "publicationTypes": null
    }
  ],
  "count": 30,
  "errors": []
}
