[s2_search.py] Searching Semantic Scholar: 'deliberative democracy public reason' (year=2020-2025) (field=Philosophy), limit=25
[s2_search.py] Retrieved 25/25 papers...
[s2_search.py] Cached results (cache key: s2_7b9b919255c5fa93)
{
  "status": "success",
  "source": "semantic_scholar",
  "query": "deliberative democracy public reason",
  "results": [
    {
      "paperId": "b94bfe79ff173eff665f30833ef0abb1982f8d64",
      "title": "Constitucionalismo fuerte y democracia deliberativa: Inconsistencias en Rawls, Dworkin, y AlexyStrong constitutionalism and deliberative democracy: Inconsistencies in Rawls, Dworkin, and Alexy",
      "authors": [
        {
          "name": "C. I. Giuffré",
          "authorId": "2073162756"
        }
      ],
      "year": 2023,
      "abstract": "\n In the current context, strong constitutionalism is further challenged by the objections to judicial review and the deliberative turn of democracy. Despite the potential of both caveats, the problem is that a juricentric and juristocratic constitutionalism has globally expanded. The paper’s argument is that there is an inconsistency in some theories that—at the democratic level—start from a deliberative conception, but—at the constitutional level—defend such a strong model, which hinders the inclusive dialogue ideal. This is the case of those conceptions of courts as an “exemplar of public reason” (Rawls), a “forum of principles” (Dworkin), or an “argumentative representation institution” (Alexy). To support this argument, the paper is structured as follows. First, it presents the indifference of the predominant constitutional culture to the criticisms of the judicial authority of strong constitutionalism, as well as to the deliberative turn of democracy. Then, it makes explicit the inconsistency of a group of theories which, while subscribing to a deliberative conception of democracy, subscribe to a strong model of constitutionalism. Finally, it argues that, in a context in which the objections to the judicial review and the deliberative turn of democracy have not been taken seriously, it is essential to reinforce both caveats to achieve a better constitutional model.",
      "citationCount": 4,
      "doi": "10.1093/icon/moad071",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/b94bfe79ff173eff665f30833ef0abb1982f8d64",
      "venue": "International Journal of Constitutional Law",
      "journal": {
        "name": "International Journal of Constitutional Law"
      },
      "publicationTypes": [
        "JournalArticle",
        "Review"
      ]
    },
    {
      "paperId": "fc68cf4dc5b57e5963a4dbe69ddf3ce545cd577f",
      "title": "AI, Deskilling, and the Prospects for Public Reason",
      "authors": [
        {
          "name": "A. Ferdman",
          "authorId": "98842193"
        }
      ],
      "year": 2025,
      "abstract": null,
      "citationCount": 1,
      "doi": "10.1007/s11023-025-09737-w",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/fc68cf4dc5b57e5963a4dbe69ddf3ce545cd577f",
      "venue": "Minds and Machines",
      "journal": {
        "name": "Minds and Machines",
        "volume": "35"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "261fae0579f3acbd4764f285a694e1e380da9fe0",
      "title": "Public Deliberation, Public Reason, and Concern for Truth",
      "authors": [
        {
          "name": "Paul J. Weithman",
          "authorId": "3977990"
        }
      ],
      "year": 2025,
      "abstract": "\n In “The Idea of Public Reason Revisited,” John Rawls implied that a well-ordered society would be a deliberative democracy and said that public reason is essential to it. After his turn to political liberalism, he was chary about claims of truth. In Section 1, I lay out essential features of Rawlsian deliberative democracy. In Section 2, I introduce some prominent commentary on Rawls’s treatment of truth and public reasoning. On these readings—collectively “the non-permissive reading”—Rawls’s treatment of truth has problematic implications for public reasoning and therefore for deliberative democracy. In Section 3, I survey those implications. In Section 4, I argue that the texts which are taken to support the non-permissive reading support a very different reading. In Section 5, I argue that Rawls does not endorse the theses imputed to him by the non-permissive reading and that his view does not have the implications surveyed in Section 3.",
      "citationCount": 0,
      "doi": "10.1017/s0034670525000026",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/261fae0579f3acbd4764f285a694e1e380da9fe0",
      "venue": "The Review of Politics",
      "journal": {
        "name": "The Review of Politics"
      },
      "publicationTypes": [
        "JournalArticle",
        "Review"
      ]
    },
    {
      "paperId": "3842cd6f786178f6c8edc37fc364d515051e8ff3",
      "title": "Public reason under the tree: Rawls and the African palaver",
      "authors": [
        {
          "name": "Fidèle Ingiyimbere",
          "authorId": "115388925"
        }
      ],
      "year": 2022,
      "abstract": "Public reason is central to John Rawls’s political liberalism, as a mechanism for citizens to discuss about matters of common interest. Although free and equal, reasonable and rational, citizens of a democratic society disagree on their understanding of truth and right, giving rise to the fact of reasonable pluralism. Thus, Rawls works out an idea of public reason which allows citizens to argue about political matters and yet remaining divided in their comprehensive doctrines. On the other hand, African culture has developed the practice of palaver as way of dealing with social and political questions of the community. Usually held under a tree, scholars believe that the palaver is the African version of deliberative democracy. In this article, I elaborate the two ideas and compare them in order to see whether they are completely opposite or whether they can enrich each other. Thus, the first section focuses on Rawls’s idea of public reason, the second explores the palaver practice and the last section compares them.",
      "citationCount": 0,
      "doi": "10.1177/01914537221117254",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/3842cd6f786178f6c8edc37fc364d515051e8ff3",
      "venue": "Philosophy &amp; Social Criticism",
      "journal": {
        "name": "Philosophy & Social Criticism",
        "pages": "281 - 298",
        "volume": "50"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "4011b91fd5646c5f2c2c300aebb35a542a8008e5",
      "title": "Rawlsian Public Reason and Political Vice",
      "authors": [
        {
          "name": "James W. Boettcher",
          "authorId": "2354393443"
        }
      ],
      "year": 2025,
      "abstract": "\n Rawls suggests that facts about the political virtues must be part of the construction of a reasonable political conception of justice. The thesis of this article is that, if an account of political virtue is a necessary element in a reasonable political conception, then so too is an account of political vice. The political vices are those attitudes, feelings, and dispositions that systematically work against reasonableness or the other cooperative or discursive goals of political virtue. The article concentrates on several epistemic-political vices along with practical-political vices that have epistemic elements. Epistemic-political vices such as close-mindedness or gullibility are especially worrisome in the digital age, given their tendency to undermine practices of public reasoning and deliberative democracy. Each political vice is understood as a characteristic failure of one of the Rawlsian burdens of judgment. Each is in this way a more specific form of unreasonableness.",
      "citationCount": 0,
      "doi": "10.1017/s003467052500004x",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/4011b91fd5646c5f2c2c300aebb35a542a8008e5",
      "venue": "The Review of Politics",
      "journal": {
        "name": "The Review of Politics"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "88d759931621cb5111d1082238457a435ee640a5",
      "title": "Lies, Bullshit, or Propaganda? Hannah Arendt, Deliberative Democracy, and the Fight against Post-Truth Politics",
      "authors": [
        {
          "name": "H. Arendt",
          "authorId": "2326038"
        }
      ],
      "year": 2022,
      "abstract": null,
      "citationCount": 1,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/88d759931621cb5111d1082238457a435ee640a5",
      "venue": "",
      "journal": null,
      "publicationTypes": null
    },
    {
      "paperId": "62c2ffebc7f59aec355626d94b1e87eb69000079",
      "title": "Deliberative Democracy, Diversity, and Restraint",
      "authors": [
        {
          "name": "James Boettcher",
          "authorId": "116412999"
        }
      ],
      "year": 2020,
      "abstract": null,
      "citationCount": 5,
      "doi": "10.1007/S11158-019-09435-2",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/62c2ffebc7f59aec355626d94b1e87eb69000079",
      "venue": "Res Publica",
      "journal": {
        "name": "Res Publica",
        "pages": "215-235",
        "volume": "26"
      },
      "publicationTypes": null
    },
    {
      "paperId": "353fab685b5ecf1008719fe5f68d72ffc29d2649",
      "title": "Teaching the People by Example: Mill on the Exemplary Influence of Deliberative Elites",
      "authors": [
        {
          "name": "Jin-gon Park",
          "authorId": "2167436609"
        }
      ],
      "year": 2024,
      "abstract": "ABSTRACT The notion of moral exemplarity, though repeatedly alluded to in John Stuart Mill’s writings, is rarely treated as an essential element of his democratic theory. This article, however, highlights and explains the centrality of exemplarity in Mill’s project of fostering public-minded citizens for a successful democracy. In Representative Government, Mill conceives the exemplary influence of deliberative elites as a necessary condition for making local deliberative bodies the main site for the cultivation of a public spirit. Mill’s Romantic reading of Plato’s Gorgias suggests that this move resulted from his radical skepticism about the power of reason to motivate virtuous behavior along with his corresponding faith in the moral exemplar’s aesthetic force of beauty to improve the spectator’s conduct. Mill’s emphasis on the necessity of exemplary influence for achieving a civic ideal based on a detailed account of its moral psychology reveals him to be a unique political thinker who continues to invite contemporary interest.",
      "citationCount": 0,
      "doi": "10.1080/10848770.2024.2426378",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/353fab685b5ecf1008719fe5f68d72ffc29d2649",
      "venue": "The European Legacy",
      "journal": {
        "name": "The European Legacy",
        "pages": "73 - 89",
        "volume": "30"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "5cbf8557afeaf3b7763e3722247d2d2df80edbdf",
      "title": "Recovering the Democratic Value of Public Discourse",
      "authors": [
        {
          "name": "R. Ivie",
          "authorId": "102491424"
        }
      ],
      "year": 2024,
      "abstract": "The decline of democracy in the US entails the surge of authoritarianism, ascendency of demagoguery, dispersal of the democratic majority, and weakening of public reason. Dissent, envisioned as a rhetorical practice of democratic deliberation, resists authoritarianism by advancing democratic values. Accordingly, this paper examines democracy as a minority voice, explores the deliberative capacity of dissent, and identifies the rhetorical properties of deliberation. The paper argues that dissent, in its fugitive aspect, is dispersed across an array of modest sites, guided by a deliberative ideal partially realised, and framed by democratic values. Dissent functions in this capacity as an itinerant, recurring source of democratic renewal on occasions of political crisis. It is an adaptation to structural constraints that provides a nurturing aspiration to prompt political agency, establish realistic expectations, and sustain vigilance. While the immediacy of the authoritarian threat and corresponding questions about the role of democratic communication are addressed in terms of the 2024 general election in the US, the democratic challenge in the US is indicative of the abiding immediacy of the authoritarian threat to other democracies and suggestive of deliberative adaptations for restoring the vitality of democratic communication and culture. Complacency in democratic theory and practice is counter-indicated.",
      "citationCount": 1,
      "doi": "10.1080/13183222.2024.2342215",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/5cbf8557afeaf3b7763e3722247d2d2df80edbdf",
      "venue": "Javnost - The Public",
      "journal": {
        "name": "Javnost - The Public",
        "pages": "193 - 212",
        "volume": "31"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "0bd7762ede92006f6ea2bc2313cca44e5d7ba761",
      "title": "An Ethically Relevant Concept of Democracy",
      "authors": [
        {
          "name": "P. Komu",
          "authorId": "119610685"
        }
      ],
      "year": 2022,
      "abstract": "\n The meaning of democracy has traditionally been linked to the institutionalisation of public use of reason as jointly exercised by individuals who act in accordance with moral duty rather than one’s desires. For this reason, the meaning and value of democracy are always closely linked. Popular theories of democracy, however, have only treated democracy as instrumentally valuable – merely some disposable means towards achieving and solving problems of justice, freedom, equality, etc. This has called into question the usefulness of having democracy in the first place. My aim is to show that deliberation should be taken into account in ethical analyses of democracy. Thus, I demonstrate that the concept of deliberative democracy is ethically relevant – i.e., deserves moral consideration, enables us to treat democracy as inherently valuable (or something close to it), and subsequently preserves the value of democracy both in our political and moral theorising and in our ordinary dealings.",
      "citationCount": 0,
      "doi": "10.1163/26836408-15020054",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/0bd7762ede92006f6ea2bc2313cca44e5d7ba761",
      "venue": "Utafiti",
      "journal": {
        "name": "Utafiti"
      },
      "publicationTypes": null
    },
    {
      "paperId": "66e770f146a70ad0ac4592ebfad3dad426471553",
      "title": "Truth-tracing versus truth-tracking: Lafont, Landemore and epistemic democracy",
      "authors": [
        {
          "name": "P. Niesen",
          "authorId": "15656744"
        }
      ],
      "year": 2020,
      "abstract": "Cognitivist theories of democratic decision-making come in two flavours, which I label transparently and intransparently epistemic. Lafont’s deliberative theory of democracy has strengths in accounting for the transparently truth-tracing power of justification but lacks a plausible account of the intransparently truth-tracking power of aggregative approaches highlighted by, among others, Hélène Landemore, such as the Condorcet Jury Theorem or the Diversity Trumps Ability Theorem. I suggest opting for an approach that includes semi-transparently epistemic mechanisms, that is, truth-tracking mechanisms, the workings of which can be explained, passing the public reason test, to all citizens.",
      "citationCount": 3,
      "doi": "10.1177/0191453720974714",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/66e770f146a70ad0ac4592ebfad3dad426471553",
      "venue": "",
      "journal": {
        "name": "Philosophy & Social Criticism",
        "pages": "31 - 34",
        "volume": "47"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "ece28dfde70e5054a33b906f6b43acdb037e6da6",
      "title": "Digitalisierung – Revitalisierung oder Bedrohung der Demokratie? Reflexionen zur demokratischen Qualität digitaler Öffentlichkeit",
      "authors": [
        {
          "name": "D. Fenner",
          "authorId": "38959638"
        }
      ],
      "year": 2024,
      "abstract": "There is currently much discussion about the crisis or even the end of demo- cracy. In the initial phase of digitalisation, many hoped that the Internet, with its boundlessly open, egalitarian and interactive structure, would provide a boost to democratisation. This article is based\n on Jürgen Habermas' deliberative theory of democracy and examines whether the digital public sphere fulfils the requirements of a critical public sphere as a normative principle. The opportu- nities and risks of increasingly online public communication are weighed up against each other\n from various perspectives: e.g.with regard to participation, integration, orientation towards reason or the common good.",
      "citationCount": 0,
      "doi": "10.3196/004433024839033013",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/ece28dfde70e5054a33b906f6b43acdb037e6da6",
      "venue": "Zeitschrift für philosophische Forschung",
      "journal": {
        "name": "Zeitschrift für philosophische Forschung"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "aab6d40751bf0bf433e924692177ee2b06869d87",
      "title": "Three Rawlsian Rationales for a Cultural Turn in Digital Citizenship Education",
      "authors": [
        {
          "name": "Julian Culp",
          "authorId": "2260526700"
        }
      ],
      "year": 2025,
      "abstract": "\n This article defines and defends three Rawlsian rationales for a cultural turn in education for democratic citizenship within digitized societies. Due to the importance of political culture for realizing deliberative democracy, it is misguided to hold that a primary or exclusive focus of such education should be on learning how to use digital tools for engaging in politics. Pace this technique- or skills-oriented focus, this article argues that the educational responses to the wide-ranging cultural developments of the digital political public sphere should not be a matter of “training” but of “cultivation.” Accordingly, democratic education for digital citizenship should pay attention to nurturing citizens’ political virtues so that, when they are dealing with fundamental political questions, they are willing to comply with the requirements of public reason and a corresponding duty of civility.",
      "citationCount": 0,
      "doi": "10.1017/s0034670525000038",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/aab6d40751bf0bf433e924692177ee2b06869d87",
      "venue": "The Review of Politics",
      "journal": {
        "name": "The Review of Politics"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "7f88bd639445c88c151803d25a814b292a340122",
      "title": "Political Philosophy and What People Think",
      "authors": [
        {
          "name": "Avner de Shalit",
          "authorId": "146049531"
        }
      ],
      "year": 2020,
      "abstract": "ABSTRACT In a democracy what people think matters. Political philosophers are mostly democrats. They often justify deliberative and participatory democracy. And yet when it comes to philosophizing they often turn a blind eye to what people think; they sometimes even express profound doubts about what people think and about consulting the public. I call this the political philosophy gap. It has been justified in several ways. In this paper I first consider and dismiss the most common justifications. I then suggest a democratic and an epistemological reason why political philosophers should consider what people think when they formulate their theories. I put forward a proposal for a method of doing so, which I call public reflective equilibrium, and which consists of four stages of research and philosophy. Finally, I suggest that not only is it doable, but it has a potential to contribute a lot to contemporary political philosophy. It should not come instead of traditional ways of conducting political philosophy but as an additional, perhaps more political, method of political philosophy.",
      "citationCount": 26,
      "doi": "10.1080/24740500.2021.1876411",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/7f88bd639445c88c151803d25a814b292a340122",
      "venue": "",
      "journal": {
        "name": "Australasian Philosophical Review",
        "pages": "4 - 22",
        "volume": "4"
      },
      "publicationTypes": null
    },
    {
      "paperId": "de06977e7365cf9b08d2315563bc9807777b32d1",
      "title": "Lies, Bullshit, or Propaganda?",
      "authors": [
        {
          "name": "H. Arendt",
          "authorId": "2326038"
        }
      ],
      "year": 2022,
      "abstract": null,
      "citationCount": 0,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/de06977e7365cf9b08d2315563bc9807777b32d1",
      "venue": "",
      "journal": null,
      "publicationTypes": null
    },
    {
      "paperId": "4ebe18a39bfa3bfeaadce1246ed0afbca0885c37",
      "title": "Lies, Bullshit, or Propaganda?",
      "authors": [
        {
          "name": "M. Breul",
          "authorId": "2102418539"
        }
      ],
      "year": 2022,
      "abstract": "\n The notion of ‘Post-truth Politics’ and of the ‘Post-Factual’ are notoriously blurry. In this article, I distinguish the concepts of lies, bullshit, and propaganda. I argue that the post-factual displays elements of all three concepts, so that it can be either understood to be in continuity with using lies and bullshit as means of political discourse; or to discontinue the basic commitments of democracy by attacking the epistemic foundations. In a second step, I argue that the common orientation towards the ideal of public reason cannot be abandoned at will, so that any Post-truth Politics is bound to fail in the end. I defend a concept of deliberative democracy which has a robust understanding of the rationality of democratic deliberation. At the same time, I argue against the assumption that the solution to ‘post-factualism’ is a return to a fictitious ‘Age of Facts’ since there are not facts without interpretation.",
      "citationCount": 0,
      "doi": "10.30965/23642807-bja10031",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/4ebe18a39bfa3bfeaadce1246ed0afbca0885c37",
      "venue": "Interdisciplinary Journal for Religion and Transformation in Contemporary Society",
      "journal": {
        "name": "Interdisciplinary Journal for Religion and Transformation in Contemporary Society"
      },
      "publicationTypes": null
    },
    {
      "paperId": "4540b1b6b676cd6d6ac80da22071ec074e26b688",
      "title": "Against Anti-Democratic Shortcuts: A Few Replies to Critics",
      "authors": [
        {
          "name": "C. Lafont",
          "authorId": "35108708"
        }
      ],
      "year": 2020,
      "abstract": "In this essay I address several questions and challenges brought about by the contributors to the special issue on my book Democracy without Shortcuts. In particular, I address some implications of my critique of deep pluralism; distinguish between three senses of ‘blind deference’: political, reflective, and informational; draw a critical parallelism between the populist conception of representation as ‘embodiment’ and the conception of ‘citizen-representatives’ often ascribed to participants in deliberative minipublics; defend the democratic attractiveness of participatory uses over empowered uses of deliberative minipublics; clarify why accepting public reason constraints does not imply limiting deliberation to questions about constitutional rights; and argue that overcoming a state-centric conception of democracy does not require replacing the ‘all subjected’ principle with the ‘all affected’ principle.",
      "citationCount": 17,
      "doi": "10.16997/jdd.367",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/4540b1b6b676cd6d6ac80da22071ec074e26b688",
      "venue": "Special Issue: Democracy without Shortcuts",
      "journal": {
        "name": "Special Issue: Democracy without Shortcuts"
      },
      "publicationTypes": null
    },
    {
      "paperId": "14a2ea493bc40d6eb1f4399dfdd6f15a523b6e8c",
      "title": "Gramsci in the World. Edited by Roberto M. Dainotto and Fredric Jameson. Durham, NC: Duke University Press, 2020. 260p. $99.95 cloth, $26.95 paper.",
      "authors": [
        {
          "name": "Mihaela Czobor-Lupp",
          "authorId": "1416854861"
        }
      ],
      "year": 2021,
      "abstract": "reference to deliberative democracy, but the depth of reflection offered by, say, epistemic democracy is not given here beyond an insistence on the “affect.” Yet in a period of hyperpolarization is the “affect” truly the way forward? Of course, there is a long tradition—absent here—stretching back to Mandeville’s Fable of the Bees in which the pursuit of private vice is what leads to public virtue. Ultimately it is the figure of Dewey who stands behind the notion of “democratic subjectivity,” but how we might bring his “publics” back to life is not something that the book addresses in any detail. As Son himself readily admits, his cast of characters— Schumpeter, Dahl, Easton, Hayek, and Arendt—are quite “eclectic” (p. 13), and there is reason to question the influence they wielded on one another. Did cybernetics influence Schumpeter’s and Dahl’s theories of democracy? Dahl certainly seemed concerned about stability in the system, but Schumpeter famously rejected the Lausanne School of Economics’ focus on equilibrium, preferring to speak about competition for markets instead of competition within markets. Son is entirely right to point out that the type of neoliberalism theorized by Wendy Brown leaves one with a sense of “exhaustion and despair” (p. 10), but the merit of that analysis is to show how neoliberalism attempts to be all-encompassing, extending economic rationality to all aspects of life. As Thatcher once put it, “Economics are the method: the object is to change the soul.” With Dahl—who was in favor of workplace democracy—and Schumpeter we have different economic theories marrying with converging democratic theories, but with no clear sense of how their democratic theories were consciously reforming individual subjectivity, in the manner that neoliberalism and indeed cybernetics tried to. In chapter 5 on Hayek and Cold War neoliberalism, Son—echoing work done by, among others, Quinn Slobodian’s Globalists—shows how Hayek was in fact much more favorable to authoritarian regimes than to democracy as means to discipline modern economic man and preserve the economy. But he writes, “The resemblance between the democratic society Truman depicted [the New Deal] and the neoliberal civilization Hayek envisions is striking” (p. 134), later concluding that “despite the marginality of neoliberal economic policies, the postwar era brought American democracy remarkably close to the neoliberal social order envisioned byHayek” (pp. 143–44). Son claims his book combines the “history of ideas and normative political theory” (p. 12), but it is doubtful whether “resemblance” meets the criteria of influence that intellectual history would require. Nor is it clear, as the final chapter on Arendt tries to make out, that it was to totalitarianism that “instrumental democracy” was responding: both Schumpeter and Dahl were responding to the rise of socialism, but in different ways. “Fear of the masses” certainly haunted the development of postwar democratic theory, and Son is correct to point out that although that fear was long-standing, stretching at least back to the American founding and Plato himself, the Cold War was the first moment when it was integrated into a democratic theory rather than rejected. But what both Schumpeter and Dahl were responding to was the “elite” theory of Mosca, Pareto, and Michels. Son closes his book with a call to “create institutionalized space in which citizens are actually tasked with the responsibility of discussion and addressing their collective problems” (p. 181).What that might actually look like Son does not say, and the reader may be left wondering whether this is first and foremost an “ethical” project, free to take place within the confines of instrumental democracy. But if Dewey remains the reference point, then perhaps C. Wright Mills’s “radical ambition” of developing a “participatory democracy” that integrates elite rule, hinted at in the conclusion, is a good place to start. In identifying the transformation of postwar democratic theory, Son has taken an important step in that direction.",
      "citationCount": 0,
      "doi": "10.1017/S153759272100044X",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/14a2ea493bc40d6eb1f4399dfdd6f15a523b6e8c",
      "venue": "Perspectives on Politics",
      "journal": {
        "name": "Perspectives on Politics",
        "pages": "605 - 607",
        "volume": "19"
      },
      "publicationTypes": null
    },
    {
      "paperId": "6a36c130a6919a7b151b567cd33df66d47ef9169",
      "title": "Rökræða, þátttaka og þekking",
      "authors": [
        {
          "name": "Birgir Hermannsson",
          "authorId": "114436923"
        }
      ],
      "year": 2020,
      "abstract": "In this article I will analyze the democratic theories of Vilhjálmur Árnason, Gunnar Helgi Kristinsson and Jón Ólafsson, compare them with each other and with theories which emphasize general elections as the only democratic method. The aim of deliberative democracy is consensus built on reason, the aim of a reformed executive branch is a better quality of government and professional policy making, and the aim of epistemic democracy is to use the knowledge found among the general public to formulate the right policy or at least a better one. The models of democracy used by Vilhjálmur Árnason to analyze Icelandic democracy receive critical attention and his account of deliberative democracy is placed within a more general academic discourse on deliberative democracy. His conception of deliberative democracy is criticized for being too narrow and institutional. Vilhjálmur Árnason and Jón Ólafsson need to clarify the relationship between deliberative democracy and epistemic democracy and elections. Vilhjálmur Árnason, Gunnar Helgi Kristinsson and Jón Ólafsson are all criticized for placing excessive emphasis on reason and knowledge in relation to democracy and too little emphasis on democracy as a venue for contested opinions.",
      "citationCount": 1,
      "doi": "10.13177/irpa.a.2020.16.1.1",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/6a36c130a6919a7b151b567cd33df66d47ef9169",
      "venue": "Veftímaritið Stjórnmál og stjórnsýsla",
      "journal": {
        "name": "Veftímaritið Stjórnmál og stjórnsýsla"
      },
      "publicationTypes": null
    },
    {
      "paperId": "2d56eab030cb94ffe8664f20839ec95cea97edb1",
      "title": "Deliberation, participation and knowledge",
      "authors": [
        {
          "name": "Birgir Hermannsson",
          "authorId": "120788869"
        }
      ],
      "year": 2020,
      "abstract": "In this article I will analyze the democratic theories of Vilhjalmur Arnason, Gunnar Helgi Kristinsson and Jon Olafsson, compare them with each other and with theories which emphasize general elections as the only democratic method. The aim of deliberative democracy is consensus built on reason, the aim of a reformed executive branch is a better quality of government and professional policy making, and the aim of epistemic democracy is to use the knowledge found among the general public to formulate the right policy or at least a better one. The models of democracy used by Vilhjalmur Arnason to analyze Icelandic democracy receive critical attention and his account of deliberative democracy is placed within a more general academic discourse on deliberative democracy. His conception of deliberative democracy is criticized for being too narrow and institutional. Vilhjalmur Arnason and Jon Olafsson need to clarify the relationship between deliberative democracy and epistemic democracy and elections. Vilhjalmur Arnason, Gunnar Helgi Kristinsson and Jon Olafsson are all criticized for placing excessive emphasis on reason and knowledge in relation to democracy and too little emphasis on democracy as a venue for contested opinions.",
      "citationCount": 0,
      "doi": "10.13177/IRPA.A.2020.16.1.1",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/2d56eab030cb94ffe8664f20839ec95cea97edb1",
      "venue": "",
      "journal": {
        "name": "Icelandic Review of Politics and Administration",
        "pages": "1-22",
        "volume": "16"
      },
      "publicationTypes": null
    },
    {
      "paperId": "d668a5d967a0c57dd19098a7762cbf0959a6eb16",
      "title": "Public reason, democracy, and the ideal two-tier social choice model of politics",
      "authors": [
        {
          "name": "Cyril Hédoin",
          "authorId": "2281047746"
        }
      ],
      "year": 2024,
      "abstract": null,
      "citationCount": 2,
      "doi": "10.1007/s10602-024-09437-0",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/d668a5d967a0c57dd19098a7762cbf0959a6eb16",
      "venue": "Constitutional Political Economy",
      "journal": {
        "name": "Constitutional Political Economy",
        "pages": "388 - 410",
        "volume": "35"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "93a33ad6ab8c3203f634bc2148046d706e4de788",
      "title": "Uncivil Speech in the Social Media: Democracy, Political Liberalism, and the Virtue of Public Reason",
      "authors": [
        {
          "name": "L. Beckman",
          "authorId": "12137574"
        }
      ],
      "year": 2025,
      "abstract": null,
      "citationCount": 0,
      "doi": "10.1111/1467-8675.12807",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/93a33ad6ab8c3203f634bc2148046d706e4de788",
      "venue": "Constellations",
      "journal": {
        "name": "Constellations"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "b1652de70e79ca242332102f9a4b693d0286ab11",
      "title": "Truth, Deliberative Democracy, and the Virtues of Accuracy: Is Fake News Destroying the Public Sphere?",
      "authors": [
        {
          "name": "S. Chambers",
          "authorId": "46592078"
        }
      ],
      "year": 2020,
      "abstract": "Do fake news and what some have labeled our post-truth predicament represent a new and deadly challenge to the epistemic presuppositions of the public sphere? While many commentators have invoked Hannah Arendt to help answer this question, I argue that Arendt is the wrong place to look. Instead, I suggest that, on one hand, deliberative democracy and Jürgen Habermas’ idea of democracy as truth-tracking offer a more helpful framework for assessing and combating the threat of fake news and, on the other hand, Bernard Williams’ virtues of accuracy identify the citizen virtues necessary to counteract fake news. The virtues of accuracy, I contend, can be facilitated and encouraged through structural and regulatory features in the public sphere. We are indeed seeing a recalibration and significant push back on fake news due to both structural changes and ordinary citizens becoming more epistemically responsible consumers of digital information.",
      "citationCount": 109,
      "doi": "10.1177/0032321719890811",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/b1652de70e79ca242332102f9a4b693d0286ab11",
      "venue": "",
      "journal": {
        "name": "Political Studies",
        "pages": "147 - 163",
        "volume": "69"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "bcb72c0b9e94053b410e0874bfc3d85e2f238c0e",
      "title": "Does Public Reason Liberalism Rest on a Mistake? Democracy’s Doxastic and Epistemic Problems",
      "authors": [
        {
          "name": "J. Brennan",
          "authorId": "37854435"
        }
      ],
      "year": 2021,
      "abstract": "Public reason liberalism is a normative theory meant to adjudicate citizens’ conflicting beliefs about the right and the good. However, it rests upon controversial and likely mistaken empirical claims about voter psychology and voter knowledge. In political science, there are two major paradigms—populism and realism—about the relationship between voters’ beliefs and political outcomes. Realism holds that most citizens lack the kinds of beliefs and attitudes which public reason liberals believe are normatively significant. If so, then most citizens lack the kinds of ideological disputes which public reason liberalism is supposed to adjudicate. Worse, most citizens lack the kinds of normatively significantly beliefs upon which public justification must rest.",
      "citationCount": 8,
      "doi": "10.1093/OSO/9780192893338.003.0009",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/bcb72c0b9e94053b410e0874bfc3d85e2f238c0e",
      "venue": "",
      "journal": {
        "name": "",
        "pages": "135-155",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "3badfc9d91d30f099f362c8ea5fa503cbb0884f2",
      "title": "Constitutional adjudication and the changing content of public reason: some reflections on Wojciech Sadurski’s Constitutional Public Reason1",
      "authors": [
        {
          "name": "Jayani Nadarajalingam",
          "authorId": "1729507112"
        }
      ],
      "year": 2024,
      "abstract": "In Constitutional Public Reason, Wojciech Sadurski contributes to our understanding of constitutional liberal democracy by bringing together public reason, constitutional theory, and detailed constitutional law in a powerful and productive way. Sadurski’s account of public reason, one that is in many important respects different from John Rawls’s own account, correctly recognises the mutability of the content of public reason. I argue that the recognition of the mutability of the content of public reason, however, puts pressure on Sadurski’s characterisation of the relationship between courts and public reason.",
      "citationCount": 1,
      "doi": "10.4337/ccs.2024.01.10",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/3badfc9d91d30f099f362c8ea5fa503cbb0884f2",
      "venue": "Comparative Constitutional Studies",
      "journal": {
        "name": "Comparative Constitutional Studies"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    }
  ],
  "count": 25,
  "errors": []
}
