[search_philpapers.py] Connecting to Brave API for philpapers_via_brave search...
[search_philpapers.py] Searching philpapers.org: 'Hayek knowledge tradition conservatism', limit=30
[search_philpapers.py] Rate limited, backing off (attempt 1/5)...
[search_philpapers.py] Retrying after 1.3s backoff...
[search_philpapers.py] Rate limited, backing off (attempt 2/5)...
[search_philpapers.py] Retrying after 2.4s backoff...
[search_philpapers.py] Retrieved 15 entries...
[search_philpapers.py] Search complete: 15 entries found
{
  "status": "success",
  "source": "philpapers_via_brave",
  "query": "Hayek knowledge tradition conservatism",
  "results": [
    {
      "title": "Halina Šimo, Friedrich August von Hayek’s Critique of Conservatism",
      "url": "https://philpapers.org/rec/IMOFAV",
      "philpapers_id": "IMOFAV",
      "snippet": "The article examines Hayek’s arguments, discussing the conservative aversion to change, which positions them as weak defenders of liberty, and topics like the conservative emphasis on authority, attitude towards democracy, incorporating ethics and religion into politics, and introducing mysticism into societal considerations.",
      "page_age": null
    },
    {
      "title": "Straun Jacobs, Classical and Conservative Liberalism: Burke, Hayek, Polanyi and Others",
      "url": "https://philpapers.org/rec/JACCAC-6",
      "philpapers_id": "JACCAC",
      "snippet": "Economics, science and knowledge: Polanyi vs. Hayek.Philip Mirowski - 1998 - Tradition and Discovery 25 (1):1998-1999. Michael Polanyi and Spontaneous Order, 1941-1951.Struan Jacobs - 1997 - Tradition and Discovery 24 (2):14-28. F. A. Hayek.A. J. Tebble - 2010 - Continuum. The conservative ...",
      "page_age": null
    },
    {
      "title": "Scheall Scott, A Brief Note Concerning Hayek’s Non-Standard Conception of Knowledge",
      "url": "https://philpapers.org/rec/SCOABN",
      "philpapers_id": "SCOABN",
      "snippet": "Whatever F.A. Hayek meant by “knowledge” could not have been the justified true belief conception common in the Western intellectual tradition from at least the time of Plato onward. In this ...",
      "page_age": null
    },
    {
      "title": "Linda C. Raeder, The liberalism/conservatism of edmund burke and FA Hayek: A critical comparison",
      "url": "https://philpapers.org/rec/RAETLO",
      "philpapers_id": "RAETLO",
      "snippet": "The Liberalism/Conservatism of Burke and Hayek: A Critical Comparison.Linda C.",
      "page_age": null
    },
    {
      "title": "Chandran Kukathas, Hayek and modern liberalism",
      "url": "https://philpapers.org/rec/KUKHAM",
      "philpapers_id": "KUKHAM",
      "snippet": "Mill. In this book, Kukathas critically examines the nature and coherence of Hayek&#x27;s defense of liberal principles, attempting both to identify its weaknesses and to show why it makes an important contribution to contemporary political theory. Kukathas argues that Hayek&#x27;s defense of liberalism is unsuccessful because it rests on presuppositions which are philosophically incompatible.",
      "page_age": null
    },
    {
      "title": "Philip Mirowski, Economics, science and knowledge: Polanyi vs. Hayek",
      "url": "https://philpapers.org/rec/MIRESA-2",
      "philpapers_id": "MIRESA",
      "snippet": "Economics, Science, and Knowledge.Philip Mirowski - 1998 - Tradition and Discovery 25 (1):29-42. Friedrich Hayek and Michael Polanyi in Correspondence.Struan Jacobs &amp; Phil Mullins - 2016 - History of European Ideas 42 (1):107-130. Classical and Conservative Liberalism: Burke, Hayek, Polanyi ...",
      "page_age": null
    },
    {
      "title": "Graham Walker (ed.), The Ethics of F.A. Hayek",
      "url": "https://philpapers.org/rec/WALTEO-29",
      "philpapers_id": "WALTEO",
      "snippet": "Provides a philosophical and critical analysis of F.A. Hayek&#x27;s version of Classical Liberalism. Highlighting weaknesses of the agnostic, evolutionary ethics that Hayek, a recipient of the Nobel Prize in Economics, considers ...",
      "page_age": null
    },
    {
      "title": "Jeffrey Friedman, Hayek's Two Epistemologies and the Paradoxes of His Thought",
      "url": "https://philpapers.org/rec/FRIHTE",
      "philpapers_id": "FRIHTE",
      "snippet": "The other epistemology attributed to human and non-human organisms alike the error-prone interpretation of stimuli, which could never truly be said to be “knowledge.” Several of the paradoxes of Hayek&#x27;s economic and political thought that are explored in this symposium can be explained by the triumph of the first epistemology over the second, including his historical interpretation of socialism as a planning mentality; his tendentious definitions of “liberty” and “justice”; and his opposition to economic redistribution even as he endorsed all manner of economic and social regulations.",
      "page_age": null
    },
    {
      "title": "José A. Vidal Robson, Conservadurismo y liberalismo económico. La crítica de Scruton a Hayek",
      "url": "https://philpapers.org/rec/ROBCYL",
      "philpapers_id": "ROBCYL",
      "snippet": "The aim of this paper is to analyze the relation between conservatism and the doctrine of economic liberalism from the perspective of Roger Scruton’s critique to Friedrich A. Hayek. We carry ...",
      "page_age": null
    },
    {
      "title": "F. A. Hayek, Freedom, reason, and tradition",
      "url": "https://philpapers.org/rec/HAYFRA",
      "philpapers_id": "HAYFRA",
      "snippet": "Review of F. A. Hayek: The Fatal Conceit: The Errors of Socialism. [REVIEW]Tom G. Palmer - 1990 - Ethics 101 (1):192-193. George F. Hourani, Reason and Tradition in Islamic Ethics.",
      "page_age": null
    },
    {
      "title": "Jakub Wozinski, Hayek and Departure from Praxeology",
      "url": "https://philpapers.org/rec/WOZHAD",
      "philpapers_id": "WOZHAD",
      "snippet": "This opinion is based on Hayek’s application of Ernst Mach mind-body dualism criticism, Epicurean theory of irrational ethics and falsificationistic theory of knowledge related with atomistic view of the universe ... Setup an account with your affiliations in order to access resources via your University&#x27;s proxy server · Sign in / register and customize your OpenURL resolver ... The Current Evidence for Hayek’s Cultural Group Selection Theory.Brad Lowell Stone - 2010 - Libertarian Papers 2:45. Friedrich August von Hayek’s Critique of Conservatism.Halina Šimo - 2025 - Analiza I Egzystencja 69:117-138.",
      "page_age": null
    },
    {
      "title": "Joseph T. Salerno, Friedrich von Wieser and Friedrich A. Hayek: The General Equilibrium Tradition in Austrian Economics",
      "url": "https://philpapers.org/rec/SALFVW",
      "philpapers_id": "SALFVW",
      "snippet": "Les controverses concernant l\u0092affiliation intellectuelle de Hayek vis-à-vis de Friedrich von Wieser et l\u0092influence de ce dernier sur la pensée économique de Hayek, le statut de Wieser en tant que théoricien de l\u0092équilibre général, et les raisons pour lesquelles le jeune Hayek flirta avec la théorie de l\u0092équilibre général.Dans cet article je défends la thèse selon laquelle Hayek était conscient du fait qu\u0092il s\u0092inscrivait dans la tradition Wieserienne et qu\u0092il l\u0092était toujours même après sa réception du prix Nobel en 1974 et quand il fît la distinction entre cette tradition et la tradition inaugurée par Böhm-Bawerk et poursuivie par Mises.",
      "page_age": null
    },
    {
      "title": "Friedrich Hayek, The use of knowledge in society",
      "url": "https://philpapers.org/rec/HAYTUO-2",
      "philpapers_id": "HAYTUO",
      "snippet": "The Impossibility of a Complete ... When Knowledge Is Imperfect.David M. Levy - 1985 - Economics and Philosophy 1 (1):101-108. Emergence, Equilibrium, and Agent-Based Modeling: Updating James Buchanan’s Democratic Political Economy.Abigail N. Devereaux &amp; Richard E. Wagner - 2018 - In Richard E. Wagner, James M. Buchanan: A Theorist of Political Economy and Social Philosophy. Cham: Palgrave Macmillan. pp. 109-129. Cultural evolution true and false: A debunking of Hayek&#x27;s critics.Robert ...",
      "page_age": null
    },
    {
      "title": "Calvin M. Hoy, A philosophy of individual freedom: the political thought of F.A. Hayek",
      "url": "https://philpapers.org/rec/HOYAPO",
      "philpapers_id": "HOYAPO",
      "snippet": "In this incisive work, Calvin M. Hoy focuses exclusively on Hayek&#x27;s philosophy of individual freedom. Beginning with an analysis of Hayek&#x27;s definition of freedom, the author examines his proposed methods for ...",
      "page_age": null
    },
    {
      "title": "Edward Feser, Hayek on tradition",
      "url": "https://philpapers.org/rec/FESHOT-2",
      "philpapers_id": "FESHOT",
      "snippet": "Epistemic problems in Hayek’s defence of free markets.Jonathan Benson - forthcoming - Economics and Philosophy:1-23.",
      "page_age": null
    }
  ],
  "count": 15,
  "errors": []
}
