[search_philpapers.py] Connecting to Brave API for philpapers_via_brave search...
[search_philpapers.py] Searching philpapers.org: 'conservative political philosophy tradition value', limit=30
[search_philpapers.py] Rate limited, backing off (attempt 1/5)...
[search_philpapers.py] Retrying after 1.2s backoff...
[search_philpapers.py] Rate limited, backing off (attempt 2/5)...
[search_philpapers.py] Retrying after 2.9s backoff...
[search_philpapers.py] Retrieved 16 entries...
[search_philpapers.py] Search complete: 16 entries found
{
  "status": "success",
  "source": "philpapers_via_brave",
  "query": "conservative political philosophy tradition value",
  "results": [
    {
      "title": "Petar Šturanović, Conservative Political Philosophy",
      "url": "https://philpapers.org/rec/TURCPP",
      "philpapers_id": "TURCPP",
      "snippet": "The author deals with conservative political philosophy by analysing its foundations and outlining the changes that this doctrine has undergone from its inception to the present day. Paradoxically, for a doctrine whose essence is scepticism about change and a belief in the known, conservatism has changed its foundations, whether we are talking about an organic understanding of society, tradition, property or religion and family values...",
      "page_age": null
    },
    {
      "title": "Ferenc Horkay Hörcher, A Political Philosophy Of Conservatism",
      "url": "https://philpapers.org/rec/HRCAPP",
      "philpapers_id": "HRCAPP",
      "snippet": "Special attention is given to the relevance of local customs and traditions as well as participation, compromise and moderation in political activity. The book demonstrates that Aristotelian notions should be used to describe the actions and speeches of people active in politics, without losing sight of the normative dimension. In doing so, it presents an original argument which is both different from mainstream contemporary political philosophy and beneficial to our understanding of the role of practical reason in politics.",
      "page_age": null
    },
    {
      "title": "Camille E. Atkinson, Is Gadamer’s Hermeneutics Inherently Conservative?",
      "url": "https://philpapers.org/rec/ATKQGH",
      "philpapers_id": "ATKQGH",
      "snippet": "Forum Philosophicum: International Journal for Philosophy 14 (2):285-306 (2009) ... According to two critics, Georgia Warnke and John Caputo, Gadamer&#x27;s hermeneutics is inherently &quot;conservative&quot; insofar as he appeals to tradition as a constituent in understanding. They insist that he simply preserves the ideals, norms and values ...",
      "page_age": null
    },
    {
      "title": "Edmund Fawcett, Conservatism: the fight for a tradition",
      "url": "https://philpapers.org/rec/FAWCTF",
      "philpapers_id": "FAWCTF",
      "snippet": "The sharp polarisation of left and right is commonly dwelt on as the big political handicap of our times. Angry divisions on the right itself get less attention. Conservatism fills that ...",
      "page_age": null
    },
    {
      "title": "H. G. Callaway, Review of Horcher 2020, A Political Philosophy of Conservatism",
      "url": "https://philpapers.org/rec/CALROH-5",
      "philpapers_id": "CALROH",
      "snippet": "Hörcher aims to understand, elucidate and develop political conservatism in the long Aristotelian-Stoic tradition, emphasizes the role of character formation for statesmanship and political actors, the constraints implied by specific cultural traditions and the details of factual context, and addresses the contemporary standing and revival of Aristotelian virtue ethics and the specifically political virtue of prudence or “practical wisdom.” The book comes recommended by Harvard University historian James Hankins, who, on the back cover, recommends it for readers “disturbed by the collapse of statesmanship in the contemporary world.”",
      "page_age": null
    },
    {
      "title": "Roger Scruton, The Meaning of Conservatism",
      "url": "https://philpapers.org/rec/SCRTMO",
      "philpapers_id": "SCRTMO",
      "snippet": "Book Description: First published in 1980, this contribution to political thought is a statement of the traditional conservative position. Roger Scruton challenges those who would regard themselves as conservatives, and also their opponents. Conservatism, he argues, has little in common with liberalism, and is only tenuously related to the market economy, to monetarism, to free enterprise or to capitalism.",
      "page_age": null
    },
    {
      "title": "Richard Bourke, What is conservatism? History, ideology and party",
      "url": "https://philpapers.org/rec/BOUWIC-2",
      "philpapers_id": "BOUWIC",
      "snippet": "In restoring Burke to his original milieu, the argument presented here takes issue with 20th-century accounts of conservative ideology developed by such figures as Karl Mannheim, Klaus Epstein and Samuel Huntington. It argues that the idea of a conservative tradition is best seen as a belated construction, and that the notion of a univocal philosophy of conservatism is basically misconceived.",
      "page_age": null
    },
    {
      "title": "Tristan J. Rogers, Conservatism, past and present: a philosophical introduction",
      "url": "https://philpapers.org/rec/ROGCPA-3",
      "philpapers_id": "ROGCPA",
      "snippet": "Part I, &quot;Conservatism Past,&quot; presents a history of conservative ideas, exploring themes, such as the search for wisdom, the limits of philosophy, reform in preference to revolution, the relationship between authority and freedom, and liberty as a living tradition. Major figures include Aristotle, Saint Aquinas, Edmund Burke, G.W.F. Hegel, and Roger Scruton. Part II, &quot;Conservatism Present,&quot; applies philosophical conservatism to contemporary conservative politics, focusing on issues such as nationalism, populism, the family, education, and responsibility.",
      "page_age": null
    },
    {
      "title": "Matthew McManus, The political right and equality: turning back the tide of egalitarian modernity",
      "url": "https://philpapers.org/rec/MCMTPR-3",
      "philpapers_id": "MCMTPR",
      "snippet": "McManus presents an intellectual history of the conservative and reactionary tradition, stretching from Aristotle and Confucius to Ayn Rand and Patrick Deneen. Providing a comprehensive critical genealogy of the intellectual political right, McManus traces its core to a nostalgia for the hierarchical cosmos of antiquarian and scholastic thinking.",
      "page_age": null
    },
    {
      "title": "Russell Kirk, The conservative mind: from Burke to Eliot",
      "url": "https://philpapers.org/rec/KIRTCM",
      "philpapers_id": "KIRTCM",
      "snippet": "Moral Philosophy as Applied Science.Michael Ruse &amp; Edward O. Wilson - 2009 - In Philosophy After Darwin: Classic and Contemporary Readings. Princeton: Princeton University Press. pp. 365-379. A influência do pensamento conservador na concepção de democracia de Carl Schmitt.Cristina Foroni Consani &amp; Bruna Lourenço Dos Santos - 2023 - Dois Pontos 19 (2).",
      "page_age": null
    },
    {
      "title": "Matthew Freytag, MacIntyre’s Conservatism and Its Cure",
      "url": "https://philpapers.org/rec/FREMCA-8",
      "philpapers_id": "FREMCA",
      "snippet": "Conservative communitarian Alasdair MacIntyre makes a fundamental claim about the formal conditions for rationality, personhood, and intelligible valuation, and a detachable, less fundamental empirical claim that these formal conditions can be met only in a hierarchically organized social tradition.",
      "page_age": null
    },
    {
      "title": "Andrew Levine, Engaging Political Philosophy: From Hobbes to Rawls",
      "url": "https://philpapers.org/rec/LEVEPP-3",
      "philpapers_id": "LEVEPP",
      "snippet": "_Engaging Political Philosophy_ investigates the political philosophies of Hobbes, Rousseau, Locke, Mill, Rawls, and Marx and reveals the scope and limits of the philosophical tradition they helped to forge. Investigates the political philosophies of Hobbes, Rousseau, Locke, Mill, Rawls, and Marx.",
      "page_age": null
    },
    {
      "title": "Drew Maciag, Edmund Burke in America: the contested career of the father of modern conservatism",
      "url": "https://philpapers.org/rec/MACEBI",
      "philpapers_id": "MACEBI",
      "snippet": "Introduction : a search for icons -- Burke in brief : a &quot;philosophical&quot; primer -- Old seeds, new soil : the land of Paine -- John and J.Q. Adams : federalist persuasions -- Democratic America : the ethos of liberalism -- American Whigs : a conservative response -- The Gilded Age : eclectic interpretations -- Theodore Roosevelt : blazing forward, looking backward -- Woodrow Wilson : confronting American maturity -- Modern times : conjunctions and consensus -- Natural law : a neo-traditionalist revival -- The Cold War : existential threat redux -- Contemporary conservatives : victories and illusions -- Conclusion : a world without fathers. ... Conservatism History. Political science Philosophy",
      "page_age": null
    },
    {
      "title": "Paul Kengor, 11 principles of a Reagan conservative",
      "url": "https://philpapers.org/rec/KENPO-3",
      "philpapers_id": "KENPO",
      "snippet": "Analyzes President Reagan&#x27;s speeches and actions to paint a full, accurate picture of his conservative beliefs, and identifies the eleven principles that lie at the core of his conservatism.",
      "page_age": null
    },
    {
      "title": "Grant Havers, Leo Strauss and Anglo-American Democracy: A Conservative Critique",
      "url": "https://philpapers.org/rec/HAVLSA-2",
      "philpapers_id": "HAVLSA",
      "snippet": "In the Straussian view, the Anglo-American ideals of liberty, equality, and constitutional government owe more to the ancient Greek philosophers Plato and Aristotle than to the Christian tradition. In the process, Havers argues, Straussians end up rewriting history by falsely idealizing the ancient Greeks as the forerunners of modern liberal democracy, despite the Greek toleration of practices such as slavery and infanticide. Straussians also misrepresent statesmen of the Anglo-American political tradition such as Abraham Lincoln and Sir Winston Churchill as heirs to the ancient Greek tradition of statecraft, despite their indebtedness to Christianity.",
      "page_age": null
    },
    {
      "title": "David A. Kaden, Christianity in blue: how the Bible, history, philosophy, and theology shape progressive identity",
      "url": "https://philpapers.org/rec/KADCIB",
      "philpapers_id": "KADCIB",
      "snippet": "A robust tradition provides an anchor to avoid the illiberal trends in contemporary society, and a commitment to uplifting human personality provides a check against dehumanizing uses of Scripture and tradition.",
      "page_age": null
    }
  ],
  "count": 16,
  "errors": []
}
