[search_openalex.py] Searching OpenAlex: 'public reason tradition civic identity' (year=2015-2025), limit=30
[search_openalex.py] Retrieved 30 papers...
[search_openalex.py] Search complete: 30 papers found
[search_openalex.py] Cached results (cache key: openalex_f3245a3a7163fb2e)
{
  "status": "success",
  "source": "openalex",
  "query": "public reason tradition civic identity",
  "results": [
    {
      "openalex_id": "W2591654989",
      "doi": "10.1257/jel.53.4.898",
      "title": "Culture and Institutions",
      "authors": [
        {
          "name": "Alberto Alesina",
          "openalex_id": "A5083494527",
          "institutions": [
            "Bocconi University",
            "Harvard University"
          ]
        },
        {
          "name": "Paola Giuliano",
          "openalex_id": "A5044204764",
          "orcid": "https://orcid.org/0000-0002-3809-4108",
          "institutions": [
            "Anderson University - South Carolina",
            "UCLA Health",
            "University of California, Los Angeles"
          ]
        }
      ],
      "publication_year": 2015,
      "publication_date": "2015-12-01",
      "abstract": "A growing body of empirical work measuring different types of cultural traits has shown that culture matters for a variety of economic outcomes. This paper focuses on one specific aspect of the relevance of culture: its relationship to institutions. We review work with a theoretical, empirical, and historical bent to assess the presence of a two-way causal effect between culture and institutions. ( JEL D02, D72, I32, J12, Z13)",
      "cited_by_count": 1343,
      "type": "article",
      "source": {
        "name": "Journal of Economic Literature",
        "type": "journal",
        "issn": [
          "0022-0515",
          "1547-1101",
          "2328-8175"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "hybrid",
        "oa_url": "https://www.aeaweb.org/articles/pdf/doi/10.1257/jel.53.4.898"
      },
      "topics": [
        "Culture, Economy, and Development Studies",
        "Economic Policies and Impacts",
        "Experimental Behavioral Economics Studies"
      ],
      "referenced_works_count": 219,
      "url": "https://openalex.org/W2591654989"
    },
    {
      "openalex_id": "W4242918116",
      "doi": "10.7551/mitpress/11805.001.0001",
      "title": "Data Feminism",
      "authors": [
        {
          "name": "Catherine D’Ignazio",
          "openalex_id": "A5050163961"
        },
        {
          "name": "Lauren Klein",
          "openalex_id": "A5085919087",
          "orcid": "https://orcid.org/0000-0002-1511-0910"
        }
      ],
      "publication_year": 2020,
      "publication_date": "2020-03-10",
      "abstract": "A new way of thinking about data science and data ethics that is informed by the ideas of intersectional feminism. Today, data science is a form of power. It has been used to expose injustice, improve health outcomes, and topple governments. But it has also been used to discriminate, police, and surveil. This potential for good, on the one hand, and harm, on the other, makes it essential to ask: Data science by whom? Data science for whom? Data science with whose interests in mind? The narratives around big data and data science are overwhelmingly white, male, and techno-heroic. In Data Feminism, Catherine D'Ignazio and Lauren Klein present a new way of thinking about data science and data ethics—one that is informed by intersectional feminist thought. Illustrating data feminism in action, D'Ignazio and Klein show how challenges to the male/female binary can help challenge other hierarchical (and empirically wrong) classification systems. They explain how, for example, an understanding of emotion can expand our ideas about effective data visualization, and how the concept of invisible labor can expose the significant human efforts required by our automated systems. And they show why the data never, ever “speak for themselves.” Data Feminism offers strategies for data scientists seeking to learn how feminism can help them work toward justice, and for feminists who want to focus their efforts on the growing field of data science. But Data Feminism is about much more than gender. It is about power, about who has it and who doesn't, and about how those differentials of power can be challenged and changed. The open access edition of this book was made possible by generous funding from the MIT Libraries.",
      "cited_by_count": 1252,
      "type": "book",
      "source": {
        "name": "The MIT Press eBooks",
        "type": "ebook platform",
        "issn": null
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "hybrid",
        "oa_url": "https://direct.mit.edu/books/book-pdf/2390355/book_9780262358521.pdf"
      },
      "topics": [
        "Ethics and Social Impacts of AI",
        "Information Systems Theories and Implementation",
        "Qualitative Comparative Analysis Research"
      ],
      "referenced_works_count": 78,
      "url": "https://openalex.org/W4242918116"
    },
    {
      "openalex_id": "W2735244379",
      "doi": "10.1073/pnas.1702996114",
      "title": "On the promotion of human flourishing",
      "authors": [
        {
          "name": "Tyler J. VanderWeele",
          "openalex_id": "A5028103646",
          "orcid": "https://orcid.org/0000-0002-6112-0239",
          "institutions": [
            "Harvard University",
            "Quantitative BioSciences"
          ]
        }
      ],
      "publication_year": 2017,
      "publication_date": "2017-07-13",
      "abstract": "Many empirical studies throughout the social and biomedical sciences focus only on very narrow outcomes such as income, or a single specific disease state, or a measure of positive affect. Human well-being or flourishing, however, consists in a much broader range of states and outcomes, certainly including mental and physical health, but also encompassing happiness and life satisfaction, meaning and purpose, character and virtue, and close social relationships. The empirical literature from longitudinal, experimental, and quasiexperimental studies is reviewed in attempt to identify major determinants of human flourishing, broadly conceived. Measures of human flourishing are proposed. Discussion is given to the implications of a broader conception of human flourishing, and of the research reviewed, for policy, and for future research in the biomedical and social sciences.",
      "cited_by_count": 1136,
      "type": "article",
      "source": {
        "name": "Proceedings of the National Academy of Sciences",
        "type": "journal",
        "issn": [
          "0027-8424",
          "1091-6490"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "bronze",
        "oa_url": "https://www.pnas.org/content/pnas/114/31/8148.full.pdf"
      },
      "topics": [
        "Psychological Well-being and Life Satisfaction",
        "Employment and Welfare Studies",
        "Health disparities and outcomes"
      ],
      "referenced_works_count": 126,
      "url": "https://openalex.org/W2735244379"
    },
    {
      "openalex_id": "W2768147737",
      "doi": "10.1111/1468-4446.12319",
      "title": "The politics of social status: economic and cultural roots of the populist right",
      "authors": [
        {
          "name": "Noam Gidron",
          "openalex_id": "A5042496469",
          "orcid": "https://orcid.org/0000-0002-0217-1204",
          "institutions": [
            "Princeton University"
          ]
        },
        {
          "name": "Peter A. Hall",
          "openalex_id": "A5016493867",
          "orcid": "https://orcid.org/0000-0002-0871-9576",
          "institutions": [
            "Harvard University Press"
          ]
        }
      ],
      "publication_year": 2017,
      "publication_date": "2017-11-01",
      "abstract": "Abstract This paper explores the factors that have recently increased support for candidates and causes of the populist right across the developed democracies, especially among a core group of working‐class men. In the context of debates about whether the key causal factors are economic or cultural, we contend that an effective analysis must rest on understanding how economic and cultural developments interact to generate support for populism. We suggest that one way to do so is to see status anxiety as a proximate factor inducing support for populism, and economic and cultural developments as factors that combine to precipitate such anxiety. Using cross‐national survey data from 20 developed democracies, we assess the viability of this approach. We show that lower levels of subjective social status are associated with support for right populist parties, identify a set of economic and cultural developments likely to have depressed the social status of men without a college education, and show that the relative social status of those men has declined since 1987 in many of the developed democracies. We conclude that status effects provide one pathway through which economic and cultural developments may combine to increase support for the populist right.",
      "cited_by_count": 797,
      "type": "article",
      "source": {
        "name": "British Journal of Sociology",
        "type": "journal",
        "issn": [
          "0007-1315",
          "1468-4446"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "bronze",
        "oa_url": "https://onlinelibrary.wiley.com/doi/pdfdirect/10.1111/1468-4446.12319"
      },
      "topics": [
        "Populism, Right-Wing Movements",
        "Electoral Systems and Political Participation",
        "Media Influence and Politics"
      ],
      "referenced_works_count": 83,
      "url": "https://openalex.org/W2768147737"
    },
    {
      "openalex_id": "W2797202416",
      "doi": "10.2139/ssrn.3144139",
      "title": "Social Media, Political Polarization, and Political Disinformation: A Review of the Scientific Literature",
      "authors": [
        {
          "name": "Joshua A. Tucker",
          "openalex_id": "A5072046918",
          "orcid": "https://orcid.org/0000-0003-1321-8650",
          "institutions": [
            "New York University"
          ]
        },
        {
          "name": "Andrew M. Guess",
          "openalex_id": "A5048165961",
          "orcid": "https://orcid.org/0000-0003-2974-7848",
          "institutions": [
            "Princeton University"
          ]
        },
        {
          "name": "Pablo Barberá",
          "openalex_id": "A5010601798",
          "orcid": "https://orcid.org/0000-0002-9063-4829",
          "institutions": [
            "London School of Economics and Political Science"
          ]
        },
        {
          "name": "Cristian Vaccari",
          "openalex_id": "A5014666782",
          "orcid": "https://orcid.org/0000-0003-0380-8921",
          "institutions": [
            "Royal Holloway University of London",
            "University of Bologna"
          ]
        },
        {
          "name": "Alexandra Siegel",
          "openalex_id": "A5014610119",
          "orcid": "https://orcid.org/0000-0003-0792-7813",
          "institutions": [
            "New York University",
            "Stanford Medicine"
          ]
        },
        {
          "name": "Sergey Sanovich",
          "openalex_id": "A5027736166",
          "orcid": "https://orcid.org/0000-0003-4897-5264",
          "institutions": [
            "New York University"
          ]
        },
        {
          "name": "Денис Стукал",
          "openalex_id": "A5012749606",
          "orcid": "https://orcid.org/0000-0001-6240-5714",
          "institutions": [
            "New York University"
          ]
        },
        {
          "name": "Brendan Nyhan",
          "openalex_id": "A5010924288",
          "orcid": "https://orcid.org/0000-0001-7497-1799"
        }
      ],
      "publication_year": 2018,
      "publication_date": "2018-01-01",
      "abstract": null,
      "cited_by_count": 1104,
      "type": "review",
      "source": {
        "name": "SSRN Electronic Journal",
        "type": "repository",
        "issn": [
          "1556-5068"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "green",
        "oa_url": "https://papers.ssrn.com/sol3/Delivery.cfm?abstractid=3144139"
      },
      "topics": [
        "Misinformation and Its Impacts",
        "Social Media and Politics",
        "Hate Speech and Cyberbullying Detection"
      ],
      "referenced_works_count": 265,
      "url": "https://openalex.org/W2797202416"
    },
    {
      "openalex_id": "W3017863658",
      "doi": "10.1145/3359174",
      "title": "Reliability and Inter-rater Reliability in Qualitative Research",
      "authors": [
        {
          "name": "Nora McDonald",
          "openalex_id": "A5030100981",
          "orcid": "https://orcid.org/0000-0003-0216-5573",
          "institutions": [
            "Drexel University"
          ]
        },
        {
          "name": "Sarita Schoenebeck",
          "openalex_id": "A5021777354",
          "orcid": "https://orcid.org/0000-0002-8688-1595",
          "institutions": [
            "University of Michigan"
          ]
        },
        {
          "name": "Andrea Forte",
          "openalex_id": "A5025211180",
          "orcid": "https://orcid.org/0000-0002-2941-339X",
          "institutions": [
            "Drexel University"
          ]
        }
      ],
      "publication_year": 2019,
      "publication_date": "2019-11-07",
      "abstract": "What does reliability mean for building a grounded theory? What about when writing an auto-ethnography? When is it appropriate to use measures like inter-rater reliability (IRR)? Reliability is a familiar concept in traditional scientific practice, but how, and even whether to establish reliability in qualitative research is an oft-debated question. For researchers in highly interdisciplinary fields like computer-supported cooperative work (CSCW) and human-computer interaction (HCI), the question is particularly complex as collaborators bring diverse epistemologies and training to their research. In this article, we use two approaches to understand reliability in qualitative research. We first investigate and describe local norms in the CSCW and HCI literature, then we combine examples from these findings with guidelines from methods literature to help researchers answer questions like: \"should I calculate IRR?\" Drawing on a meta-analysis of a representative sample of CSCW and HCI papers from 2016-2018, we find that authors use a variety of approaches to communicate reliability; notably, IRR is rare, occurring in around 1/9 of qualitative papers. We reflect on current practices and propose guidelines for reporting on reliability in qualitative research using IRR as a central example of a form of agreement. The guidelines are designed to generate discussion and orient new CSCW and HCI scholars and reviewers to reliability in qualitative research.",
      "cited_by_count": 971,
      "type": "article",
      "source": {
        "name": "Proceedings of the ACM on Human-Computer Interaction",
        "type": "journal",
        "issn": [
          "2573-0142"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "bronze",
        "oa_url": "https://dl.acm.org/doi/pdf/10.1145/3359174"
      },
      "topics": [
        "Innovative Human-Technology Interaction",
        "Focus Groups and Qualitative Methods",
        "Information Systems Theories and Implementation"
      ],
      "referenced_works_count": 95,
      "url": "https://openalex.org/W3017863658"
    },
    {
      "openalex_id": "W2786983643",
      "doi": "10.1111/1468-4446.12325",
      "title": "Ethno‐nationalist populism and the mobilization of collective resentment",
      "authors": [
        {
          "name": "Bart Bonikowski",
          "openalex_id": "A5023494795",
          "orcid": "https://orcid.org/0000-0003-0107-0644",
          "institutions": [
            "Harvard University Press"
          ]
        }
      ],
      "publication_year": 2017,
      "publication_date": "2017-11-01",
      "abstract": "Abstract Scholarly and journalistic accounts of the recent successes of radical‐right politics in Europe and the United States, including the Brexit referendum and the Trump campaign, tend to conflate three phenomena: populism, ethno‐nationalism and authoritarianism. While all three are important elements of the radical right, they are neither coterminous nor limited to the right. The resulting lack of analytical clarity has hindered accounts of the causes and consequences of ethno‐nationalist populism. To address this problem, I bring together existing research on nationalism, populism and authoritarianism in contemporary democracies to precisely define these concepts and examine temporal patterns in their supply and demand, that is, politicians’ discursive strategies and the corresponding public attitudes. Based on the available evidence, I conclude that both the supply and demand sides of radical politics have been relatively stable over time, which suggests that in order to understand public support for radical politics, scholars should instead focus on the increased resonance between pre‐existing attitudes and discursive frames. Drawing on recent research in cultural sociology, I argue that resonance is not only a function of the congruence between a frame and the beliefs of its audience, but also of shifting context. In the case of radical‐right politics, a variety of social changes have engendered a sense of collective status threat among national ethnocultural majorities. Political and media discourse has channelled such threats into resentments toward elites, immigrants, and ethnic, racial and religious minorities, thereby activating previously latent attitudes and lending legitimacy to radical political campaigns that promise to return power and status to their aggrieved supporters. Not only does this form of politics threaten democratic institutions and inter‐group relations, but it also has the potential to alter the contours of mainstream public discourse, thereby creating the conditions of possibility for future successes of populist, nationalist, and authoritarian politics.",
      "cited_by_count": 606,
      "type": "article",
      "source": {
        "name": "British Journal of Sociology",
        "type": "journal",
        "issn": [
          "0007-1315",
          "1468-4446"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "bronze",
        "oa_url": "https://onlinelibrary.wiley.com/doi/pdfdirect/10.1111/1468-4446.12325"
      },
      "topics": [],
      "referenced_works_count": 126,
      "url": "https://openalex.org/W2786983643"
    },
    {
      "openalex_id": "W2979799401",
      "doi": "10.1111/1467-8675.12429",
      "title": "Democracy and lottery: Revisited",
      "authors": [
        {
          "name": "Hubertus Buchstein",
          "openalex_id": "A5087461497",
          "institutions": [
            "Universität Greifswald"
          ]
        }
      ],
      "publication_year": 2019,
      "publication_date": "2019-09-01",
      "abstract": "In the Italian republic of Genoa the members of the city council were selected by random selection from the 12th century on. Over time, the gambling-crazed residents of the city began to bet on who would win a seat and called this a lottery. A few decades later, this developed into the numbers games that have remained popular to this day. From Italy the original Old Germanic word11 Meaning fortune telling and fate in Old Germanic. slowly found its way to the Netherlands and later into the English vocabulary and (as a kind of reimportation with a different meaning) into German as well, to denote all sorts of games based on a random mechanism. It is, however, worth reminding political theorists that the word lottery has a political origin and that the recent comeback of lotteries as a means for democracy fits nicely into this etymology. This complex etymology also reminds us to be open to a broad and many faceted understanding of the role of lotteries in politics. It seems that recently, however, the role of sortition22 In the following I use the terms lottery, sortition, and random mechanism interchangeable. in politics has been narrowed to its instrumental function of selecting members of deliberative opinion polls' respective mini-publics.33 I use the terms deliberative opinion poll and mini-publics interchangeably in this article. As it is well known today, the selection of political offices by lottery—even though they were named kleros in those days—had a traditional place in ancient Greek democracies. In contrast to that tradition, modern democracies rely on elections as the main means of fill political positions. Over the last 20 years we can observe an impressive renaissance of the lottery as a democratic device. Taking inspiration from the early contributions of authors like Robert Dahl, Peter Dienel, and Ned Crosby in the 1970s,44 On these forerunners, see Sintomer (2007); Setälä and Smith (2018). a growing body of literature today highlights the benevolent impact of randomly selecting citizens for deliberative opinion polls' respective mini-publics55 The deliberative opinion poll is today mostly connected to the work of James Fishkin. See Fishkin (2009, 2018a, 2018b); Brown (2018); Floridia (2018). or even for selecting them for certain political offices.66 See Carson and Martin (1999); Dowlen (2008); Delannoi and Dowlen (2010); Lopez-Rabatel & Sintomer (2018); van Reybrouck (2016); Sintomer (2018). Reform proposals that include lotteries have lost their marginal status, at least in the academic milieu of modern democrats, and have even become a centerpiece of many current political reform proposals. In particular, the format of mini-publics has become attractive to some authors as an alternative to pure electoral democracy; for them mini-publics and other bodies of selected by lot citizens are presented not only as supplements to existent electoral democracy but also as institutions that are supposed to substitute them.77 See Barnett and Carty (2008); Callenbach and Phillips (2008); O'Leary (2006); Reybrouck (2016); Sutherland (2008). Ten years ago I started to propagate lotteries as a means to democratize modern democracies and to transfer the political competence to make binding political decisions to those chosen by lot.88 See Buchstein (2009, 2010). Over the last 10 years has emerged an even more widely shared euphoria among quite a number of political scientists about the use of lotteries to promote democracy. However, such euphoria on the part of so many political scientists has made me suspicious and given reason to a set of concerns and questions: what is the political meaning of the surprising comeback of the lottery in the democratic toolkit today, more than 2,000 years after the fall of ancient democracies? Can one register its comeback in political theory and practice as a potential step forward in the project of democratizing democracy? Are mini-publics meant to be part of a serious attempt to move beyond traditional parliamentary democracy? Is the return of the lottery in this context any more than a desperate and helpless attempt to escape from the political realities at a time of growing social and political polarization in western democracies and of feelings that liberal democracy is in crisis? Is it meant as a response to this crisis or is it ignorant to it? Is the return of the lottery more than nostalgia for Athens's alleged radical demokratia? Or is it just the artificial product of the institutional turn in the academic discourse on deliberative democracy? I will not be able to answer this cascade of critical questions in this article. Instead, I first reflect on the proper role of selected by lot bodies of citizens against the background of recent criticisms of mini-publics, of which the most prominent were put forward by Christina Lafont (section 2). In order to come to terms with her criticism and to dicuss the appropriate use of lotteries in the context of the current wave of literature it may be helpful to revisit some of the basic arguments for decision-making by random mechanisms in modern democracy. Hence, I want to broaden the narrow view on lotteries in the context of mini-publics with a reminder of the five main and more general arguments that have been put forward to defend random mechanisms for decision-making. My list puts particular emphasis on the advantages of lotteries for making efficient and productive decisions and for avoiding corruption (section 3). Pointing out the broad and many faceted potential of lotteries in politics is also a reminder to us to revisit critically the current narrative of the pure democratic meaning of lotteries in ancient democracies (section 4). In the last sections of the article I defend the introduction of lotteries in modern democracies along the line of their potential capacity to produce efficient decisions and to make corruption more difficult (section 5) in two ways: with respect to the internal distribution of political positions in parliaments, using the European Parliament as an example (section 6), and to finding a solution for the dilemma that members of parliament (MPs) face when it comes to making decisions on their own payment and on electoral rules (section 7). Whereas mini-publics were initially used proposed in order to provide a space for discussions among citizens and for them to consult professional politicians, in a significant number of cases of duly elected or appointed authorities have announced in advance that they would follow the decision made by the randomly selected mini-public (Bächtiger, Dryzek, Mansbridge, & Warren, 2018, p. 16). I also argued strongly for the transfer of the competence to make binding political decisions to mini-publics (Buchstein, 2009, 2010). My considerations were based on the following empirical observation: members of selected by lot deliberative bodies develop a manifest problem of motivation if the relationship between the deliberative project and the final decision-making actually made remains weak, or if no such relationship can be easily recognized by those involved. \"Why,\" Rainer Schmalz-Bruns rightly asked at the early phase of the invention of mini-publics, \"should people contribute the considerable time and effort to a process at all if there is no guarantee that the results will be transformed directly into governance strategies for implementation?\" (Schmalz-Bruns, 1995, p. 268). Accompanying research on participative projects following the model of Fishkin et al. also indicated how important it was for the members of deliberative bodies to consider the relevance of the results to decision-making to those in charge (Font & Blanco, 2007, pp. 579–581; Ryfe, 2002, pp. 366–368). In the light of these empirical findings, 10 years ago I saw that the possibilities of mini-publics boiled down to two options. One could either continue to work with mini-public experiments and projects that lacked any committed or binding decision-making status, thus turning them into some kind of measurement of civic education. Or one chooses to reinforce the political standing of mini-publics and integrate them into existing institutional arrangements with a clearly defined and binding set of competencies. Along this line of argument, strengthening the political position of mini-publics would also provide incentives for citizens to participate in and enter considered deliberations. André Bächtiger et al. correctly state that in discussing the pros and cons of mini-publics \"a great deal will rest on whether or not a mini-public makes binding decisions for the polity\" (Bächtiger et al., 2018, p. 16). Christina Lafont addresses her recent critique of mini-publics explicitly at the authors who demand a formal status for mini-publics as binding decision-makers (Lafont, 2015, 2017, 2019). As a matter of fact, most advocates of mini-publics do not endorse such demands and mini-publics have so far rarely made binding decisions in political practice.99 See Fishkin (2018a, p. 319); Niemeyer and Jennstal (2018, p. 331); Setälä and Smith (2018, p. 310). Nevertheless, her critical considerations are an important starting point for locating the proper place for mini-publics in modern democracies. To make her point, she distinguishes between two main strands of the normative arguments shared by the current proponents of mini-publics. Taken seriously, both positions must finally lead to a substitution of electoral democracy in the name of a better, deliberative democracy. The two justifications are based either in the name of full and equal democracy or on the idea of a reasonable democracy. In my brief discussion of Lafont's objections to both of them, I call them the equal democracy position and the responsible democracy position. The equal democracy position starts with the basic presupposition that every citizen has an equal chance of being given a political position.1010 Proponents of this strand are Oliver Dowlen (2008) and recently, David van Reybrouck (2016). One aspect of this presupposition concerns the fair distribution of chances for efficient political participation and is based on three assumptions. The first is the idea that the process of random selection functions like a kind of a search engine for political arguments and talents, as it includes people who would not be able or willing to run for office either because they fear rejection or because they consider their chances are too low (and they cannot blame random selection for this) within the pool of individuals whose political action is solicited. Second, one could argue that phenomena of political alienation and disenchantment with politicians might be diminished by the fact that the process of random selection grants more citizens insights into complex political issues. And third, it may be assumed that the decisions made by people who take office or receive a seat in a political body based on a random selection procedure are strongly binding because they are affected by the problems, life experiences, and value judgments of the participating citizens. The other aspect of the claim to equal democracy lies in the alleged fair representation that lotteries generate. The ideal on which this concept of representation lies has been critically called by Hanna Pitkin \"mirror representation\" (Pitkin, 1967, pp. 71–75). This justification of deliberative opinion polls has a serious flaw. After their deliberations the members of the selected by lot group of citizens are no longer simply mirroring the people. At this stage they are supposed to have new and more informed preferences. Hence, instead of truly mirroring the people they have become a kind of beautifying mirror of the citizenry. This change has to do with the connection constructed by theorists of selected by lot mini-publics to the theory of deliberative democracy and to their insistence that it provides a reasonable democracy. The reasonable democracy position1111 The most prominent proponent of this strand are James Fishkin (2009, 2018a) and Yves Sintomer (2018). puts its legitimating emphasis on the considered deliberation of the selected by lot citizens. Proponents of this view see a tension between considered deliberation and mass participation. In this legitimating conflict, they opt for the best quality deliberative procedures and the advantages of considered deliberation in small, face-to-face groups. Some of them even argue that these deliberations should be held behind a veil of secrecy as they fear that the glare of publicity would have harmful effects. The core of the responsible democracy position is an epistemic claim: its advocates argue that through the process of deliberation the participants will change their original preferences into better informed and morally better defendable preferences. Hence, the process of deliberation in mini-publics is understood as a kind of communicative filter system in order to produce a \"laundering of preferences\" (Goodin, 1986, p. 81). Or, put it in the words of one of the philosophical founding fathers of deliberative democracy, Jürgen Habermas; deliberations have \"an epistemic dimension because they create room for arguments to exert their preference-changing force\" (Habermas, 2018, p. 874). A democracy that works well is understood as a political system that \"as a whole is filtered through deliberation\" (Habermas, 2018, p. 877) and thus contributes to the rationalization of politics.1212 For a critical discussion of this semantic move in the history of democratic theory see Jörke and Buchstein (2007). With respect to mini-publics, however, certain normative problems arise in making the case for bypassing the general public in the name of their high deliberative qualities. Both Christina Lafont and Marit Böker have recently argued that mini-publics diminish rather than increase the legitimacy of democracy. Böker insists on the Kantian, Rawlsian, and Habermasian principle that the legitimacy of political authority must \"be based on argumentative justification through public reasoning to those subject to it\" (Böker, 2017, p. 23) and reminds her reader that mini-publics are typically used as an instrument of government and thus fail the emancipatory potential of democracy. Whereas Böker's critique includes a questionable evaluation of the empirical evidence of the emancipatory effects of mini-publics, Christina Lafont's critique may sound less radical, but really aims at the heart of the responsible democracy position. Mini-publics lack any mechanism of accountability or direct authorization from the wider citizen body. The members of the selected by lot group undergo process of preference change so that their views are no longer representative of the broader public. In case of a conflict between the views of the broader public and the participants of a mini-public Lafont argues against the \"blind deference\" (2015, p. 57) of the former to the latter. Why should citizens blindly defer to decisions made by a randomly picked group of people partaking in a deliberative opinion poll even in such cases in which they strongly disagree with the result? Take, for example, hotly contested policy issues like abortion rights and gun control in the USA, new speed limit regulations for the autobahn in Germany, or Brexit in the UK. In a society characterized by growing political polarization along identity lines it has become more difficult to reach a consensus or a compromise on certain reasonable decisions within mini-publics (Karpowitz & Mendelberg, 2018; Mutz, 2006). Hence authorizing mini-publics to make binding decisions will probably lead to even stronger political estrangement and a growing political climate of suspicion and accusations of conspiracy than what is experienced in the current electoral system. Mini-publics that make unpopular political decisions have the potential to challenge even more thoroughly the perceived legitimacy of the political order than elected bodies. In my view, the growing political polarization in most democracies has made the introduction of mini-publics a less attractive reform option than it may have been 10 years ago. Christina Lafont has pointed out that the justification of authorizing mini-publics to make binding political decisions faces an additional theoretical problem (Lafont, 2019, p. 59). In nearly all cases favoring the introduction of mini-publics the two lines of argument mentioned above intermingle with each other in one way or the other. Most authors claim that they can have it both ways simultaneously: they praise the representativeness of the selected by lot mini-public and they add to it the rational potential of considered deliberation. However, as Lafont has pointed out, the mirror claim and the filter claim do not go together well. On the one hand, a mini-public can be understood metaphorically as a mirror only as long as no considered deliberation has occurred; and the filtered version of the original preferences differs from the original picture in many ways, which is exactly what deliberation among these participants is supposed to bring about. On the other hand, the proceedings of a mini-public can be understood truly as a filter, only in so far as it loses its mirror-like quality. By pointing to these two contradictory claims, Lafont concludes that the political idea of reforming modern democracies via the introduction of mini-publics to make binding decisions faces a logical dilemma that collapses the two approaches in different, one-sided directions. If one follows the responsible democracy claim, the concepts finally merge into an elite conception of democracy that demands \"blind deference to experts\" (Lafont, 2019, p. 56). If one follows the equal democracy claim the proposal has to resist the priority of decisions by more enlightened participants of mini-publics and \"collapses into … a version of blind deference to the majority\" (Lafont, 2019, p. 62). Christina Lafont's critique of the idea of giving mini-publics the competence to make binding decisions at the centerpiece of a democratic reform agenda is well taken and convincing. In her conclusions she echoes the statement by André Bächtiger et al. that in the discussion about the pros and cons of mini-publics \"a great deal will rest on whether a mini-public makes binding decisions for the polity\" (Bächtiger et al., 2018, p. 16). Her recommendation is not to abandon the idea of selected by lot bodies of citizens altogether but to remove it from the sector of binding decision-making into a consultative role and into the sphere of participatory civic education, calling this move the politics of \"deliberative activism.\" According to her, the of mini-publics behind the competence is as their only role in a modern democracy is to decision-making by their into the public (Lafont, 2015, p. 56). there seems to be no way to defend the of mini-publics for the of binding political This that Christina Lafont has her critique on all the arguments making the case for mini-publics. However, there are additional and different arguments that she has not taken in her To bring them to a brief reminder of the general arguments for lotteries in politics may the case for mini-publics as well. In her criticism of mini-publics Christina Lafont rightly that their legitimacy on the kind of issues that should be for by (Lafont, 2019, p. that of the have not for this (Lafont, 2019, p. This statement can be more as it other of the lottery as an instrument in modern democracies. I the that Christina Lafont has and move beyond the idea to the use of lotteries with the of equal democracy and responsible democracy, I want to revisit some of the of random decision-making in politics. can or should lotteries be in politics at It would be and lead only to an were we to lotteries for the decision to is no the fact that we must for there are five general arguments than can be made for using lotteries in See Buchstein pp. I call this set the full for making decisions based on a random mechanism. In this case we have to a lottery to at a final a in of a in for a political The decision argument makes particular with respect to decisions the like it to at a and Some time ago in this cases of cases of and alternative decisions are pp. In such cases it is an of reason that chance should the insistence on decisions would be to a because one to the of According to this argument, lotteries are in the of all those participants in a decision-making In lotteries all participants are equal in the that they are all subject to the that the lot will fall to them In any argument there is the that all participants in the lottery have an equal number of the number of to be we would of a The for the use of lotteries in politics is the of for offices in ancient Greek democracy. A argument with the effects of lotteries for political It not deal with for but rather its in bodies. The of this argument the of lotteries for in political bodies in its to at fair The for the of representation is a with a of a The deliberative of this argument is less with an mirroring of society than with an increase in the social of those political bodies that can be by being that a number of and can be taken into in the political This argument as the for both the and the responsible democracy position. argument that a lottery has the potential to increase the of political institutions and The of a lottery is that it is and so there are no more decision-making to be are to and by so too are and of a decision-making argument at the of is that the lottery, as a is a with most other political lotteries demand of time and other and are procedures and rules that at the of the in politics. in to lotteries may also be used when no more deliberation seems to lead to a This may be as an of the argument, for in certain lotteries can be on the that they will have productive but it is more The effects as a as in the case of also of such random in and The basic idea is the in all those subject to the rules are in a state of as to whether and when a more will be thus them to to the is such a lotteries to The five arguments can claim of one in the political history of and also in recent justifications of the of they are to one which is not helpful in the for lotteries in certain institutional This is with respect to the about the reform of modern As mentioned in the of this in the current about the of lotteries for deliberative opinion polls the main emphasis is put on the and the representative In my attempt to revisit lottery and democracy, I a different way and my case on the and the long of the argument to the project to revisit the lottery and democracy has to include the way that the of lotteries are presented in current literature in the history of political It would be worth through all in which and other authors have the lottery in order to that the by and like the democratic meaning of the lottery in ancient See and In the following I will at least a few to with the democratic narrative of For a more critique of and see Buchstein From the of those who considered to be reasonable in ancient the decision to use it was based on on and on This was only against the background of an characterized by as of on the part of the of the Greek pp. which in its political According to ancient two functions above all were to the lottery in ancient democracies. In with and the rules of between offices the lottery makes political more efficient because it to between citizens to And the lottery functions also as a against corruption and as the of political evidence of both functions of can be found in ancient To just a in of how the used to the in order to in A example for avoiding conflict among is to be found in of the lot of who are by lottery, the who the the or the In they take that the will not be for more than two In the that more than one to the they and her to the The of In and the of the lottery mechanism is supposed to arguments between about The to from the which was also to for a long time, but was probably by of is a In this lot and elections are both mentioned as being appropriate for democratic but the quality of conflict is also to the democratic to provide for by lot to the less important and the of the offices thus will be to in The works of the for more important offices are appointed by The is called the and the from the into the which is the as on the This is selected by lot to if the should make the The of also when for the of the and cases to by this is that … it may not be for to to have the The of was not the only one among who such a view of the advantages of A by from the time in which selecting by lot first",
      "cited_by_count": 29,
      "type": "article",
      "source": {
        "name": "Constellations",
        "type": "journal",
        "issn": [
          "1351-0487",
          "1467-8675"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "hybrid",
        "oa_url": "https://onlinelibrary.wiley.com/doi/pdfdirect/10.1111/1467-8675.12429"
      },
      "topics": [
        "Electoral Systems and Political Participation",
        "Social Media and Politics",
        "Public Administration and Political Analysis"
      ],
      "referenced_works_count": 37,
      "url": "https://openalex.org/W2979799401"
    },
    {
      "openalex_id": "W4361251882",
      "doi": "10.1111/1467-8675.12661",
      "title": "Being a master of metaphors",
      "authors": [
        {
          "name": "Hubertus Buchstein",
          "openalex_id": "A5087461497",
          "institutions": [
            "Universität Greifswald"
          ]
        }
      ],
      "publication_year": 2023,
      "publication_date": "2023-03-01",
      "abstract": "In his political interventions, Jürgen Habermas is a first-class rhetorician. His writing style is eloquent, polemical, rich in aperçus and metaphors, and often affective, especially angry (see Möllers, 2021, p. 85). But there are also many metaphors in his contributions to philosophy, social theory, and political theory in which he clearly restrains himself rhetorically. Metaphors appear at crucial points in his theory formation. Formulations like the dialogical give and take of reasons \"in kleiner Münze\" (small coins), the discursive \"Verflüssigung\" (liquefaction) of traditions, the \"colonization\" of the lifeworld, the \"center and periphery\" of modern democracies, or their institutional \"sluices\"—a metaphor he has adopted from Bernhard Peters—create suggestive images in the minds of his readers. The author, who insists on the strict differentiation between day-to-day language, literary language, and the language of the social sciences (see Habermas, 1990a), and whose philosophical self-understanding insists on the \"unforced force of the better argument\" is a master of evocative metaphors. This attribute alone makes it a pleasure to read his texts. The German edition of his new book does not disappoint those readers in search of metaphors either. In the Marxist tradition (see Marx, 2011), a number of metaphors are borrowed from the sphere of geology: \"segments\" (p. 33)1 of the population, \"erosion\" of democracy (p. 87), normative \"slopes\" (p. 15), the \"crumbling\" of the political system (p. 109), or the \"solidified lava\" of anti-authoritarianism in Silicon Valley (p. 46). Some of the metaphors are nautical like normative \"anchors\" (p. 16), or from the theatre, like the \"grimace\" of libertarian political thought (p. 46). Only a few of them belong to organic life: the \"root ground\" of political culture (p. 32), the \"Gleichursprünglichkeit\" (co-originality) of democracy and the rule of law (p. 90), or the \"nesting\" of normative expectations (p. 14). Most of Habermas' metaphors belong to the vocabulary of the technical world: the \"building\" of modern democracy (p. 9), \"centrifugal\" forms of communication (p. 43), the \"architecture\" of constitutional democracy (p. 32), the \"net of historical memory\" (p. 30), the \"Sollbruchstelle\" (predetermined breaking point) of political rights (p. 92), the \"web of attitudes\" (p. 30), the \"social bond\" (p. 31), civil society as an \"early warning system\" (p. 80)—and again the \"flow chart\" of the political system and its \"filters\" and \"sluices\" (p. 24, 100). One has to wait until the last paragraph of the book to find a military metaphor. Now is the time \"den Spieß umzudrehen\"2 (p. 109) and fight the coalition of conspiracy theorists and right-wing populists. Taking Habermas' preference for technical metaphors into account, it comes as no surprise that he has speaks of \"echo chambers\" (p. 45) and \"fragmentation\" (p. 45) in his critical analysis of the digital public sphere. The spatial metaphor of öffentlicher Raum (Raum can literally be translated as unlimited space and as clearly limited room) is combined with the technical vocabulary of systems-theory when he mentions the \"input,\" \"throughput,\" and \"output\" components of the institutional infrastructure of the public sphere (pp. 38–39). In one passage of the book, Habermas even addresses the problems of metaphorical writing and states that his metaphor Raum \"must not be overstated\" (p. 60). He may have written this sentence from an unfortunate experience. More than once he has become the victim of his metaphor-rich writing style as critics have claimed that formulations like the \"colonization of the lifeworld\" are too vague to have real analytical power in the field of social research. Another example is the term \"ideal speech situation.\" Habermas originally developed the ideal speech situation 1970 in On the Pragmatics of Social Interaction as an epistemological tool used to test the validity of what is essentially true or actually the case (see Habermas, 2001). In this new book, Habermas once again pushes back vehemently against the \"stubborn misunderstanding\" (p. 69) about this term. First, he points out that he has not used \"this misleading expression\" since his 1972 essay on theories of truth. Second, the catchy formulation was never meant to be a blueprint for political institutions, but as a metaphor for the bundle of pragmatic assumptions that we actually always have to start from when we enter into a discourse about validity claims. Nevertheless, some early advocates of the digital revolution in the first half of the 1990s like Howard Rheingold, Nicolas Negroponte, or WIRED magazine authors like John Katz used Habermas' notions of the ideal speech situation and the unrestricted flow of communication in the public sphere as justification for their dreams of a new virtual democracy.3 According to them, the World Wide Web was the technical incarnation of the ideal speech situation. In their view, the Internet matches all basic requirements of a public sphere that comes as close as possible to the normative core of deliberative democracy: The World Wide Web as the communicative infrastructure for open, unlimited, universal, anti-hierarchical, and complex political interaction. To the radical techno-optimists of those days, the Internet created a new political model, since it offered universal access, freedom of expression, unrestricted agendas, uncoerced communication, and political participation outside of traditional political institutions. Habermas reminds the readers of his new book of the big \"emancipatory promise\" of the \"egalitarian and unregulated\" (p. 45) communicative relationships that were propagated at the beginning of the digital age. And indeed, the positive qualities attributed to political communication in the Internet by Rheingold and other optimists of electronic democracy in the 1990s strikingly resemble Habermas' vocabulary (see Buchstein, 1997, pp. 250–251). In his book The Theory of Communicative Action, Habermas defined the public sphere as \"a virtually present network of communication\" (Habermas, 1987, p. 390) that is freed from any spatiotemporally restricted context. Ten years later, in his outline of the deliberative democratic ideal, he advocated a \"decentred society\" in which \"subjectless forms of communication […] regulate the flow of deliberations\" (Habermas, 1994, p. 7). According to him, \"technologies of communication […] make possible a highly differentiated network of public spheres\" (Habermas, 1990b, p. 360), The public sphere should consist of an \"open and inclusive network of overlapping, subcultural politics having fluid temporal, social, and substantial boundaries\" (Habermas, 1998, p. 306). In such a \"discursive structuring of public networks and arenas,\" popular sovereignty \"becomes anonymous\" (Habermas, 1998, p. 171). In his new book, Habermas describes digital technology as a third evolutionary stage in the development of means for communication, following the writing of the spoken word a couple of thousand years ago and the introduction of the mechanical printing press at the beginning of early modernity. Despite the \"revolutionary\" (p. 41) change caused by digital technologies, he insists (again) on the social and political neutrality of new technologies. This position—already taken in the late 1960s by Herbert Marcuse—distinguishes Habermas' argument from two rival positions within the Frankfurt School of Critical Theory. On the one hand, it departs from the optimistic positions taken by Walter Benjamin in his famous 1936 essay about the work of art in the age of mechanical reproduction or Hans-Magnus Enzensberger's Baukasten zu einer Theorie der Medien (1970). On the other hand, it also distances itself from Theodor W. Adorno's critique of alienated consumer culture and the thesis that the essence of the public sphere has been liquidated in the system of mass media in post-liberal societies. Habermas stated in 1992 that the strong influence of Adorno's theory of mass culture was not difficult to discern in the first edition of Structural Transformation of the Public Sphere 30 years ago (see Habermas, 1992, p. 438). There is an element of coquetry in this retrospective statement because already in the early 1960s he had made the point that the consumerist public sphere in a capitalist society should and could be transformed into a more democratic postbourgeois public sphere. The solution he offered in a less known Encyclopedia article from 1964 was a call for political intervention in order to create \"a rational reorganization of social and political power\" (Habermas, 1974, p. 55). The public sphere should be brought \"under the mutual control of rival organizations committed to the public sphere in their internal structure as well as in their relations with the state and each other\" (Habermas, 1974, p. 55). This sounds like an early neo-corporatist expansion of the way public TV was organized in West Germany in those days. Based on his neutralist position, Habermas already in the very beginning of his work about the public sphere more than 60 years ago subscribed to a strategy of state intervention in order to re-regulate the media system. His considerations in The Theory of Communicative Action of 1981 followed the same pattern. Relying on empirical research, he argued—explicitly against Adorno—that even in shifting from writing to images and sounds, electronic media—movie, radio, and TV—have not turned mass media into an apparatus that completely dominates and permeates the language of everyday communication. Instead, he emphasized the \"ambivalence\" (Habermas, 1987, p. 390) of modern mass media. But the \"unleashing\" of the \"emancipatory potential,\" which is \"built into communicative structures themselves,\" (Habermas, 1987, p. 390) in the mass media has to be set into action by political measures. Habermas even mentioned Hans Magnus Enzensberger's vision of \"video pluralism\" and \"television democracy\" as attempts to overcome the centralizing media networks in this context. Since then, Habermas has stated repeatedly that modern mass media could both strengthen or undermine the rationality of political communication, depending on the way the infrastructure of the public sphere is regulated (see Habermas, 1992, p. 437). Thirty years after Habermas first published his seminal book about the public sphere stated that there was \"cause for a less pessimistic assessment\" (Habermas, 1992, p. 457) of it and of the future of democracy itself. Another 30 years later, Habermas seems to have returned to pessimism. In his new book, Habermas repeats older statements about the importance of an accommodating, enlightened liberal political culture as the necessary condition for the existence and further development of a democratic political order. His optimism about the further development of western democracies when he published the book Between Facts and Norms in 1992 was still based on his hypothesis about the long-term trend toward a rationalization of the lifeworld. Thanks to the support of post-conventional socialization patterns, families and groups of citizens enter a higher stage of cognitive and moral rationality within their everyday face-to-face communication that also radiates into political communication. As is well known, he adopted the concept of civil society from Andrew Arato and Jean Cohen and turned it into the institutional source for progressive changes of reasons, values, and topics that get transmitted via mass media to the center of the political system. He described civil society as a context of discovery of morally relevant questions arising from the lifeworld. He thus assumed that the lifeworld had a rational advantage in the perception of social problems that were to be transported via social movements and the voluntary associations of civil society into the public sphere. Habermas' overly positive evaluation of social movements and civil society in Between Facts and Norms ignored the fact that a number of voluntary associations already at that time pursued conservative, reactionary, populist, and militant right-wing political goals (see Buchstein, 1994, pp. 107–108). He restricted his considerations about civil society to the question of whether, and to what extent, a public sphere dominated by mass media could provide a realistic chance for the members of civil society to bring about political changes. In Between Facts and Norms, he was relatively optimistic about the possibility of further democratization. In his new book, Habermas is less optimistic. He puts more emphasis on the \"vulnerability\" (p. 30) of the results of socialization patterns and the precarious status of liberal democracies. He states \"political regression\" (p. 41) of liberal democracies around the world seems to have less confidence in the rationalization of the lifeworld. There is a reason for this growing pessimism that has nothing to do with the current Zeitgeist, but follows from a subtle change in Habermas' theory. At first glance, it seems that he is only updating his considerations about the organizational structure of the new media in order to make his argument about the new structural transformation. Both the neutralist position and the state-intervention strategy for a politics of reform and regulation can be found in his book again. Once again, he frames his reflections about the public sphere within his theory of deliberative democracy. He argues that the democratic legitimacy of modern democracies is based on the inclusiveness of the political public sphere. Mass media have an indispensable function, as they ensure the participation of citizens in a common, albeit anonymous, mass communication. Political opinions can only condense into effective public opinions and thus have a targeted influence on political decisions via the publicity of the mass media. Thus, it is imperative that the mass media have an \"enlightening quality\" (p. 23). The centrifugal dissolution of the limits of the simultaneously accelerated political communication to any number of participants at any distance has an \"ambivalent explosive force\" (p. 43). Referring to results of empirical research, Habermas notes that the deliberative quality of political communication in the internet is still an \"open question\" (p. 40). According to Habermas, the \"platform\" (p. 44) character is what is \"actually new about the new media\" (p. 44). In other words, they enable all potential users to participate in the public sphere as independent authors with equal rights. Political communication no longer depends on traditional journalists or any other expert or institution for professional selection and discursive examination. But the services produced by new, privately owned social media platforms are \"in no way neutral services\" (p. 53). They are driven by the capitalist logic of profit-making that also puts pressure on the \"old media\" to adjust to the new format. According to Habermas, the emancipatory potential of the digital public sphere today is \"übertönt\" (p. 45, in the sense of dominated) by \"fragmented publics\" (p. 45), \"bubbles\" (p. 62), and \"echo chambers\" (p. 45). Both the basic standards for a rational debate and the inclusiveness of the public sphere are threatened to be lost. The stakes are high: the political integration of modern democracies is at risk. It looks like a reminder of the final paragraphs of his first book on the public sphere and to his Encyclopedia article from the 1960s, when Habermas presents a strategy that includes three proposals to overcome this (newly) alarming decline of the public sphere. The first strategy counts on civic education: Citizens have to learn how to deal with this new technology in a reasonable way; and this may take some time (cf., pp. 46–47). The second strategy consists of strong state regulation of the mass media, for example, to force private owners of platforms in an effective way to correct false information or to prevent hate speech. Finally, the third reform strategy is to provide alternatives to the media power of privately owned companies. He proposes an expansion of financial support for state-funded and democratically controlled TV and radio stations (cf., p. 51 and 67), and even for (printed and digital) newspapers that fulfill certain quality standards (cf., p. 67).4 This reform agenda is conservative in that it attempts to carry the media organization of the 1970s into our digital age. In his 1962 book, he glorified the bourgeois public sphere. In his new book, he is again glorifying a media system of the past. I have listed his threefold political reform agenda because it provokes a non-trivial question: How is it possible to regulate the structures of political communication in a way that strengthens enlightened discussions via legislative measures, when such regulations (at least in democracies) have to be the result of (less enlightened) political communication? In the context of this question, it is striking that face-to-face communication gains more relevance in Habermas' theory than before. It is a subtle change. But it has the potential to produce more than just subtle changes to Habermas' final evaluation of the prospects for political reform of the public sphere. In his characterization of elected parliaments Habermas notes that their members \"deliberate and decide together [emphasis in original] according to democratic procedures\" (p. 24). I will not discuss the problematic theory of parliamentarism in the context of this article, but I do want to point to his formulation \"deliberate together [emphasis in original].\" In my understanding, this formulation indicates a normative preference for political communication in social face-to-face constellations, which is typical for interaction in the lifeworld. In a different section of the book, Habermas explicitly praises the deliberative quality of parliamentary decision-making because decisions are made \"face-to-face after democratic deliberations [emphasis in original]\" (p. 102). He also attests to the courts \"comparatively high level of rationality\" (p. 78), which seems not only to be the result of its legal institutionalization but also due to the fact that court hearings and deliberations are held face-to-face. Finally, in his characterization of social movements and a vibrant civil society he emphasizes their \"face-to-face encounters\" (p. 39) in everyday life and public events. In one of the most intriguing sections of the book, Habermas speculates about a changing perception by the users of social media in which the separation between public and private communication is abolished. According to him, a significant part of digital communication today should be understood neither as public nor as private. Rather it is a sphere of communication, which has been reserved until then for private correspondences by letter, that has been bloated to a public existence. It produces a \"peculiar anonymous intimacy\" (p. 62) which Habermas coins a \"Halböffentlichkeit\" (p. 65—semi-public sphere) of echo chambers and filter bubbles.5 However, this speculation puts Habermas in a dilemma. The lifeworld in Habermas' theory is conceptualized as a linguistically organized and culturally transmitted stock of interpretative patterns which form the symbolic core of a society. He introduces the lifeworld as a necessary correlation to the notion of communicative action (see Baynes, 2016, pp. 64–70). The dilemma is the following one: On the one hand, Habermas continues to base the considerations in the book on the assumption of the rational potential of the lifeworld, in particular of face-to-face communication even in different social settings. On the other hand, his speculation provides the plausible assumption that under the conditions of the current digital communication infrastructure, there will be a massive unlearning of cognitive and moral In his 1962 book, Habermas that with the of mass media, the of the capitalist and the of the (Habermas, p. This was with a neutralist position about new In his current critique of social media, he can no longer his neutralist position because he his about the sphere with the speculation that communication in such forms has the of limited and (p. moral and cognitive for its This the for Habermas' reform The longer we wait for radical political of the digital infrastructure, the less it is to the support of democratic to the problems of having to them on a we this of we with a more pessimistic than Habermas But Adorno's on mass culture from the again, we should give empirical a second because there are reasons for it be the case that Habermas is in his analysis in the metaphorical language of \"echo chambers\" and Habermas' metaphorical of the term is also He not this term for modern democratic theory. In of the of legitimacy in his of book on and legitimacy (see p. And in the early years of the of of democracy was used as a concept by constitutional to state of political (see pp. Habermas' of the term back to the late (see pp. In his it was a of term of had used the to the decline of liberal rule of law in capitalist society (see In his of the public Habermas also with a of but he structure for Both and the to historical changes in the development of capitalist as a of clearly In the way Habermas the term it is more than a or metaphor. But even a metaphor the cognitive of an in the of Habermas' of the term two First, the of or which back to the word structures are the basic that support a or the of an The second of the the concept of more than it means Thus, a structural is not just any but a change in the of the it a It is in this strong sense that Habermas understood his thesis of the structural of the public sphere in his 1962 And he the same term 60 years to a new stage in the development of the public sphere. Hans has that there is no such as a completely language (see about changing our metaphorical vocabulary when we deal with changes in the public metaphor of This metaphor a different It the of the of different the are the of our simultaneously in different movements are and their movements that structures in one but in different Some of the public sphere no longer to change with the and However, such massive changes may a or may a longer question like can only be by empirical research. Habermas himself was never to the importance of empirical for his political theory (see Buchstein, pp. to less of of this article have for better are in with current empirical about everyday digital media in modern democracies. The of do not support Habermas' pessimistic about a new quality in the of political communication. chambers\" and \"bubbles\" are than in political In as has the of the social in (see In 1992, Habermas a about his seminal 1962 of a development from a public to one into too p. 438). for the future of democracy that the in his book is once again too and Buchstein, of",
      "cited_by_count": 29,
      "type": "article",
      "source": {
        "name": "Constellations",
        "type": "journal",
        "issn": [
          "1351-0487",
          "1467-8675"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "hybrid",
        "oa_url": "https://onlinelibrary.wiley.com/doi/pdfdirect/10.1111/1467-8675.12661"
      },
      "topics": [
        "Social Media and Politics",
        "Populism, Right-Wing Movements",
        "Critical Theory and Philosophy"
      ],
      "referenced_works_count": 21,
      "url": "https://openalex.org/W4361251882"
    },
    {
      "openalex_id": "W2729634612",
      "doi": "10.1162/daed_a_00444",
      "title": "Twelve Key Findings in Deliberative Democracy Research",
      "authors": [
        {
          "name": "Nicole Curato",
          "openalex_id": "A5035441746",
          "orcid": "https://orcid.org/0000-0002-0269-0186",
          "institutions": [
            "Australian Research Council"
          ]
        },
        {
          "name": "John S. Dryzek",
          "openalex_id": "A5011467777",
          "orcid": "https://orcid.org/0000-0001-6358-0047",
          "institutions": [
            "Australian Research Council",
            "University of Canberra"
          ]
        },
        {
          "name": "Selen A. Ercan",
          "openalex_id": "A5076082479",
          "orcid": "https://orcid.org/0000-0002-3649-2882"
        },
        {
          "name": "Carolyn M. Hendriks",
          "openalex_id": "A5041644700",
          "orcid": "https://orcid.org/0000-0002-9734-3610",
          "institutions": [
            "Australian National University"
          ]
        },
        {
          "name": "Simon Niemeyer",
          "openalex_id": "A5015736894",
          "orcid": "https://orcid.org/0000-0003-3048-5697",
          "institutions": [
            "Australian Research Council"
          ]
        }
      ],
      "publication_year": 2017,
      "publication_date": "2017-06-29",
      "abstract": "This essay reflects on the development of the field of deliberative democracy by discussing twelve key findings that capture a number of resolved issues in normative theory, conceptual clarification, and associated empirical results. We argue that these findings deserve to be more widely recognized and viewed as a foundation for future practice and research. We draw on our own research and that of others in the field.",
      "cited_by_count": 386,
      "type": "article",
      "source": {
        "name": "Daedalus",
        "type": "journal",
        "issn": [
          "0011-5266",
          "1548-6192"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "hybrid",
        "oa_url": "https://direct.mit.edu/daed/article-pdf/146/3/28/1830979/daed_a_00444.pdf"
      },
      "topics": [
        "Social Media and Politics",
        "Electoral Systems and Political Participation",
        "Political Philosophy and Ethics"
      ],
      "referenced_works_count": 4,
      "url": "https://openalex.org/W2729634612"
    },
    {
      "openalex_id": "W4235328403",
      "doi": "10.1007/978-1-349-94186-5_84",
      "title": "American Institute of Certified Public Accountants (AICPA)",
      "authors": [
        {
          "name": "A-T Children'",
          "openalex_id": "A5094440291",
          "institutions": [
            "Research Council of Finland",
            "Aberystwyth University",
            "Acoustical Society of America",
            "Adelphi University",
            "Graduate School USA"
          ]
        },
        {
          "name": "SIRIUS Project",
          "openalex_id": "A5094339313",
          "institutions": [
            "Research Council of Finland",
            "Aberystwyth University",
            "Acoustical Society of America",
            "Adelphi University",
            "Graduate School USA"
          ]
        },
        {
          "name": "Cynthia Rothblum‐Oviatt",
          "openalex_id": "A5030494124",
          "orcid": "https://orcid.org/0000-0003-1442-2514",
          "institutions": [
            "Research Council of Finland",
            "Aberystwyth University",
            "Acoustical Society of America",
            "Adelphi University",
            "Graduate School USA"
          ]
        },
        {
          "name": "Gloria Blackwell",
          "openalex_id": "A5110904151",
          "institutions": [
            "Research Council of Finland",
            "Aberystwyth University",
            "Acoustical Society of America",
            "Adelphi University",
            "Graduate School USA"
          ]
        },
        {
          "name": "Theresa Starratt",
          "openalex_id": "A5094525417",
          "institutions": [
            "Research Council of Finland",
            "Aberystwyth University",
            "Acoustical Society of America",
            "Adelphi University",
            "Graduate School USA"
          ]
        },
        {
          "name": "Elaine Moran",
          "openalex_id": "A5088908924",
          "orcid": "https://orcid.org/0000-0001-6624-5738",
          "institutions": [
            "Research Council of Finland",
            "Aberystwyth University",
            "Acoustical Society of America",
            "Adelphi University",
            "Graduate School USA"
          ]
        }
      ],
      "publication_year": 2018,
      "publication_date": "2018-01-01",
      "abstract": "The A-T Children's Project is a non-profit organization that raises funds to support and co-ordinate biomedical research projects, scientific conferences and a clinical centre aimed at finding a cure for ataxia-telangiectasia, a lethal genetic disease that attacks children, causing progressive loss of muscle control, as well as cancer and immune system problems.",
      "cited_by_count": 1510,
      "type": "book-chapter",
      "source": {
        "name": "Palgrave Macmillan UK eBooks",
        "type": "ebook platform",
        "issn": null
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "bronze",
        "oa_url": "https://link.springer.com/content/pdf/10.1007%2F978-1-349-94186-5_84.pdf"
      },
      "topics": [],
      "referenced_works_count": 0,
      "url": "https://openalex.org/W4235328403"
    },
    {
      "openalex_id": "W3037621274",
      "doi": "10.17759/sps.2020110204",
      "title": "The Role of Individual Values, Authoritarian Attitudes and Social Identity in the General Discriminatory Orientation of the Personal in Russia",
      "authors": [
        {
          "name": "Rail М. Shamionov",
          "openalex_id": "A5032665082",
          "orcid": "https://orcid.org/0000-0001-8358-597X",
          "institutions": [
            "Saratov State University"
          ]
        }
      ],
      "publication_year": 2020,
      "publication_date": "2020-01-01",
      "abstract": "Objective. Study of the role of individual values, authoritarian attitudes and social identity in the expression of discriminatory orientation of the personal in Russia. Background. Discriminatory attitudes not only hinder social development, but also negatively affect interpersonal and intergroup relationships, creating social and humanitarian problems. Therefore, finding out and explaining the reasons for the formation of a discriminatory attitude and determining how to eliminate them are the most important tasks of modern social psychology. Study design. The paper studied the relationship between the degree of dislike for representatives of various discriminated groups and the areas of discrimination by calculating the Pearson correlation. Predictors of discriminatory attitudes are established using regression analysis (step-by-step method). Structural modeling of the determinants of discriminatory attitudes of the individual by area (sphere) of discrimination and subject (discriminated group) using the SEM method is carried out. Participants. The study involved 217 people (the average age is 28.9±11.2 years, 36% of men). Measurements. We used the developed questionnaire and scales of discriminatory attitudes, the method of assessing values of Sh. Schwartz, a short version of the scales of the method of J. Dukkit. All scales are checked for meaningful validity and reliability. Results. It was found that the discriminatory attitude is most pronounced in the sphere of sports, education and career. Biases and rejection of representatives of different groups in various spheres of life are associated with the high significance of the values of personal and social security, power — resources, traditions (positive); values of interpersonal conformity and independence — thoughts (negative) and reputation as a desire to maintain a public image (ambivalent in different areas). The directions of relations between values, authoritarian attitudes, social identity and discriminatory attitudes are established. Сonclusions. It is shown that civil identity is a factor of institutional discrimination rather than domestic one. Adherence to an ethnic group affects the strength of a domestic discriminatory attitude directly, and institutional attitudes indirectly, through civic identity. As a result of structural equation modeling, a suitable model has been determined that explains up to 24% of variations in the outgroup discriminatory attitude and up to 25% of variations in the manifestation of biases in various spheres of life.",
      "cited_by_count": 5,
      "type": "article",
      "source": {
        "name": "Social Psychology and Society",
        "type": "journal",
        "issn": [
          "2311-7052"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "diamond",
        "oa_url": "https://doi.org/10.17759/sps.2020110204"
      },
      "topics": [
        "Social and Intergroup Psychology",
        "Cultural Differences and Values",
        "Sociopolitical Dynamics in Russia"
      ],
      "referenced_works_count": 31,
      "url": "https://openalex.org/W3037621274"
    },
    {
      "openalex_id": "W2208587675",
      "doi": "10.1186/s40878-015-0017-4",
      "title": "Solidarity in diverse societies: beyond neoliberal multiculturalism and welfare chauvinism",
      "authors": [
        {
          "name": "Will Kymlicka",
          "openalex_id": "A5078179152",
          "orcid": "https://orcid.org/0000-0001-6468-5174",
          "institutions": [
            "Queen's University"
          ]
        }
      ],
      "publication_year": 2015,
      "publication_date": "2015-12-01",
      "abstract": "In the postwar period, projects of social justice have often drawn upon ideas of national solidarity, calling upon shared national identities to mobilize support for the welfare state. Several commentators have argued that increasing immigration, and the multiculturalism policies it often gives rise to, weaken this sense of national solidarity. This creates a potential \"progressive's dilemma\", forcing a choice between solidarity and diversity. My aim in this paper is two-fold: first, to argue for the importance of national solidarity as a progressive political resource; and second, to discuss how it can be reconciled with support for immigration and multiculturalism. I will try to identify the prospects for a multicultural national solidarity – a multicultural welfare state, if you will – and to contrast it with the two obvious alternatives: a neoliberal multiculturalism that champions mobility and diversity at the expense of national solidarity; and a welfare chauvinism that champions national solidarity at the expense of immigrants and minorities.",
      "cited_by_count": 368,
      "type": "article",
      "source": {
        "name": "Comparative Migration Studies",
        "type": "journal",
        "issn": [
          "2214-594X",
          "2214-8590"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "gold",
        "oa_url": "https://comparativemigrationstudies.springeropen.com/track/pdf/10.1186/s40878-015-0017-4"
      },
      "topics": [
        "Migration, Refugees, and Integration",
        "Social Policy and Reform Studies",
        "Migration and Labor Dynamics"
      ],
      "referenced_works_count": 128,
      "url": "https://openalex.org/W2208587675"
    },
    {
      "openalex_id": "W2531857117",
      "doi": "10.1007/s10433-016-0398-8",
      "title": "Social exclusion of older persons: a scoping review and conceptual framework",
      "authors": [
        {
          "name": "Kieran Walsh",
          "openalex_id": "A5003534532",
          "orcid": "https://orcid.org/0000-0002-6718-193X",
          "institutions": [
            "Ollscoil na Gaillimhe – University of Galway"
          ]
        },
        {
          "name": "Thomas Scharf",
          "openalex_id": "A5102846094",
          "orcid": "https://orcid.org/0000-0003-4909-1487",
          "institutions": [
            "Newcastle University"
          ]
        },
        {
          "name": "Norah Keating",
          "openalex_id": "A5076747557",
          "orcid": "https://orcid.org/0000-0002-2535-4564",
          "institutions": [
            "Swansea University",
            "North-West University"
          ]
        }
      ],
      "publication_year": 2016,
      "publication_date": "2016-10-11",
      "abstract": null,
      "cited_by_count": 404,
      "type": "review",
      "source": {
        "name": "European Journal of Ageing",
        "type": "journal",
        "issn": [
          "1613-9372",
          "1613-9380"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "hybrid",
        "oa_url": "https://link.springer.com/content/pdf/10.1007/s10433-016-0398-8.pdf"
      },
      "topics": [
        "Health disparities and outcomes",
        "Migration, Aging, and Tourism Studies",
        "Intergenerational Family Dynamics and Caregiving"
      ],
      "referenced_works_count": 188,
      "url": "https://openalex.org/W2531857117"
    },
    {
      "openalex_id": "W2953083078",
      "doi": "10.1080/21670811.2019.1623700",
      "title": "On the Democratic Role of News Recommenders",
      "authors": [
        {
          "name": "Natali Helberger",
          "openalex_id": "A5053437341",
          "orcid": "https://orcid.org/0000-0003-1652-0580",
          "institutions": [
            "University of Amsterdam"
          ]
        }
      ],
      "publication_year": 2019,
      "publication_date": "2019-06-12",
      "abstract": "Are algorithmic news recommenders a threat to the democratic role of the media? Or are they an opportunity, and, if so, how would news recommenders need to be designed to advance values and goals that we consider essential in a democratic society? These are central questions in the ongoing academic and policy debate about the likely implications of data analytics and machine learning for the democratic role of the media and the shift from traditional mass-media modes of distribution towards more personalised news and platforms Building on democratic theory and the growing body of literature about the digital turn in journalism, this article offers a conceptual framework for assessing the threats and opportunities around the democratic role of news recommenders, and develops a typology of different ‘democratic recommenders’.",
      "cited_by_count": 316,
      "type": "article",
      "source": {
        "name": "Digital Journalism",
        "type": "journal",
        "issn": [
          "2167-0811",
          "2167-082X"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "hybrid",
        "oa_url": "https://www.tandfonline.com/doi/pdf/10.1080/21670811.2019.1623700?needAccess=true"
      },
      "topics": [
        "Media Studies and Communication",
        "Computational and Text Analysis Methods",
        "Social Media and Politics"
      ],
      "referenced_works_count": 47,
      "url": "https://openalex.org/W2953083078"
    },
    {
      "openalex_id": "W2593816770",
      "doi": null,
      "title": "Nation-Building in Post-Maidan Ukraine",
      "authors": [
        {
          "name": "Aleksandra Kuczyńska–Zonik",
          "openalex_id": "A5079550551",
          "orcid": "https://orcid.org/0000-0002-5672-9613"
        },
        {
          "name": "Janusz Kowalczyk",
          "openalex_id": "A5024785520"
        }
      ],
      "publication_year": 2016,
      "publication_date": "2016-07-01",
      "abstract": "IntroductionThe process of nation-building lets societies integrate around common values that they hold to be crucial. The influence of the same political ideas makes them become real communities. Among such common values are territory, population, the indivisibility and unity of the state, sovereignty, participation, religion, culture, tradition, origin, and social awareness. This is not an exhaustive list, but become the basis for talking about collective identity and social solidarity. Nation-building inspired by feelings of connection to the political community (nation) is expressed through social mobilisation, and has become an important tool for achieving political goals. Most often it is seen as the reason for conflicts between national and ethnic minorities, or discrimination of either. While nationalism is usually seen as negative, nation-building allows the creation of a political community, based on ethnic, political or civic identity, and provides an impetus to work for collective security, economic development and political stability in the country.The process of nation-building analysed in the article includes three components. These are: a) cultural awareness and beliefs according to the idea of the nation and national identity; b) the socio-political movements that work for the benefit of the community's benefits and bring to fruition its demands; and c) political, national, religious and cultural ideologies. They enclose identity, behaviour and social activities, as well as state policy. For the authors, nation-building means: a) striving to regain or maintain the freedom and independence of the nation; b) political, economic, social and cultural self-determination; c) relationships between the nation and the state's institutions. From this point of view, Ukraine's sovereignty, integrity and cultural community, based only on ethnic factors (language, origins and history) and without common values or political ideas has no prospects for development.The study assumed that: a) the democratic revolution, which began in 2013 on Maidan, was a result of the growth of political consciousness and national identity; b) political changes were accompanied by an intensification of the process of nation-building; and c) despite significant social mobilisation, there are some obstacles that impede the formation of a civic nation in Ukraine. These are results of domestic factors (weakness of institutions and civic organisations) and external influences (the war with Russia).A complete analysis of the nation-building elements takes into account both internal and external factors. They allow an assessment of the nature of the process that has been taking place in Ukraine since the events on Maidan in 2013. The issue of the development of the national idea after the independence in 1991 has been continuously present in public discourse in Ukraine. The authors state that the national idea is an important factor in regards to: a) integrating society around fundamental values; b) uniting past, present and future; c) defining strategic state policy.1 It is of particular note that the concept of civic nation focuses on social activity and associations, in contrast to common differential ideologies and political doctrines.2 In this perspective it is claimed that the Ukrainian revolution of 2013 to 2014 and Russia's attack on Ukraine have influenced the current Ukrainian concept. Crucial indicators of this concept include: a) uniting Ukrainian society regardless of ethnic, religious, regional, social and political status; b) preservation of statehood and territorial integrity.A Framework for AnalysisStarting from diversity of types of nations, these can be recognised as ethnic, cultural, religious, linguistic or geographic, which differ from each other by origin, language, culture, religion, history, tradition, spirituality and territory.3The concept of the nation-state developed in Western Europe, where the national communities already had statehood. …",
      "cited_by_count": 3,
      "type": "article",
      "source": {
        "name": "\u0098The \u009cPolish Quarterly of International Affairs",
        "type": "journal",
        "issn": [
          "1230-4999"
        ]
      },
      "open_access": {
        "is_oa": false,
        "oa_status": "closed",
        "oa_url": null
      },
      "topics": [
        "Eastern European Communism and Reforms",
        "Global Economic and Social Development",
        "Ukrainian Cultural and Linguistic Studies"
      ],
      "referenced_works_count": 0,
      "url": "https://openalex.org/W2593816770"
    },
    {
      "openalex_id": "W3018360920",
      "doi": "10.1080/23808985.2020.1755338",
      "title": "News media trust and its impact on media use: toward a framework for future research",
      "authors": [
        {
          "name": "Jesper Strömbäck",
          "openalex_id": "A5034990163",
          "orcid": "https://orcid.org/0000-0001-7392-9791",
          "institutions": [
            "University of Gothenburg"
          ]
        },
        {
          "name": "Yariv Tsfati",
          "openalex_id": "A5022761385",
          "orcid": "https://orcid.org/0000-0001-7395-3257",
          "institutions": [
            "University of Haifa"
          ]
        },
        {
          "name": "Hajo G. Boomgaarden",
          "openalex_id": "A5085826258",
          "orcid": "https://orcid.org/0000-0002-5260-1284",
          "institutions": [
            "University of Vienna"
          ]
        },
        {
          "name": "Alyt Damstra",
          "openalex_id": "A5031491138",
          "orcid": "https://orcid.org/0000-0001-7753-018X",
          "institutions": [
            "University of Amsterdam"
          ]
        },
        {
          "name": "Elina Lindgren",
          "openalex_id": "A5042193755",
          "orcid": "https://orcid.org/0000-0002-9032-1347",
          "institutions": [
            "University of Gothenburg"
          ]
        },
        {
          "name": "Rens Vliegenthart",
          "openalex_id": "A5077381667",
          "orcid": "https://orcid.org/0000-0003-2401-2914",
          "institutions": [
            "University of Amsterdam"
          ]
        },
        {
          "name": "Torun Lindholm",
          "openalex_id": "A5079611643",
          "orcid": "https://orcid.org/0000-0002-8867-5752",
          "institutions": [
            "Stockholm University"
          ]
        }
      ],
      "publication_year": 2020,
      "publication_date": "2020-04-02",
      "abstract": "In contemporary high-choice media environments, the issue of media trust and its impact on people's media use has taken on new importance. At the same time, the extent to which people trust the news media and how much it matters for their use of different types of media is not clear. To lay the groundwork for future research, in this article we offer a focused review of (a) how news media trust has been conceptualized and operationalized in previous research and (b) research on the extent to which news media trust influences media use, and (c) offer a theoretically derived framework for future research on news media trust and its influence on media use.",
      "cited_by_count": 486,
      "type": "article",
      "source": {
        "name": "Annals of the International Communication Association",
        "type": "journal",
        "issn": [
          "2380-8977",
          "2380-8985"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "bronze",
        "oa_url": "https://www.tandfonline.com/doi/pdf/10.1080/23808985.2020.1755338?needAccess=true"
      },
      "topics": [
        "Social Media and Politics",
        "Media Studies and Communication",
        "Digital Marketing and Social Media"
      ],
      "referenced_works_count": 117,
      "url": "https://openalex.org/W3018360920"
    },
    {
      "openalex_id": "W2905498624",
      "doi": "10.1111/pops.12568",
      "title": "Understanding Conspiracy Theories",
      "authors": [
        {
          "name": "Karen M. Douglas",
          "openalex_id": "A5087650169",
          "orcid": "https://orcid.org/0000-0002-0381-6924",
          "institutions": [
            "University of Kent"
          ]
        },
        {
          "name": "Joseph E. Uscinski",
          "openalex_id": "A5090868842",
          "orcid": "https://orcid.org/0000-0003-2179-6952",
          "institutions": [
            "University of Miami"
          ]
        },
        {
          "name": "Robbie M. Sutton",
          "openalex_id": "A5069725782",
          "orcid": "https://orcid.org/0000-0003-1542-1716",
          "institutions": [
            "University of Kent"
          ]
        },
        {
          "name": "Aleksandra Cichocka",
          "openalex_id": "A5001068690",
          "orcid": "https://orcid.org/0000-0003-1703-1586",
          "institutions": [
            "University of Kent"
          ]
        },
        {
          "name": "Türkay Salim Nefes",
          "openalex_id": "A5000096797",
          "orcid": "https://orcid.org/0000-0002-0294-2064",
          "institutions": [
            "University of Oxford"
          ]
        },
        {
          "name": "Chee Siang Ang",
          "openalex_id": "A5010062612",
          "orcid": "https://orcid.org/0000-0002-1109-9689",
          "institutions": [
            "University of Kent"
          ]
        },
        {
          "name": "Farzin Deravi",
          "openalex_id": "A5067851689",
          "orcid": "https://orcid.org/0000-0003-0885-437X",
          "institutions": [
            "University of Kent"
          ]
        }
      ],
      "publication_year": 2019,
      "publication_date": "2019-02-01",
      "abstract": "Scholarly efforts to understand conspiracy theories have grown significantly in recent years, and there is now a broad and interdisciplinary literature. In reviewing this body of work, we ask three specific questions. First, what factors are associated with conspiracy beliefs? Our review of the literature shows that conspiracy beliefs result from a range of psychological, political, and social factors. Next, how are conspiracy theories communicated? Here, we explain how conspiracy theories are shared among individuals and spread through traditional and social media platforms. Next, what are the societal risks and rewards associated with conspiracy theories? By focusing on politics and science, we argue that conspiracy theories do more harm than good. We conclude by suggesting several promising avenues for future research.",
      "cited_by_count": 1341,
      "type": "article",
      "source": {
        "name": "Political Psychology",
        "type": "journal",
        "issn": [
          "0162-895X",
          "1467-9221"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "hybrid",
        "oa_url": "https://onlinelibrary.wiley.com/doi/pdfdirect/10.1111/pops.12568"
      },
      "topics": [
        "Misinformation and Its Impacts",
        "Media Influence and Politics",
        "Hate Speech and Cyberbullying Detection"
      ],
      "referenced_works_count": 302,
      "url": "https://openalex.org/W2905498624"
    },
    {
      "openalex_id": "W2032268803",
      "doi": "10.1016/j.jclepro.2015.02.004",
      "title": "Sustainable–smart–resilient–low carbon–eco–knowledge cities; making sense of a multitude of concepts promoting sustainable urbanization",
      "authors": [
        {
          "name": "Martin de Jong",
          "openalex_id": "A5102743790",
          "orcid": "https://orcid.org/0000-0002-5557-1666",
          "institutions": [
            "Fudan University",
            "Delft University of Technology"
          ]
        },
        {
          "name": "Simon Joss",
          "openalex_id": "A5028211487",
          "orcid": "https://orcid.org/0000-0003-2856-4695",
          "institutions": [
            "University of Westminster"
          ]
        },
        {
          "name": "Daan Schraven",
          "openalex_id": "A5063308411",
          "orcid": "https://orcid.org/0000-0003-0647-1172",
          "institutions": [
            "Delft University of Technology"
          ]
        },
        {
          "name": "Changjie Zhan",
          "openalex_id": "A5113837524",
          "institutions": [
            "Delft University of Technology"
          ]
        },
        {
          "name": "Margot Weijnen",
          "openalex_id": "A5001350128",
          "orcid": "https://orcid.org/0000-0001-8785-0363",
          "institutions": [
            "Delft University of Technology"
          ]
        }
      ],
      "publication_year": 2015,
      "publication_date": "2015-02-10",
      "abstract": null,
      "cited_by_count": 1011,
      "type": "article",
      "source": {
        "name": "Journal of Cleaner Production",
        "type": "journal",
        "issn": [
          "0959-6526",
          "1879-1786"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "bronze",
        "oa_url": "https://www.sciencedirect.com/science/article/pii/S0959652615001080"
      },
      "topics": [
        "Smart Cities and Technologies",
        "Innovative Approaches in Technology and Social Development",
        "Human Mobility and Location-Based Analysis"
      ],
      "referenced_works_count": 92,
      "url": "https://openalex.org/W2032268803"
    },
    {
      "openalex_id": "W2765084630",
      "doi": "10.3390/su9101882",
      "title": "The Role of Cultural Heritage in Sustainable Development: Multidimensional Indicators as Decision-Making Tool",
      "authors": [
        {
          "name": "Francesca Nocca",
          "openalex_id": "A5044021845",
          "orcid": "https://orcid.org/0000-0003-3624-4536",
          "institutions": [
            "University of Naples Federico II"
          ]
        }
      ],
      "publication_year": 2017,
      "publication_date": "2017-10-19",
      "abstract": "The concept of sustainable development has been the main topic of many international conferences. Although many discussions are related to the role of cultural heritage in sustainable development, they develop only on theoretical level. The answer to the main question, that is if the cultural landscape can play a role in sustainable development, could be positive only if we are able to produce empirical evidence about its contribution to improve economic, social, and environmental productivity of the city. It is necessary to produce empirical evidence to demonstrate that cultural heritage conservation/valorization is an investment and not a cost. To date, there are few researches about the indicators that are able to support the relationship between cultural heritage conservation/regeneration and sustainable development. This paper intends to go beyond this limit and approach this issue in operational terms. It is focused on the role that cultural heritage can play in the sustainable development framework. An assessment framework that is able to capture the multidimensional benefits of cultural landscape conservation/valorization is proposed here starting from the analysis of 40 case studies of culture-led regeneration projects. A matrix of multidimensional indicators (divided into nine categories) about the impacts produced by these 40 cultural heritage conservation/valorization projects and its critical analysis is here proposed, mainly focusing the attention on the double relationship between the tourism sector and climate change. Although the analyses often refer to sustainability, it is not concretely addressed because there is an imbalance among the dimensions: in most cases, only the economic component is highlighted, leaving out the social and environmental dimensions. Furthermore, the impacts related to cultural-led projects are mainly interpreted in terms of tourism and real estate impacts.",
      "cited_by_count": 426,
      "type": "article",
      "source": {
        "name": "Sustainability",
        "type": "journal",
        "issn": [
          "2071-1050"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "gold",
        "oa_url": "https://www.mdpi.com/2071-1050/9/10/1882/pdf?version=1508664155"
      },
      "topics": [
        "Cultural Heritage Management and Preservation",
        "Urban Planning and Valuation",
        "Sustainable Building Design and Assessment"
      ],
      "referenced_works_count": 21,
      "url": "https://openalex.org/W2765084630"
    },
    {
      "openalex_id": "W4210771594",
      "doi": "10.4324/9781003133520",
      "title": "Anti-Gender Politics in the Populist Moment (Edition 1)",
      "authors": [
        {
          "name": "Agnieszka Graff",
          "openalex_id": "A5018131335",
          "orcid": "https://orcid.org/0000-0003-0468-0376",
          "institutions": [
            "Asociación por los Derechos Civiles",
            "Södertörn University"
          ]
        },
        {
          "name": "Elżbieta Korolczuk",
          "openalex_id": "A5086856279",
          "orcid": "https://orcid.org/0000-0002-8263-5530",
          "institutions": [
            "Asociación por los Derechos Civiles",
            "Södertörn University"
          ]
        }
      ],
      "publication_year": 2021,
      "publication_date": "2021-09-16",
      "abstract": "This book charts the new phase of global struggles around gender equality and sexual democracy: the ultraconservative mobilization against \"gender ideology\" and feminist efforts to counteract it. It argues that anti-gender campaigns, which emerged around 2010 in Europe, are not a simple continuation of the anti-feminist backlash dating back to the 1970s, but part of a new political configuration. Opposition to \"gender\" has become a key element of the rise of right-wing populism, which successfully harnesses the anxiety, shame and anger caused by neoliberalism and threatens to destroy liberal democracy.\\nAnti-Gender Politics in the Populist Moment offers a novel conceptualization of the relationship between the ultraconservative anti-gender movement and right-wing populist parties, examining the opportunistic synergy between these actors. The authors map the anti-gender campaigns as a global movement, putting the Polish case in a comparative perspective. They show that the anti-gender rhetoric is best understood as a reactionary critique of neoliberalism as a socio-cultural formation. The book also studies the recent wave of feminist mass mobilizations, viewing the transnational revolt of women as a left populist movement.\\nThis is an important study for those doing research in politics, cultural studies, gender and sexuality studies and sociology. It will also be useful for activists and policy makers.",
      "cited_by_count": 451,
      "type": "book",
      "source": {
        "name": "BiblioBoard Library Catalog (Open Research Library)",
        "type": "repository",
        "issn": null
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "gold",
        "oa_url": "https://library.oapen.org/handle/20.500.12657/50542"
      },
      "topics": [
        "Populism, Right-Wing Movements",
        "Gender Politics and Representation"
      ],
      "referenced_works_count": 196,
      "url": "https://openalex.org/W4210771594"
    },
    {
      "openalex_id": "W2622634793",
      "doi": "10.3998/mpub.9708722",
      "title": "Academic Ableism",
      "authors": [
        {
          "name": "Jay Dolmage",
          "openalex_id": "A5087968800"
        }
      ],
      "publication_year": 2017,
      "publication_date": "2017-01-01",
      "abstract": "Academic Ableism brings together disability studies and institutional critique to recognize the ways that disability is composed in and by higher education, and rewrites the spaces, times, and economies of disability in higher education to place disability front and center. For too long, argues Jay Timothy Dolmage, disability has been constructed as the antithesis of higher education, often positioned as a distraction, a drain, a problem to be solved. The ethic of higher education encourages students and teachers alike to accentuate ability, valorize perfection, and stigmatize anything that hints at intellectual, mental, or physical weakness, even as we gesture toward the value of diversity and innovation. Examining everything from campus accommodation processes, to architecture, to popular films about college life, Dolmage argues that disability is central to higher education, and that building more inclusive schools allows better education for all.",
      "cited_by_count": 677,
      "type": "book",
      "source": {
        "name": "University of Michigan Press eBooks",
        "type": "ebook platform",
        "issn": null
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "hybrid",
        "oa_url": "https://www.fulcrum.org/ebooks/6t053h23g/download?locale=en"
      },
      "topics": [
        "Disability Rights and Representation",
        "University Challenges and Reforms"
      ],
      "referenced_works_count": 210,
      "url": "https://openalex.org/W2622634793"
    },
    {
      "openalex_id": "W2787384236",
      "doi": "10.1007/s00267-017-0993-2",
      "title": "Environmental Stewardship: A Conceptual Review and Analytical Framework",
      "authors": [
        {
          "name": "Nathan Bennett",
          "openalex_id": "A5008685860",
          "orcid": "https://orcid.org/0000-0003-4852-3401",
          "institutions": [
            "University of British Columbia",
            "University of Washington"
          ]
        },
        {
          "name": "Tara Sayuri Whitty",
          "openalex_id": "A5111950778",
          "institutions": [
            "Scripps Institution of Oceanography",
            "University of California, San Diego"
          ]
        },
        {
          "name": "Elena M. Finkbeiner",
          "openalex_id": "A5039596589",
          "orcid": "https://orcid.org/0000-0003-3586-3677",
          "institutions": [
            "Stanford University"
          ]
        },
        {
          "name": "Jeremy Pittman",
          "openalex_id": "A5019239739",
          "orcid": "https://orcid.org/0000-0001-8327-184X",
          "institutions": [
            "University of Waterloo"
          ]
        },
        {
          "name": "Hannah R. Bassett",
          "openalex_id": "A5033090521",
          "orcid": "https://orcid.org/0000-0001-7348-0293",
          "institutions": [
            "University of Washington"
          ]
        },
        {
          "name": "Stefan Gelcich",
          "openalex_id": "A5054644849",
          "orcid": "https://orcid.org/0000-0002-5976-9311",
          "institutions": [
            "Center of Applied Ecology & Sustainability",
            "Pontificia Universidad Católica de Chile"
          ]
        },
        {
          "name": "Edward H. Allison",
          "openalex_id": "A5001796283",
          "orcid": "https://orcid.org/0000-0003-4663-1396",
          "institutions": [
            "University of Washington"
          ]
        }
      ],
      "publication_year": 2018,
      "publication_date": "2018-01-31",
      "abstract": null,
      "cited_by_count": 479,
      "type": "review",
      "source": {
        "name": "Environmental Management",
        "type": "journal",
        "issn": [
          "0364-152X",
          "1432-1009"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "hybrid",
        "oa_url": "https://link.springer.com/content/pdf/10.1007%2Fs00267-017-0993-2.pdf"
      },
      "topics": [
        "Environmental Education and Sustainability",
        "Coral and Marine Ecosystems Studies",
        "Sustainability and Climate Change Governance"
      ],
      "referenced_works_count": 209,
      "url": "https://openalex.org/W2787384236"
    },
    {
      "openalex_id": "W2578511110",
      "doi": "10.1111/emed.12183",
      "title": "Introduction Carolingian cultures of dialogue, debate and disputation",
      "authors": [
        {
          "name": "Mayke de Jong",
          "openalex_id": "A5102092624",
          "institutions": [
            "Huygens Institute for History and Culture of the Netherlands",
            "Royal Netherlands Academy of Arts and Sciences",
            "Utrecht University"
          ]
        },
        {
          "name": "Irene van Renswoude",
          "openalex_id": "A5066335182",
          "institutions": [
            "Huygens Institute for History and Culture of the Netherlands",
            "Royal Netherlands Academy of Arts and Sciences",
            "Utrecht University"
          ]
        }
      ],
      "publication_year": 2017,
      "publication_date": "2017-01-06",
      "abstract": "This collection of articles on the theme of Carolingian cultures of dialogue and debate may seem a contradiction in terms. After all, it has recently been argued that by the end of the fourth century, Christianity had created authoritative structures of knowledge in which public disputation was replaced by catechism-like exchanges. This also spelled the end of classical dialogue, that is, the searching and open-ended exchange of ideas as it had been practised in the ancient world since the days of Socrates. Medievalists, on the other hand, have maintained that something resembling a public sphere emerged in the so-called ‘high’ Middle Ages; the lively and wide-ranging debates engendered by the Investiture Controversy have been cited as a case in point. A superficial combination of both perspectives, however different, yields the early medieval west in its traditional guise as a convenient and static backdrop that articulates previous declines and subsequent ‘rises’ of phenomena connected with modernity. For obvious reasons, this image needs to be discarded, but not simply by arguing for greater continuity, or by attempting to rehabilitate a period of roughly five centuries that was ‘actually’ much more culturally complex than has been hitherto assumed. On the contrary, we should make the most of the scholarly debates outside the orbit of Early Medieval Europe, for these raise questions that can be fed productively into our own analytical framework. This is why this themed edition on Carolingian dialogues and debates opens with an extensive contribution on late antique Christian dialogue. It is also the reason why in this Introduction we shall take some time to explore the common ground between ancient historians and early medievalists, as well as the differences in their approach. To put it succinctly, all are concerned with the larger issues involved, such as the impact of Christianity, or with the shifting balance between oral and written culture. Nonetheless, recent debates among historians of late antiquity have mostly revolved around the question of whether the new religion did indeed put an end to a brilliant culture of open debate. Recently, this contention has been challenged head-on with regard to late antiquity and Byzantium, with much attention to the literary complexity of the relevant sources. 1 The post-Roman west, however, is not part of these reconsiderations, largely because of the general assumption that all the venues that might have enabled public debate vanished along with the Roman empire. Whereas Augustine and his flock had remained attuned to empire-wide religious contestation, Alcuin of York was representative of a restricted palace-connected elite, with great ideals concerning literacy and reform that had, however, little practical effect on society at large. Hence, it is still widely held that early medieval society offered little room for criticism and debate. This tenacious image is based on the preconception that the expression of divergent points of view was unthinkable in a period in which ‘the Church’ was dominant and religious diversity was oppressed. Free expression of opinion is supposed to have disappeared, along with the possibilities of an open exchange of ideas, the very moment Emperor Justinian closed the doors of the Academy of Athens. While it should be noted that ‘free expression of opinion’ is an idealistic construction in the first place, it cannot be denied that religious unity at the level of kingdoms and empires was indeed the professed ideal during much of the early Middle Ages. Yet this ideal had to be constantly negotiated, debated and reformulated, if it was ever to be achieved. 2 Scholars, bishops and rulers were intent on establishing orthodoxy and defending it against heresy, that much is true, but orthodoxy, as is well known, does not exist in and by itself. It develops in a dialectical relationship with ‘heresy’– a position that is not only held by modern sociologists of religion, but was acknowledged in the early Middle Ages as well. Debate with heterodox thinkers was considered necessary to arrive at the ‘truth’. Criticism and divergent opinions were welcomed in the political and religious arenas of debate (at least in theory), as long as they served the uncovering and defence of truth and arguably benefitted the common good. Another widely held notion concerning the absence of debate in the early Middle Ages that we need to address from the outset is the supposed demise of (formal) rhetoric. George Kennedy, an authority in the field of classical rhetoric and its medieval Nachleben even went so far as to claim that formal speech was no longer regarded as an effective form of persuasion, because ‘men's minds and actions were largely manipulated by a rhetoric of brute force and authority [. . .] not by logical argument’. 3 The general opinion is that classical rhetoric dwindled in the sixth and seventh centuries, because there were fewer opportunities for public speaking. With the decay and fragmentation of civic life, rhetoric lost its public function and oratory went into decline. Training in written argumentation became ever more important, and those elements of the rhetorical discipline that were still considered useful were redirected to written discourse. 4 Certainly, there is much evidence that points in the direction of a weakening of classical rhetoric after the municipal schools closed. Yet, rhetoric is so much more than formal rhetoric in the classical tradition of Cicero, Demetrius or Quintilian, a point to which we shall return below. There continued to be venues for oral rhetoric and occasions for debate where one could show off one's skills in persuasive public speaking. We only need to think of assemblies and smaller-scale deliberative meetings at the courts, such as are described in De ordine palatii, or of discussions on orthodoxy during or in the margins of ecclesiastical synods, to imagine places and opportunities where training in oral delivery must have come in useful. Although debates were increasingly based on the interpretation of written texts, that interpretation was still communicated orally in public meetings, and those who could speak well in public received the admiration of their contemporaries. In 800, Alcuin's student Candidus reported to his teacher how much he had admired the outspoken speech that Theodulf of Orleans had delivered at the assembly of Rome in that same year. Candidus praised the ‘free voice’ of Theodulf speaking out in a public meeting. 5 On such eminently public occasions, rulers and their direct entourage were admired for their eloquence. When Agobard of Lyon reported on the assembly of Attigny in 822, he praised Emperor Louis who with God's inspiration interrogated those present, uncovered the truth in a most elegant manner, and ‘announced this faithfully, by his own word of mouth’. 6 The most impressive address at Attigny, however, was delivered by Abbot Adalhard of Corbie, by then an old and experienced orator. According to his biographer, Adalhard's eloquence was such that it was ‘utterly suited for persuasion and dissuasion’. 7 Secular magnates also took an active part in such public discussions; especially the contentious issue of the use of ecclesiastical land for military purposes was debated hotly from the 820s onwards, with churchmen wanting to set limits to this, while the saeculares argued that the res publica could not do without it. 8 The dialogue is only very rarely evidenced as a form for normative Christian writing, despite the strategic place of conversion and theological discussion in Christian communities. The catechism and other question-and-answer structures are not in any significant sense a dialogue: they are forms of exchange to aid controlled learning and to produce certain, fixed responses. 9 For Richard Lim, the new religion indeed spelled the end of dialogue, albeit for different reasons. In classical antiquity, Lim argues, the dialogue belonged to the elitist literary culture of paideia. It was highly influential, yet also a ‘boutique literary genre’, and therefore very different from the inclusive Christian sermo humilis that aimed to reach as many people as possible, including those from lower social strata. Put briefly, the inherent elitism of the dialogue, as Lim called it, was ill-suited to a religious communication that aimed at the masses, so the demand for this particular literary form gradually disappeared. 10 As Averil Cameron recently pointed out, the freedom, democracy and open-ended exchange with which Goldhill and others identify ‘real’, that is, Socratic, dialogue is mostly a modern ideal. 11 A related and equally vexed question is whether the dialogues transmitted through texts in any way reflect ‘real’ public debates and discussions. Since all dialogues available to historians are literary constructs, including the ones that are presented as spontaneous and open-ended, a sharp distinction between literary and viva voce dialogue is not helpful. What we are able to grasp are the cultural ideals of how a dialogue should proceed. 12 In a critique published only a year after Cameron's, Peter Van Nuffelen primarily engages with Richard Lim's Public Disputation, Power, and Social Order in Late Antiquity (1995). 13 This influential book no doubt inspired the more recent verdict on the ‘end of dialogue’, but its central argument ranges more widely: it is about once wide-open intellectual horizons being narrowed by the increasing dominance of Christian orthodoxy. From the late fourth century onwards, the intellectually demanding public disputation that had been the prevailing norm and practice began to be replaced by statements of religious consensus. First, such debates became staged operations in which the victory of orthodoxy was decided from the beginning, and they just survived as literary exercises, with an even more predictable result. According to Van Nuffelen, however, this transition from once spontaneous and oral events to stilted literary productions represents an evolutionist projection on Lim's part. After all, any knowledge of the supposedly impromptu earlier disputations comes from literary accounts, which may have been just as fictitious as their fifth- and sixth-century successors. And instead of taking the latter to be mere literary productions and therefore not representative of any real-life exchange, a careful study of these texts in fact shows how much public disputation was still valued as a way of gaining truth and knowledge. 14 Whether any of the textual evidence reflects ‘real’ disputes is a moot point, but it surely becomes clear that in this period in which there supposedly was no room anymore for the real and open-ended exchange of ideas, it was precisely this that remained the norm for Christian authors who set out to persuade their opponents. There was of course a tension between this ideal and reality, but this ‘was sustained by a belief in the power and moral propriety of persuasion and reason’. 15 These modern dichotomies – oral versus literate, reason versus authority, and open social competition versus closed group identities – have not just been projected onto late antiquity. They have also been essential in articulating the differences between modern and pre-modern societies in general, and of the position of the Middle Ages within the grand narrative of western history. More specifically, these set oppositions have long informed the dominant image of the western early Middle Ages as a period of political chaos and cultural stagnation, inspiring some lively debates among early medievalists, primarily on the impact of literacy on political communication, on the existence and perception of state-like structures and on the participation of the clergy in the latter. 16 This has yielded a different perspective on the Carolingian world, not just with regard to the wider impact of Christian-Latin literacy on society, but also concerning the importance of religious institutions, both for the governance of this huge polity as well as for the cultural cohesion of its diverse elites. ‘The Church’, as it was once called, turns out to consist of a great number of ‘churches’ (ecclesiae), monasteries and episcopal communities that were very much part of the Carolingian fabric of politics. This has consequences for any consideration of dialogue and debate in this period. Modern historians of the early Middle Ages have been thinking about the nature of the public domain, mostly from the perspective of political history. For example, Stuart Airlie has reflected on the staunch ethos of public service of the Carolingian aristocracy, and of the palatium as an eminently public place in the minds of ninth-century authors, even if the monarch never visited. 17 As Chris Wickham has argued, until the turn of the first millennium ad there existed a culture of the public; even in the early medieval west with its relatively weak states, the notion publicus remained a pervasive one, primarily associated with royal property, law courts, royal officials and assemblies, both great and small. 18 Ecclesiastical institutions should be added to this list, also as dependencies of the royal court, and therefore an integral part of a new ‘topography of power’ in which public debates, both face-to-face and written, could take place. A council/synod of bishops is not at first glance a forum for resolving ‘public’, that is state-related, issues, and even less so a monastic community, yet if one keeps in mind the extent to which the Carolingian state depended on episcopal governance and on royal access to monastic property, such ecclesiastical institutions cannot be ignored in discussions about the nature of an early medieval public domain. Many of the issues debated in these ecclesiastical gatherings, such as heresy or deviant religious practice, used to come under the heading of ‘theology’, but have now become part of mainstream political and social history. Meanwhile, specialism takes its toll, so the earlier Middle Ages remain a static backdrop for the rise of dynamic new phenomena. One example is Leidulf Melve's Inventing the Public Sphere (2007), an audacious study that put the issue of public opinion and the public sphere firmly on the agenda of medieval research in the last decade. Melve aims to show that the large corpus of letters and treatises on investiture generated since the late eleventh century did indeed constitute the beginnings of a public sphere (Teilöffentlichkeit) in Jürgen Habermas's sense of the word, namely a part of society that is informally and broadly engaged in a critical public debate, creating the kind of public opinion that could not be controlled by the state. Early modernists have spent much time arguing that all this was already in evidence in the sixteenth and seventeenth centuries; in a similar vein, Melve has adapted Habermas's model in order to make it more applicable to the Middle Ages. Curiously, the invention of the public sphere according to Melve begins right after the period in which the public domain starts to disintegrate according to Wickham. This is not surprising, for these two authors are talking about related, but by no means identical matters. Wickham's interest is in the coherence of a political elite that remained committed to the public domain as defined by the ruler and his presence in terms of the common good; this was the central point of reference for any members of the elites that were associated with legitimate kings or emperors. It was the real legacy of Rome, which dominated Europe until the first millennium, at which point political fragmentation set in. By contrast, Melve's public sphere as it emerged during the Investiture Controversy is a more informal phenomenon, a Teilöffentlichkeit, that is, an intermediate zone between official, government-controlled communication on the one hand and the private domain on the other. More recently, Melve has explored the emergence of such a public sphere, albeit a more modest one, in the Carolingian world as well, with the divorce case of Lothar II and Theutberga as the main example. 19 There are limits, however, to the extent to which Habermas's theory can be adapted in order to show that there was ‘already’ a public sphere in a pre-modern period, for it is based on implicit assumptions about the inevitable rise of modernity in the of western As Peter has pointed out, in intellectual tradition is a and associated with the between the and the and with face-to-face It is different from the ‘public’, with its of the common and These modern research and their should be into have been to turn the public sphere into a more and less a for sphere where common are at which to the domain, to any of social that could be as In this more way of thinking about the notion of ‘public’, the construction of a public sphere does not on such as or to the of but on such as and debates on the common or on of and According to and the of a public sphere on of the common the ruler on the one hand, and the private sphere on the this is, for research into Carolingian public debates this does not much and not just because of the of in ninth-century sources. The main is the among modern historians to the domain of to that of the and to identify public opinion with the participation of the opinion only public once it the of ecclesiastical institutions and We think As to this issue this is not the to a polity sustained by monastic and by kings with bishops and In the terms debate and dialogue are at used it is to make a clear distinction between the terms in a way that is and does to the of the sources. to be the modern for any kind of discussion that is or intellectually be it public or or between two such a debate might be or through a written exchange of With regard to the early Middle has become an with a it can to discussions during public meetings such as assemblies and synods, as well as to the subsequent written and the discussion engendered by the but also to issues that were by just two the exchange of written texts, or to a exchange on a issue among more wide-ranging In the latter we can speak of ‘the debate on for example, or ‘the debate on even these discussions were of a different nature and use of different As we have the and impact of such debates, as well as the question of may have is our main Whereas debate is a modern word, and are more terms that the particular form of the The of both forms of discussion is (at least to the but it is different of argumentation and The terms and the of and could to the question-and-answer of a face-to-face or to the literary form in which the discussion was In modern the notion of as a literary form is with particular that to the of which is not the case in the medieval of the When speaking of dialogue in modern we have an discussion in in which the to the truth questions and with for This idealistic of dialogue can be in of dialogue, but as we have in the of classical for the and oral of dialogue. When we speak of on the other hand, we a and of While in a dialogue to on a to an argument and their in The between the two forms of discussion may seem is an while is a this distinction does not at all with the of our medieval sources. the word as an to while simply as a between two or more early medieval authors, texts as that we to dialogue. We only need to think of Alcuin's as on rhetoric and to where the modern and to the and practice of debate in late antiquity and the early Middle Ages. One of the main must be that modern scholarly is in classical and medieval of and than in the early medieval just Nonetheless, this tension can as a useful to the early medieval of debate. For if we to out the of debate were at the the of and normative that how issues were to be we need to attention to the that were to how the the they engaged in. by recent historians have become more in the impact of rhetoric on how was the knowledge of in late antiquity and the early Middle for the of persuasion of the intellectual elites who took part in more wide-ranging and public it that their were delivered in an elegant and to their or or to the Carolingian rulers and their who served as in debates that to and To an to these questions we might be to turn to rhetorical the discipline of rhetoric had no on debate, as and not was the of to the of and not to the question-and-answer of the dialogue and the rhetorical many that are relevant to the of debate, such as the different of argument and while rhetoric was dialectical in in the first place. we at of rhetorical treatises that were and in the early Middle however, such as De and the book of ad to we that these received any in the that the rhetorical theory to By contrast, of dialectical treatises were at least from the century onwards, in a way that to These that we should turn to instead of rhetoric to come to a of the theory and practice of debate in the Middle Ages. We have no reason to however, that rhetoric was relevant to the medieval practice of debate. form of whether the speech of the or the questions and of needs to be persuasive if it to at of on the theory of rhetoric as transmitted by rhetorical it might be more to for for debate that our medieval may have to in order to of persuasive to others of their point of we could think of debate dialogues such as the disputation of Augustine and against or the dialogues by in this one could of debate that offered useful rhetorical to persuade or one's These were that have come in in any debate. of the debates between and their such as the ones have been transmitted in that also medieval debate texts, which could be as evidence that these texts indeed served as for debate in the early Middle Ages. For this this issue opens with of the legacy of contentious literary dialogue that was so for the Carolingian world on which the other whether public disputation and dialectical could have a part in the of around 800, and the of of such As there was more room for dialectical in informal meetings than in the of or The latter are the of which the way Carolingian aimed at creating and an for debates that could the agenda and useful then takes the to the debate between of and and shows that as a was largely of his own and an integral part of his own of With we from these two for royal to the of the debate among lower They were not supposed to in this but they did so all the and shows some of the of this contribution is on the a that shows how especially in the Carolingian world of the and the to the res publica became more the of public among highly both ecclesiastical and The common of these articles is that all the authors show that the rise of Christianity did not the end of dialogue and debate. The cultural practice of and was and in the early Middle and into new by from the and classical The authors, question the still that a public sphere can only exist outside we to to as ‘the In order to this they have to show that the Carolingian of many different discussion of public debate in the century needs to from this point of not the as an notion or but the communities of and clergy and and how these into at the level of kingdoms or even the relationship between the political and the religious is not but it comes to the lively contribution of ecclesiastical institutions and to the Carolingian there is still a of to be It is to this that this issue aims to",
      "cited_by_count": 20,
      "type": "article",
      "source": {
        "name": "Early Medieval Europe",
        "type": "journal",
        "issn": [
          "0963-9462",
          "1468-0254"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "hybrid",
        "oa_url": "https://onlinelibrary.wiley.com/doi/pdfdirect/10.1111/emed.12183"
      },
      "topics": [
        "Medieval Literature and History",
        "Reformation and Early Modern Christianity"
      ],
      "referenced_works_count": 0,
      "url": "https://openalex.org/W2578511110"
    },
    {
      "openalex_id": "W2297886560",
      "doi": "10.1111/joms.12203",
      "title": "Managing for Political Corporate Social Responsibility: New Challenges and Directions for PCSR 2.0",
      "authors": [
        {
          "name": "Andreas Georg Scherer",
          "openalex_id": "A5012262713",
          "orcid": "https://orcid.org/0000-0002-8671-1721",
          "institutions": [
            "University of Zurich"
          ]
        },
        {
          "name": "Andreas Rasche",
          "openalex_id": "A5043489468",
          "orcid": "https://orcid.org/0000-0003-2160-8130",
          "institutions": [
            "Copenhagen Business School"
          ]
        },
        {
          "name": "Guido Palazzo",
          "openalex_id": "A5112390691",
          "institutions": [
            "University of Lausanne"
          ]
        },
        {
          "name": "André Spicer",
          "openalex_id": "A5055962469",
          "institutions": [
            "City, University of London"
          ]
        }
      ],
      "publication_year": 2016,
      "publication_date": "2016-03-11",
      "abstract": "ABSTRACT This article takes stock of the discourse on ‘political CSR’ (PCSR), reconsiders some of its assumptions, and suggests new directions for what we call ‘PCSR 2.0’. We start with a definition of PCSR, focusing on firms’ contribution to public goods. We then discuss historical antecedents to the debate and outline the original economic and political context. The following section explores emerging changes in the institutional context relevant to PCSR and reconsiders some of the assumptions underlying Habermas’ thesis of the postnational constellation. This highlights some neglected issues in previous works on PCSR, including the influence of nationalism and fundamentalism, the role of various types of business organisations, the return of government regulation, the complexity of institutional contexts, the efficiency of private governance, the financialization and digitalization of the economy, and the relevance of managerial sensemaking. Finally, we discuss the contributions to this special issue and relate them to the newly emerging research agenda.",
      "cited_by_count": 400,
      "type": "article",
      "source": {
        "name": "Journal of Management Studies",
        "type": "journal",
        "issn": [
          "0022-2380",
          "1467-6486"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "hybrid",
        "oa_url": "https://onlinelibrary.wiley.com/doi/pdfdirect/10.1111/joms.12203"
      },
      "topics": [
        "Political Influence and Corporate Strategies",
        "Corporate Social Responsibility Reporting"
      ],
      "referenced_works_count": 210,
      "url": "https://openalex.org/W2297886560"
    },
    {
      "openalex_id": "W1534449698",
      "doi": "10.46743/2160-3715/2005.1846",
      "title": "Preparing a Qualitative Research-Based Dissertation: Lessons Learned",
      "authors": [
        {
          "name": "Glenn A. Bowen",
          "openalex_id": "A5012329290",
          "orcid": "https://orcid.org/0000-0003-3049-6900",
          "institutions": [
            "Western Carolina University"
          ]
        }
      ],
      "publication_year": 2015,
      "publication_date": "2015-01-20",
      "abstract": "In this article, a newly minted Ph.D. shares seven lessons learned during the process of preparing a dissertation based on qualitative research methods. While most of the lessons may be applicable to any kind of research, the writer focuses on the special challenges of employing a qualitative methodology. The lessons are: (1) Read, read, read; (2) Consult the experts; (3) Adhere to university regulations; (4) Pay attention to rigor and trustworthiness; (5) Give details of the methodology; (6) Don't be afraid to include numerical data; and (7) Prepare to publish.",
      "cited_by_count": 372,
      "type": "article",
      "source": {
        "name": "The Qualitative Report",
        "type": "journal",
        "issn": [
          "2160-3715"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "gold",
        "oa_url": "https://nsuworks.nova.edu/cgi/viewcontent.cgi?article=1846&context=tqr"
      },
      "topics": [
        "Doctoral Education Challenges and Solutions"
      ],
      "referenced_works_count": 19,
      "url": "https://openalex.org/W1534449698"
    },
    {
      "openalex_id": "W2895330846",
      "doi": "10.1016/j.erss.2018.07.007",
      "title": "Promoting novelty, rigor, and style in energy social science: Towards codes of practice for appropriate methods and research design",
      "authors": [
        {
          "name": "Benjamin K. Sovacool",
          "openalex_id": "A5088822272",
          "orcid": "https://orcid.org/0000-0002-4794-9403",
          "institutions": [
            "Aarhus University",
            "University of Sussex"
          ]
        },
        {
          "name": "Jonn Axsen",
          "openalex_id": "A5090491703",
          "orcid": "https://orcid.org/0000-0001-7088-8912",
          "institutions": [
            "Simon Fraser University"
          ]
        },
        {
          "name": "Steve Sorrell",
          "openalex_id": "A5089217296",
          "orcid": "https://orcid.org/0000-0001-8084-4139",
          "institutions": [
            "University of Sussex"
          ]
        }
      ],
      "publication_year": 2018,
      "publication_date": "2018-10-03",
      "abstract": null,
      "cited_by_count": 1067,
      "type": "article",
      "source": {
        "name": "Energy Research & Social Science",
        "type": "journal",
        "issn": [
          "2214-6296",
          "2214-6326"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "hybrid",
        "oa_url": "https://www.sciencedirect.com/science/article/pii/S2214629618307230?via%3Dihub"
      },
      "topics": [
        "Energy and Environment Impacts",
        "Social Acceptance of Renewable Energy",
        "Environmental Impact and Sustainability"
      ],
      "referenced_works_count": 376,
      "url": "https://openalex.org/W2895330846"
    },
    {
      "openalex_id": "W2755883186",
      "doi": "10.1057/s41296-017-0147-6",
      "title": "Strangers in our midst: The political philosophy of immigration",
      "authors": [
        {
          "name": "Jeffrey Spring",
          "openalex_id": "A5052413990",
          "institutions": [
            "St. Francis Xavier University"
          ]
        }
      ],
      "publication_year": 2017,
      "publication_date": "2017-09-12",
      "abstract": null,
      "cited_by_count": 258,
      "type": "article",
      "source": {
        "name": "Contemporary Political Theory",
        "type": "journal",
        "issn": [
          "1470-8914",
          "1476-9336"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "bronze",
        "oa_url": "https://link.springer.com/content/pdf/10.1057/s41296-017-0147-6.pdf"
      },
      "topics": [
        "Race, History, and American Society",
        "Political Philosophy and Ethics",
        "Migration, Refugees, and Integration"
      ],
      "referenced_works_count": 1,
      "url": "https://openalex.org/W2755883186"
    },
    {
      "openalex_id": "W3118612437",
      "doi": "10.7821/naer.2021.1.616",
      "title": "Digital Rights, Digital Citizenship and Digital Literacy: What’s the Difference?",
      "authors": [
        {
          "name": "Luci Pangrazio",
          "openalex_id": "A5027740322",
          "orcid": "https://orcid.org/0000-0002-7346-1313",
          "institutions": [
            "Deakin University",
            "Impact"
          ]
        },
        {
          "name": "Julian Sefton‐Green",
          "openalex_id": "A5012358907",
          "orcid": "https://orcid.org/0000-0001-9318-4934",
          "institutions": [
            "Deakin University",
            "Impact"
          ]
        }
      ],
      "publication_year": 2021,
      "publication_date": "2021-01-01",
      "abstract": "Abstract Using digital media is complicated. Invasions of privacy, increasing dataveillance, digital-by-default commercial and civic transactions and the erosion of the democratic sphere are just some of the complex issues in modern societies. Existential questions associated with digital life challenge the individual to come to terms with who they are, as well as their social interactions and realities. In this article, we identify three contemporary normative responses to these complex issues –digital citizenship, digital rights and digital literacy. These three terms capture epistemological and ontological frames that theorise and enact (both in policy and everyday social interactions) how individuals learn to live in digitally mediated societies. The article explores the effectiveness of each in addressing the philosophical, ethical and practical issues raised by datafication, and the limitations of human agency as an overarching goal within these responses. We examine how each response addresses challenges in policy, everyday social life and political rhetoric, tracing the fluctuating uses of these terms and their address to different stakeholders. The article concludes with a series of conceptual and practical ‘action points’ that might optimise these responses to the benefit of the individual and society.",
      "cited_by_count": 217,
      "type": "article",
      "source": {
        "name": "Journal of New Approaches in Educational Research",
        "type": "journal",
        "issn": [
          "2254-7339"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "diamond",
        "oa_url": "https://naerjournal.ua.es/article/download/v10n1-1/720"
      },
      "topics": [
        "Social Media and Politics",
        "Copyright and Intellectual Property",
        "Digital Games and Media"
      ],
      "referenced_works_count": 40,
      "url": "https://openalex.org/W3118612437"
    },
    {
      "openalex_id": "W2503439275",
      "doi": "10.1007/s41463-016-0011-5",
      "title": "Understanding Humanistic Management",
      "authors": [
        {
          "name": "Domènec Melé",
          "openalex_id": "A5065935389",
          "orcid": "https://orcid.org/0000-0002-8212-8838",
          "institutions": [
            "IESE Business School",
            "Universidad de Navarra"
          ]
        }
      ],
      "publication_year": 2016,
      "publication_date": "2016-08-03",
      "abstract": null,
      "cited_by_count": 221,
      "type": "article",
      "source": {
        "name": "Humanistic Management Journal",
        "type": "journal",
        "issn": [
          "2366-603X",
          "2366-6048"
        ]
      },
      "open_access": {
        "is_oa": true,
        "oa_status": "bronze",
        "oa_url": "https://link.springer.com/content/pdf/10.1007%2Fs41463-016-0011-5.pdf"
      },
      "topics": [
        "Ethics in Business and Education",
        "Workplace Spirituality and Leadership",
        "Management Theory and Practice"
      ],
      "referenced_works_count": 119,
      "url": "https://openalex.org/W2503439275"
    }
  ],
  "count": 30,
  "errors": []
}
