[s2_search.py] Searching Semantic Scholar: 'Hayek spontaneous order tradition knowledge problem' (year=2015-2025) (field=Philosophy), limit=40
[s2_search.py] Retrieved 40/40 papers...
[s2_search.py] Cached results (cache key: s2_aff29bc17378fa74)
{
  "status": "success",
  "source": "semantic_scholar",
  "query": "Hayek spontaneous order tradition knowledge problem",
  "results": [
    {
      "paperId": "cef66ffdfe520cbf857d3068fdb87a7d253fcbd8",
      "title": "The Case of the Missing Potatoes: Reconsidering Michael Polanyi’s Spontaneous Order",
      "authors": [
        {
          "name": "G. Bíró",
          "authorId": "47277634"
        }
      ],
      "year": 2023,
      "abstract": "ABSTRACT Spontaneous order literature (“Tradition of Spontaneous Order” (1982) by Norman Barry; The Scottish Enlightenment and the Theory of Spontaneous Order (1987) by Ronald Hamowy; \"Spontaneous Order\" (1989) by Robert Sugden; \"The Theory of Spontaneous Order and Cultural Evolution in the Social Theory of F.A. Hayek\" (1990) by Peter J. Boettke; Calculation and Coordination: Essays on Socialism and Transitional Political Economy (2001) by Peter J. Boettke; Hayek's Liberalism and Its Origins: His Idea of Spontaneous Order and the Scottish Enlightenment (2001) by Christina Petsoulas; \"The Origin and Scope of Hayek’s Idea of Spontaneous Order\" (2007) by Louis Hunt; \"Spontaneous Order\" (2015) by Daniel J. D'Amico; \"Spontaneous Economic Order\" (2016) by Yong Tao) has long downplayed the ideas of Michael Polanyi. When attempts were being made to change this attitude (\"Polanyi on Liberal Neutrality\" (1996/97) by C. P. Goodman; \"Michael Polanyi and Spontaneous Order, 1941-1951\" (1997) by Struan Jacobs), they mostly suggested to replace Hayek with Polanyi as the key figure who recoined the concept for the twentieth century. Not surprisingly, scholars of Austrian economics jumped into the arena of competing priority claims (\"Against Polanyi-Centrism: Hayek and the Re-Emergence of “Spontaneous Order”\" (2005) by John P. Bladel) and claimed that Hayek, von Mises and Röpke have argued for such an order long before Polanyi’s first writing using this terminology was published in 1948. Only a few accounts attempted to present some kind of balance in this respect (Adam Smith's Political Philosophy: The Invisible Hand and Spontaneous Order (2006) by Craig Smith; The Collected Works of F.A. Hayek, Volume 15: The Market and Other Orders (2014) by Bruce Caldwell; \"Friedrich Hayek and Michael Polanyi in Correspondence\" (2016) by Struan Jacobs and Phil Mullins; The Architecture of Neoliberalism: How Contemporary Architecture Became an Instrument of Control and Compliance (2016) by Douglas Spencer; \"Editorial Introduction to ‘Collectivist Planning’ by Michael Polanyi (1940)\" (2019) by Geoffrey M. Hodgson). This paper aims to explore the so far untold characteristics of Polanyi’s spontaneous order theory through analysing archival materials and doing so offers a reason for reconsidering what we have to know about the history of spontaneous order theory. And this reconsideration might lead to developing new, more fine-grained and viable theories of spontaneous order, including those that can treat claims of spontaneous order and claims of social justice not as incompatible but as compatible aims in ordering social affairs. This perspective should, no doubt, come in handy in our increasingly polarized societies at the beginning of the twenty-first century.",
      "citationCount": 3,
      "doi": "10.1080/23801883.2023.2193704",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/cef66ffdfe520cbf857d3068fdb87a7d253fcbd8",
      "venue": "Global Intellectual History",
      "journal": {
        "name": "Global Intellectual History",
        "pages": "53 - 77",
        "volume": "10"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "4135e94fcc5cde123afedeac749faca1e3670efd",
      "title": "Can We Design Spontaneity? Hayek, Design, and the Normative Appeal of Spontaneous Orders",
      "authors": [
        {
          "name": "Nathanaël Colin-Jaeger",
          "authorId": "1489539824"
        }
      ],
      "year": 2024,
      "abstract": "Spontaneous orders are an essential concept in political theory and political economy. Such orders entail the impossibility of predicting outcomes in detail and hence controlling and directing social processes. Many phenomena characterizing contemporary societies can be depicted as spontaneous orders, from the housing and financial markets to the evolution of norms and trends. Yet, it is well known that not every spontaneous order is beneficial. Therefore, what form of political framework is compatible with recognizing such orders? In this article, I address this problem through the example of the work of Friedrich Hayek, a prominent liberal theorist of spontaneous orders. His work shows the necessity to theorize a government of spontaneous orders based on maximizing reasonable expectations and individual freedom. I finally emphasize what such a theory implies for political power, which is not abolished but should handle complexity appropriately.",
      "citationCount": 1,
      "doi": "10.23941/ejpe.v17i1.736",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/4135e94fcc5cde123afedeac749faca1e3670efd",
      "venue": "Erasmus Journal for Philosophy and Economics",
      "journal": {
        "name": "Erasmus Journal for Philosophy and Economics"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "dd230ad99f64c6f32e7ad125117e23b5c633e332",
      "title": "«Spontaneous Order» in the Political Philosophy of F. Hayek",
      "authors": [
        {
          "name": "A. A. Rud",
          "authorId": "2355715392"
        }
      ],
      "year": 2024,
      "abstract": "Aim. To analyze the concept of “spontaneous orders” in substantiation of individualistic freedom by Austro-British philosopher Friedrich August von Hayek (1899–1992). Based on the material of his key political and legal writings \"The Road to Serfdom”, “Constitution of Freedom”, “Law, Legislation and Freedom” and several articles, an analysis of the reasons for the philosopher’s use of individualism as a methodological setting for the study of social processes was given.Methodology. The analysis of the concept of “spontaneous order” was carried out within the framework of content analysis and historical-system method.Results. It is shown that there are different ideas about liberalism in political discourse, which is given the common label “neoliberalism”. The main feature of Hayek’s version of liberal ideology was the denial of universal ways of reforming the state apparatus. His analysis also contains the refusal to merge the legislative and executive powers in one administrative body of power. This thesis shows that no authority can have absolute power, as it is incapable of possessing the totality of knowledge that is in society. The article demonstrates the dependence of abstract general rights and laws on perceptions in the form of habits of individuals based on the past.Research implications. A key feature of the concept of “spontaneous order” by F. A. Hayek in contrast to other representatives of “neoliberal discourse” has been revealed.",
      "citationCount": 0,
      "doi": "10.18384/2949-5164-2024-2-133-141",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/dd230ad99f64c6f32e7ad125117e23b5c633e332",
      "venue": "Bulletin of the State University of Education. Series: History and Political Sciences",
      "journal": {
        "name": "Bulletin of the State University of Education. Series: History and Political Sciences"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "cf212a07a1fb80946657dc5fdbf08ac52fb0b484",
      "title": "Spontaneous Order Versus Central Planning: A comparison of MICHAEL POLANYI & F.A. VON HAYEK",
      "authors": [
        {
          "name": "P. Reimers",
          "authorId": "123485070"
        }
      ],
      "year": 2021,
      "abstract": "This paper evaluates and compares the main philosophic and economic thoughts of the two great liberal minds Michael Polanyi and Friedrich A. von Hayek in regards to the concept of a ‘spontaneous order’. In several of their books and papers, both Michal Polanyi (1941, 1948, 1951) and F.A. von Hayek (1944, 1945, 1964, 1973) strongly emphasised on the impossibility of socialism and the superiority of a free market versus public interventionism. Both highlighted their conviction that central planning cannot be more efficient than a spontaneous order, since knowledge is dispersed (Hayek) and tacit (Polanyi). Although both shared very similar concerns in regards to economic matters, they did not always come to the same conclusions. Thus, also the differences between Polanyi’s and Hayek’s concepts will be discussed, such as Polanyi’s emphasis on defending subsystems as the basic units of society, and his focus on maximizing “public freedom”. Both came to different conclusions in regards to the institutional character of science, and even concluded somewhat differently on the character of knowledge. Most importantly, they developed different concepts on political economy and the ideal role of the State. Moreover, this paper will consider the impact of M. Polanyi on the concept of polycentricity and on the ideas of Elinor Ostrom, while also referring to the different understanding of the role of the State in the ideas of F.A. Hayek compared to other Austrian School economists, such as Murray N. Rothbard. In addition, the paper pretends to historically analyse the emergence of the term ‘spontaneous order’, showing that it is not the product of one mind’s design, but the consequence of the thoughts of several great minds, such as Carl Menger, Ludwig * Patrick Reimers, MBA and Master in Austrian School Economics. Patrick is also holding an M.A. in Philosophy (Maestría en Filosofía) from Universidad Francisco Marroquín (UFM) and is currently a Ph.D. student at Universidad Rey Juan Carlos (Doctorando en Ciencias Sociales y Jurídicas).",
      "citationCount": 2,
      "doi": "10.52195/PM.V17I2.102",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/cf212a07a1fb80946657dc5fdbf08ac52fb0b484",
      "venue": "",
      "journal": {
        "name": "",
        "pages": "173-215",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "747476b6e2122c6f6e92325cee01fc283df616ab",
      "title": "The Dialectic of Knowledge in the Spontaneous Order: Friedrich August von Hayek",
      "authors": [
        {
          "name": "A. Eren",
          "authorId": "2059121007"
        }
      ],
      "year": 2015,
      "abstract": null,
      "citationCount": 1,
      "doi": "10.5455/EY.35601",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/747476b6e2122c6f6e92325cee01fc283df616ab",
      "venue": "",
      "journal": {
        "name": "",
        "pages": "27-55",
        "volume": "26"
      },
      "publicationTypes": null
    },
    {
      "paperId": "50f37469e70e8b30acc3de74645eb7a2105de2ed",
      "title": "From Decentralization to Ethical Resilience: A Critical Reappraisal and Extension of Hayek’s Theory of Knowledge in Society",
      "authors": [
        {
          "name": "Frans Lavdari",
          "authorId": "2365872908"
        }
      ],
      "year": 2025,
      "abstract": "Friedrich Hayek’s The Use of Knowledge in Society presents a seminal argument for the virtues of decentralized knowledge and the price mechanism, positing that markets, by leveraging dispersed, context-specific knowledge, can achieve efficient resource coordination without central oversight. Hayek’s work has deeply influenced economic thought, particularly in its defence of spontaneous order and its critique of central planning. However, Hayek’s framework, developed in a pre-digital and less interconnected economic landscape, reveals limitations when confronted with today’s challenges, such as digital monopolies, ecological degradation, and economic inequality. This article critically examines Hayek’s theoretical positions, revealing inconsistencies and limitations when applied to the complexities of modern global economies. The article then presents an evolved framework—the Ethically Resilient Market Theory (ERMT)—which builds upon Hayek’s insights, incorporating principles of ethical accountability, ecological valuation, and resilience to address the ethical and practical demands of contemporary economic life.",
      "citationCount": 0,
      "doi": "10.2139/ssrn.5133662",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/50f37469e70e8b30acc3de74645eb7a2105de2ed",
      "venue": "Social Science Research Network",
      "journal": {
        "name": "SSRN Electronic Journal"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "e2a60ef4fd484f9c52ae944dd2d1228dcd0a75c5",
      "title": "The Tradition of Spontaneous Order \"",
      "authors": [],
      "year": 2015,
      "abstract": null,
      "citationCount": 36,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/e2a60ef4fd484f9c52ae944dd2d1228dcd0a75c5",
      "venue": "",
      "journal": null,
      "publicationTypes": null
    },
    {
      "paperId": "ac7802e2cdaa1e5f715007a11faccf0696227cb4",
      "title": "The Invisible Hand of Friedrich Hayek: Submission and Spontaneous Order:",
      "authors": [
        {
          "name": "Jessica Whyte",
          "authorId": "145766859"
        }
      ],
      "year": 2017,
      "abstract": null,
      "citationCount": 37,
      "doi": "10.1177/0090591717737064",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/ac7802e2cdaa1e5f715007a11faccf0696227cb4",
      "venue": "",
      "journal": {
        "name": "Political Theory",
        "pages": "009059171773706",
        "volume": "47"
      },
      "publicationTypes": null
    },
    {
      "paperId": "dd734643a11539a681bc27b070ccffd508da62ff",
      "title": "THE EVOLUTIONARY DIMENSION OF HAYEK'S THINKING: CULTURAL SELECTION AND SPONTANEOUS ORDER",
      "authors": [
        {
          "name": "L. D. O. Buzzo",
          "authorId": "103444685"
        }
      ],
      "year": 2018,
      "abstract": null,
      "citationCount": 0,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/dd734643a11539a681bc27b070ccffd508da62ff",
      "venue": "",
      "journal": null,
      "publicationTypes": null
    },
    {
      "paperId": "4a09125b7df4589eadefde510410eec1c3611f18",
      "title": "Hayek, Buchanan and the justification of the market",
      "authors": [
        {
          "name": "Robert Sugden",
          "authorId": "2240369683"
        }
      ],
      "year": 2024,
      "abstract": "This paper discusses the work of two twentieth‐century liberal economists, Friedrich Hayek and James Buchanan, who have made lasting contributions to our understanding of the role of the market in a free society. I argue that they offer significantly different but complementary visions of the value of the market as a system of individual freedom. Hayek's vision is of the price system as a marvel of spontaneous order which solves a fundamental economic problem – that of making efficient use of a totality of knowledge that is divided between individuals. Buchanan's vision is of the market as a space in which individuals are free to make voluntary exchanges. In his words, ‘this is all that there is to it’: the market is not a solution to any collective problem. These visions have a common blind spot. Both writers recognise the need for programmes of social insurance and consider how they should structured so as to be as compatible as possible with the workings of a market economy and a liberal democracy. But, I argue, neither sees the full importance of social insurance in a justification of the market system.",
      "citationCount": 3,
      "doi": "10.1111/kykl.12406",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/4a09125b7df4589eadefde510410eec1c3611f18",
      "venue": "Kyklos (Basel)",
      "journal": {
        "name": "Kyklos"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "4c4abf4a29bc995cdeaf0d03ed8f4bfb8cf207e4",
      "title": "Economic and Philosophical Implications of Hayek's 'Knowledge Problem'",
      "authors": [
        {
          "name": "N. Cachanosky",
          "authorId": "102281099"
        },
        {
          "name": "Alexandre Padilla",
          "authorId": "40804647"
        }
      ],
      "year": 2015,
      "abstract": null,
      "citationCount": 4,
      "doi": "10.2139/ssrn.2436649",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/4c4abf4a29bc995cdeaf0d03ed8f4bfb8cf207e4",
      "venue": "",
      "journal": {
        "name": "PSN: Other Political Theory: Political Philosophy (Topic)"
      },
      "publicationTypes": null
    },
    {
      "paperId": "c6a8be77ce1b43541c83abffac47d7dee18882a4",
      "title": "Hayek and the concept of freedom: a summary",
      "authors": [
        {
          "name": "Facundo Guadagno",
          "authorId": "2276366512"
        }
      ],
      "year": 2024,
      "abstract": "This paper examines the pivotal concept of freedom in Friedrich Hayek’s extensive work, which is the foundation for his political, economic, and scientific theories. Hayek’s notion of freedom is multifaceted, encompassing political freedom as the absence of arbitrary coercion, economic freedom as the effective use of dispersed knowledge through market mechanisms, and scientific freedom as the recognition of subjective knowledge and the limits of central planning. The study is divided into three sections: an introduction, a detailed analysis of freedom in Hayek’s works, and a conclusion. By analyzing key texts such as The Road to Serfdom (1944), Individualism and Economic Order (1948), The Constitution of Liberty (1960), Law, Legislation and Liberty (1978), and The Fatal Conceit (1991), the paper highlights Hayek's preference for spontaneous orders over constructed ones, his critique of centralization, and his advocacy for the rule of law as essential for individual liberty and societal progress. Ultimately, Hayek’s comprehensive analysis underscores the critical role of freedom in fostering a free and prosperous society, emphasizing the superiority of decentralized processes and market mechanisms in promoting social progress and innovation.",
      "citationCount": 0,
      "doi": "10.33064/34euph7528",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/c6a8be77ce1b43541c83abffac47d7dee18882a4",
      "venue": "Euphyía",
      "journal": {
        "name": "Euphyía"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "4de221888f21f6de6a35fdc38890757a0d9db195",
      "title": "The problem of tradition and philosophical strategies of modernity",
      "authors": [
        {
          "name": "A. Sokolov",
          "authorId": "2052145863"
        },
        {
          "name": "N. Kuznetsov",
          "authorId": "123798870"
        }
      ],
      "year": 2021,
      "abstract": "The article is devoted to the question of the correlation between the formation of philosophical methodology in the modern era and the problematization of tradition in the humanities. The authors believe that the theme of tradition was one of the starting points for the development of humanitarian knowledge and, at the same time, contributed to the methodological expansion of philosophical research. Already at the end of the 18th century, romantics, fascinated by antiquity, made attempts to rationalize the emergence of religious texts from the Middle Ages. Their predominant interest in history led to the assumption that any form of knowledge can be rationally reconstructed. However, in order to do this it was necessary to expand the factual account of each of the studied phenomena. The romantics thereby largely anticipated the research intentions of classical positivism, without turning away from the defining role of intellectual intuition, which grasps the experimental content of consciousness with a concept. All humanitarian knowledge (history, psychology, linguistics) from the second half of the 19th century developed in this direction. The authors pay special attention to W.Dilthey’s interest in the topic of tradition and the congeniality of philosophical hermeneutics and the late phenomenology of E.Husserl. Further, the role of phenomenology and hermeneutics in the development of historical methodology is analyzed on the example of the Annales school, and then the role of the latter in the origin and development of structuralism. In conclusion, the authors hypothesize that the philosophical traditionalism of R.Guenon and his followers, declaring their rejection of New European rationalism, reproduces the general methodological model of the era and anticipates postmodern intellectuals.",
      "citationCount": 0,
      "doi": "10.21638/spbu17.2021.401",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/4de221888f21f6de6a35fdc38890757a0d9db195",
      "venue": "Vestnik of Saint Petersburg University. Philosophy and Conflict Studies",
      "journal": {
        "name": "Vestnik of Saint Petersburg University. Philosophy and Conflict Studies"
      },
      "publicationTypes": null
    },
    {
      "paperId": "c2a1a5f68560345e52fdc8c4f4fbc283662d6bf4",
      "title": "The order and rules in Hayek",
      "authors": [
        {
          "name": "Magdaléna Steinhauser Wesserlová",
          "authorId": "2075515162"
        }
      ],
      "year": 2017,
      "abstract": "The paper is focused on the problem of freedom in F. A. Hayek. Content of the work is targeted for analysis of order in society. Te paper is trying to define, describe and analyze two kinds of order, and that spontaneous and created, and then find and break down first and most fundamental prerequisite for defining a need for a clearer grasp of negative liberty. The aim of this work is also to analyze a set of rules in general, because the rules of human behavior stopped in Hayek's idea produced equally significant position as the order. In this context, it wants the text to highlight the causal connection of order with the rules, which built so to prevent chaos in society and maintaining its functional progress. The intention of this paper is through the order and rules, as two general as well as probably the most important pillars of Hayek's ideological concept to highlight their importance as indicators of the minimal efforts to define the scope of freedom.",
      "citationCount": 0,
      "doi": "10.18267/j.e-logos.444",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/c2a1a5f68560345e52fdc8c4f4fbc283662d6bf4",
      "venue": "",
      "journal": {
        "name": "",
        "pages": "13-24",
        "volume": "2017"
      },
      "publicationTypes": null
    },
    {
      "paperId": "58ddf3577cbf55038b93e3ebbfa1968f2647e2ec",
      "title": "Critical rationalism and institutional change in Hayek",
      "authors": [
        {
          "name": "Eduard Angeli",
          "authorId": "137354023"
        }
      ],
      "year": 2024,
      "abstract": "ABSTRACT The institutional analysis promoted by F. A. Hayek seeks to understand how human action and coordination among individuals occur in an environment where the knowledge held by each person is incomplete and not fully transmittable. In such an environment, the institutional framework plays an important role in conditioning, at least partially, the behavior of members within a spontaneously emerging social order. In light of this, the objective of this article is to present Hayek’s evolutionary institutional approach by organizing the discussion proposed by the Austrian economist on the subject. To do so, it will discuss Hayek’s distinction between critical rationalism and constructivist rationalism. It will also address Hayek’s explanation of institutional change and delve into his evolutionary approach to the social sciences, as opposed to the natural sciences.",
      "citationCount": 1,
      "doi": "10.1590/0101-31572024-3602",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/58ddf3577cbf55038b93e3ebbfa1968f2647e2ec",
      "venue": "Brazilian Journal of Political Economy",
      "journal": {
        "name": "Brazilian Journal of Political Economy"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "d7c57ef30daa265a39e470646c25e50cefe4700b",
      "title": "Energy Systems and the Knowledge Problem: The Case of Biofuels",
      "authors": [
        {
          "name": "S. Ammous",
          "authorId": "9424270"
        }
      ],
      "year": 2015,
      "abstract": null,
      "citationCount": 0,
      "doi": "10.2139/ssrn.2832740",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/d7c57ef30daa265a39e470646c25e50cefe4700b",
      "venue": "",
      "journal": {
        "name": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "70c66a9c0dd20f5d8231c860390245a632e56392",
      "title": "PRACTICAL ETHICS IN THE STRUCTURE OF PHILOSOPHICAL KNOWLEDGE",
      "authors": [
        {
          "name": "Y. Parusimova",
          "authorId": "151264019"
        }
      ],
      "year": 2025,
      "abstract": "The article is devoted to the study of practical ethics in the context of historical and philosophical tradition and modern discussions. The praxeological assessment of philosophical knowledge is considered. The purpose of the article is to draw attention to the increasing role of practical and applied ethical knowledge in all spheres of human life and activity on the basis of philosophical discourses in order to affirm the author’s idea of the value and importance of practical ethics in the structure of philosophical knowledge. In this connection, the analysis of the problem of conceptualization of the concepts of applied ethics and practical ethics is carried out.\n\nThe author traces the origins of the concept, starting with ancient ethics, which, according to Aristotle, has a dual character; it acts both as a theoretical and as a practical discipline aimed at the formation of virtuous behavior. The contribution of I. Kant is emphasized, who linked morality with the autonomy of the will and freedom, which consolidated ethics as the core of practical philosophy.\n\nThe focus is on modern interpretations of practical and applied ethics in relation to theoretical philosophical knowledge. The positions of leading Russian philosophers are analyzed, discussing the differences between theoretical ethics, which studies abstract moral principles, and applied ethics, which focuses on solving specific moral dilemmas in professional and social contexts. Special attention is paid to the role of ethics in the context of global challenges: the author considers it as a tool for the formation of responsible behavior, civic responsibility and professional competence aimed at serving the benefit of society, individual communities and citizens in accordance with the specifics of their professional activities. intercultural dialogue and protection of human dignity.\n\nThe article highlights the increasing importance of practice-oriented ethical knowledge in education and professional activities, as well as its potential to overcome modern crises. It is concluded that practical philosophy, while maintaining its connection with the ancient Kantian tradition, evolves in response to the demands of society, integrating ethical principles into various spheres of human practice and contributing to sustainable development.",
      "citationCount": 0,
      "doi": "10.25198/2077-7175-2025-2-113",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/70c66a9c0dd20f5d8231c860390245a632e56392",
      "venue": "Intellect. Innovations. Investments",
      "journal": {
        "name": "Intellect. Innovations. Investments"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "07a9fec3e6c2b6b0ca5d3cdfc6e1de0b3af02ec2",
      "title": "Institutional thinking: “Plato’s Problem” and understanding the social",
      "authors": [
        {
          "name": "Denis Gvozdikov",
          "authorId": "117392925"
        }
      ],
      "year": 2025,
      "abstract": "The article examines problems that arise when trying to explain social reality. It appears that a genuine explanation must be able to answer the following questions: how are peo­ple able to comprehend complex phenomena of the social world (such as institutions) that are not related to the reality of physical bodies; how can each individual possess knowl­edge of a potentially unlimited set of social situations, involving a potentially unlimited number of rules for building social relations; and how is the universality of institutions combined with their cultural and situational variability. Similar questions have been raised in linguistics within the framework of universal grammar and some internalist ap­proaches to language and thought. Within the sociological tradition, externalist interpreta­tions of the nature of social reality and the phenomenon of social order have historically prevailed. However, the arguments previously proposed in favor of an innate language faculty also seem legitimate in relation to the human ability to process and represent so­cial information – namely, institutional thinking. Intuitive knowledge of the system of so­cial world rules (knowledge of society) requires solving the “Plato’s problem”: con­structing models of perception and learning (processing and representation of social information). From the author’s point of view, the assumption of “mental tools” could ex­plain how all participants in interaction grasp the common logic of constructing institu­tional forms.",
      "citationCount": 0,
      "doi": "10.21146/2072-0726-2025-18-4-111-122",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/07a9fec3e6c2b6b0ca5d3cdfc6e1de0b3af02ec2",
      "venue": "Philosophy Journal",
      "journal": {
        "name": "Philosophy Journal"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "002d9f9e01d824ee7b2a24e5e420b521a88f469f",
      "title": "The Problem of Discursive Ambiguity of F. Nietzsche’s Text Thus Spoke Zarathustra",
      "authors": [
        {
          "name": "Alexander A. Sysolyatin",
          "authorId": "2135323430"
        }
      ],
      "year": 2025,
      "abstract": "The article analyses discursive characteristics of the main character of F. Nietzsche’s work Thus Spoke Zarathustra. The problematic status of this text, which combines artistic and conceptual elements, makes the research tradition return to this work of Nietzsche in search of new ways of interpretation. We focus on the discursive approach in relation to Zarathustra, within the framework of which the main objects of consideration are the parameters of speech and knowledge of the central Nietzschean character. The paper demonstrates the connection between the discursive figure of God and the figure of Zarathustra. In various contexts within the very work under consideration and also in his related texts, Nietzsche shows that the prophetic status of the protagonist cannot be determined on the basis of the idea of expected revelation, i.e. unity of knowledge. Unlike the divine position, seeking to establish certain unity of meaning, the discursive position of Zarathustra requires the preservation of ambiguity. In order to propose a description of such a mode of speech, which could express ambiguity but at the same time produce some knowledge, we addressed the discursive figure of laughter in Thus Spoke Zarathustra. This figure appears in the text precisely in those moments when Zarathustra exposes some kind of knowledge or, crucially, is exposed himself. Laughter acts as a marker of situations in which Zarathustra as a prophet approaches the knowledge he seeks, but stops at the very edge of the disclosure of meaning. Based on the obtained description of the discursive position of the main character of the work, we put forward the assumption that the interpretation of the text requires not the interpretation of the content of the text, but first of all the interpretation of its experimental form.",
      "citationCount": 0,
      "doi": "10.35853/vestnik.gu.2025.13-4.12",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/002d9f9e01d824ee7b2a24e5e420b521a88f469f",
      "venue": "Bulletin of Liberal Arts University",
      "journal": {
        "name": "Bulletin of Liberal Arts University"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "5fc3fde925859e05a667d0cd838eea9a06ca455a",
      "title": "Imperfectly perfect universe? Emerging natural order in Thomas Aquinas",
      "authors": [
        {
          "name": "P. Roszak",
          "authorId": "2606310"
        }
      ],
      "year": 2022,
      "abstract": "Scientific data indicate that violence is involved in the emergence of higher forms of life from lower forms. This seems incompatible with the God of Christian revelation, who is the source of love and mercy. Current attempts to explain this tension usually focus on two approaches: the ‘gift of freedom’ (McLeish) or the ‘only way’ theory (Southgate). I will argue that Thomas Aquinas’ understanding of nature is able to provide an interesting framework for the challenges posed by the way of the appearance of life. The article will present Aquinas’ theology of nature, which seems to fit perfectly with the current state of scientific knowledge, especially when considering the relationship between God and creation.Contribution: The article shows that the problem of the interpretation of paradise in the Christian tradition may be related to the influence of the Neoplatonic tradition, which reduces paradise to the idealistic sphere. Attention is drawn to the concept of perfection, which does not mean the absence of any disvalue in the natural world, but is a relational concept. The death of animals and natural evil need not be explained by moral evil, but requires a broader interpretation of the value of the natural order.",
      "citationCount": 11,
      "doi": "10.4102/hts.v78i2.7199",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/5fc3fde925859e05a667d0cd838eea9a06ca455a",
      "venue": "HTS Teologiese Studies/Theological Studies",
      "journal": {
        "name": "HTS Teologiese Studies / Theological Studies"
      },
      "publicationTypes": null
    },
    {
      "paperId": "d7e7f75dd407f42b5e4a8f795957fc080d947f42",
      "title": "The Possibility or Impossibility of Islamization of Knowledge in a Neoliberal Market Order",
      "authors": [
        {
          "name": "Omar Javaid",
          "authorId": "113822639"
        },
        {
          "name": "Wahab Suri",
          "authorId": "2005324071"
        }
      ],
      "year": 2020,
      "abstract": "Received: 07 January 2019 Accepted: 17 March 2020 Abstract. This paper argues that the project of the Islamization of Knowledge (IoK) has overlooked the role of a neoliberal politicoeconomic order in the knowledge production along with the relation between knowledge and the market established by economic liberalization. So the resulting discourse perhaps inadequately explains the incapacity of contemporary application of Islamic economics and finance to provide a viable alternative to western economic systems, let alone solve socioeconomic problems in Muslim countries. This paper will attempt to cover this inadequacy by explaining the relation between mind, knowledge and market as theorized by Hayek, along with Foucault’s perspective power-knowledge nexus. The Hayek’s and Foucault’s perspective on the relation between state, market, mind and knowledge creates an interesting challenge for IoK because it is not only the issue of reconciliation of the spheres of knowledge, rather free unhampered flow of market is also presumably necessary for the growth of human mind and consequently human knowledge as argued by Hayek and Foucault. The neoliberal-state allows free unhampered flow of the market, subsequently creating knowledge in pursuit of continuous capital accumulation. Production of knowledge, therefore, becomes a mechanism to maintain the hegemony of the neoliberal-state and market, while establishing authority of capital on ontological position of man and society. In this context any intervention in the process of IoK under religious obligation is not just an epistemological, rather a moral impossibility within capitalist discourse. The relationship between the neoliberal-state, market and production of knowledge will enable the scholars of Islamic economics and finance to reassess their strategies pertaining to IoK.",
      "citationCount": 4,
      "doi": "10.26501/jibm/2020.1001-010",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/d7e7f75dd407f42b5e4a8f795957fc080d947f42",
      "venue": "",
      "journal": {
        "name": "",
        "pages": "148-169",
        "volume": "10"
      },
      "publicationTypes": null
    },
    {
      "paperId": "9002d787162719612a176c76d86d870242e30e97",
      "title": "La concezione neoliberale della storia: la saldatura tra neoliberismo e revisionismo storico in Friedrich von Hayek",
      "authors": [
        {
          "name": "B. Paci",
          "authorId": "133717448"
        }
      ],
      "year": 2021,
      "abstract": null,
      "citationCount": 0,
      "doi": "10.14276/2531-9582.2989",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/9002d787162719612a176c76d86d870242e30e97",
      "venue": "",
      "journal": {
        "name": "",
        "pages": "38-82",
        "volume": "10"
      },
      "publicationTypes": null
    },
    {
      "paperId": "e1330c810fd310816bb4980c2c62b81d51fdf8bc",
      "title": "Knowledge as Problem Solving",
      "authors": [
        {
          "name": "Carlo Cellucci",
          "authorId": "1778013"
        }
      ],
      "year": 2017,
      "abstract": null,
      "citationCount": 2,
      "doi": "10.1007/978-3-319-53237-0_14",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/e1330c810fd310816bb4980c2c62b81d51fdf8bc",
      "venue": "",
      "journal": {
        "name": "",
        "pages": "187-198",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "ec70a04458d586b790889533cb7d74595c191c1a",
      "title": "The Problem of Desire: Psychoanalysis as a Jewish Wisdom Tradition",
      "authors": [
        {
          "name": "S. Aronson",
          "authorId": "144253962"
        }
      ],
      "year": 2019,
      "abstract": "In Havah Tirosh-Samuelson’s extensive monograph “Happiness in Premodern Judaism: Virtue, Knowledge and Well-being”, she argues that from ancient times onward within Judaism, the achievement of happiness, the eudaemonia so ardently sought by the wisdom and philosophical traditions of antiquity, became inextricably linked to the Torah. The Torah was seen to provide the blueprint, the basis, for a happy and fulfilling life. She writes, “the ancient Israelite Wisdom tradition (whose prime exemplar was the Biblical book of Proverbs) was practical and pragmatic. Based on the observation of nature and human conduct, it was concerned with ordering life so as to maximize success and prosperity. Its teachings enabled the learner to master his environment and cope with the dangers and vicissitudes of life” (Tirosh-Samuelson, 2003, p. 58). Self discipline was thus not only a command, but a virtue, with the goal being the individual’s mastery of desires and impulses. Seen in this light, the Ten Commandments came to represent the highest catalogue of virtues (Tirosh-Samuelson, p. 94). By following these commandments, wrote the Jewish philosopher Philo (15 BCE-50CE), one",
      "citationCount": 0,
      "doi": "10.1515/9781618111081-014",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/ec70a04458d586b790889533cb7d74595c191c1a",
      "venue": "",
      "journal": {
        "name": "",
        "pages": "313-326",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "35ee03511f458d3d4051114ab1bc1c2b2ba650f3",
      "title": "Cultural analysis of the relationship between tradition and innova",
      "authors": [
        {
          "name": "Zh. Abikenov",
          "authorId": "2265609594"
        }
      ],
      "year": 2023,
      "abstract": "This article analyzes the problems of the relationship between tradition and innovation in cultural and philosophical terms. The relationship between tradition and innovation has been the subject of cultural and philosophical discussions for centuries. One way to understand the relationship between tradition and innovation is to consider them as opposing forces. According to this view, tradition refers to the values, beliefs and practices passed down from generation to generation, while innovation refers to the pursuit of progress, change and innovation. Proponents of this view believe that tradition can stifle progress and creation, and innovation can lead to the loss of cultural heritage. In the article, the study of tradition and innovation in culture was carried out through various methods. A historical analysis was carried out. This method made it possible to study the history of philosophical thought in order to understand the tradition and development of certain schools or ideas. A review of existing works on the subject was made to gain a deeper understanding of tradition and innovations in culture and to identify gaps in current knowledge. To determine how cultural factors influence innovation, cultural traditions and practices in society were compared.",
      "citationCount": 0,
      "doi": "10.31489/2023hph2/255-264",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/35ee03511f458d3d4051114ab1bc1c2b2ba650f3",
      "venue": "Bulletin of the Karaganda university. \"History. Philosophy\" series",
      "journal": {
        "name": "Bulletin of the Karaganda university History.Philosophy series"
      },
      "publicationTypes": [
        "JournalArticle",
        "Review"
      ]
    },
    {
      "paperId": "b08907735ea763377800d6bc4e1b193a0996ed17",
      "title": "Logos and Purusha: A Comparative Study of Eastern Orthodox Christianity and Hinduism(s) \nthrough the Transcendental Argument for God",
      "authors": [
        {
          "name": "Michael Searles",
          "authorId": "2351370910"
        }
      ],
      "year": 2024,
      "abstract": "In a series of papers I seek to draw a comparison between Hinduism and Eastern Orthodox Christianity. Inspired by the Anthropic Principle, I have selected to ground the linked comparative principle of the Purusha, (the immobile cosmic principle of pure consciousness, unattached and unrelated to anything, which is nonactive, unchanging, eternal) central to many of the differing traditions of Hinduism, and liken this to the Logos of Christianity. In order to navigate through the differing paradigms I use the Transcendental Argument for God as the filter by which we can analyse these models. In analysing the necessary presuppositions and to see which tradition best coheres with the web of embodied beliefs, I also aim to unite Philosophical terminology and principles with that of Theology. In order to circumvent the problem of circularity, I want to avoid Saṃsāra (a Sanskrit word that connotes ‘wandering’ and also ‘world’, wherein the term connotes ‘cyclic change’) through the correct Pramana (Knowledge-Epistemology). This is taken to be found in the Purusha and also grasped within the Logos (a concept word symbolic of the nature and purpose of Jesus Christ). We appreciate in this paper that both Hinduism(s) and Christianity accept Divine Revelation and the Universal Mind as the basis for Knowledge.",
      "citationCount": 0,
      "doi": "10.46222/pharosjot.105.5034",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/b08907735ea763377800d6bc4e1b193a0996ed17",
      "venue": "Pharos Journal of Theology",
      "journal": {
        "name": "Pharos Journal of Theology"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "07f238778caabb5844ad537b707294c56730ebe7",
      "title": "Verification of conditions of using mathematics as a philosophical and methodological problem",
      "authors": [
        {
          "name": "Vladimir M. Reznikov",
          "authorId": "2369643187"
        }
      ],
      "year": 2024,
      "abstract": "In the article I demonstrate the value of philosophical research in science by the example of verification of conditions of using mathematics. In recent years, scientists in expert systems often use philosophical concepts, in particular the notion “causal relation” for introducing probabilistic independency, as the mathematical description of independency is not so constructive; therefore, verification of independency in data is a hard problem. Thus, by using philosophical notions in science, analytic philosophers have good chances to participate in multidisciplinary research, as non-philosophers do not commonly have wide and deep knowledge of philosophy. I draw on the example of the famous mathematician Shafer, who used a special version of causal relation to describe independency in his conception of a general probabilistic interpretation. The famous philosopher Cartwright raised a natural question about the adequacy of this interpretation for analyzing other causal relations. I offer another example of usefulness of philosophical analysis for verifying the conditions of application of mathematics which is connected with statistical wars. Statistical wars are battles between representatives of different probability interpretations; in particular, history knows severe battles between representatives of frequency and subjective interpretations. The followers of frequency interpretation are empiricists, the empirical tradition requires a careful verification of conditions of application of the formal apparatus, but such tests are not necessary in the subjective tradition, this is why their critique of opponents is not solid. I used such argumentation in my article in order to show that the critique of Kolmogorov’s conditions of using probability theory on the basis of Bernoulli theorem by subjectivists is not a serious one. Besides, for an analytic philosopher who knows mathematical methods and can use them, new prospects are opening up due to imperfections of mathematical methods. The point is that scientists try to avoid criticizing shortcomings in the methods in the absence of alternative approaches, so a philosopher receives the chance to participate in research as a critic of imperfections of formal methods in applications.",
      "citationCount": 0,
      "doi": "10.17223/1998863x/79/4",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/07f238778caabb5844ad537b707294c56730ebe7",
      "venue": "Vestnik Tomskogo gosudarstvennogo universiteta Filosofiya Sotsiologiya Politologiya",
      "journal": {
        "name": "Vestnik Tomskogo gosudarstvennogo universiteta. Filosofiya, sotsiologiya, politologiya"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "32589a23929c84570779dc33c2130dd35cef7919",
      "title": "Immodest Proposals: Research Through Design and Knowledge",
      "authors": [
        {
          "name": "Jeffrey Bardzell",
          "authorId": "1804390"
        },
        {
          "name": "Shaowen Bardzell",
          "authorId": "1800842"
        },
        {
          "name": "L. K. Hansen",
          "authorId": "21580721"
        }
      ],
      "year": 2015,
      "abstract": null,
      "citationCount": 154,
      "doi": "10.1145/2702123.2702400",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/32589a23929c84570779dc33c2130dd35cef7919",
      "venue": "International Conference on Human Factors in Computing Systems",
      "journal": {
        "name": "Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems"
      },
      "publicationTypes": [
        "JournalArticle",
        "Book",
        "Conference"
      ]
    },
    {
      "paperId": "ec8a23bd55017007b1b634b6a7dbcc765a9810aa",
      "title": "DYNAMICS OF THE THEORETICAL RATIONALE FOR THE CONCEPT OF “TRADITION” AND ITS CLASSIFICATION",
      "authors": [
        {
          "name": "V. Balabushka",
          "authorId": "121468875"
        }
      ],
      "year": 2022,
      "abstract": "The article is devoted to the dynamics and evolution of the concept of «tradition» which for a long time in European historiography has evolved into a synergy of related sciences such as philosophy, ethnology, religion, art history, ethnography, and others. In this work, the content of the etymology of the concept of “tradition” is deciphered, the types and classification of this concept are analyzed, which comprehensively constitutes scientific knowledge on this issue. The foundation of a meaningful understanding of the concept of “tradition” was and continues to be the result of material and spiritual socio-cultural heritage, which determines national identity and statehood and is the result of collective human activity in general and each nation in particular. The following research is based on the heuristic method of systematization of existing modern scientific thought, which formed the cultural studies direction of the reconstruction of the holistic process of the problem; historical and retrospective for the study of historical and theoretical aspects of the content of the concept of “tradition”, the evolution of development in national and foreign historiography, and chronological to reveal the state of scientific research on the problem in historical and chronological order.",
      "citationCount": 0,
      "doi": "10.30525/2592-8813-2021-2-3",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/ec8a23bd55017007b1b634b6a7dbcc765a9810aa",
      "venue": "Baltic Journal of Legal and Social Sciences",
      "journal": {
        "name": "Baltic Journal of Legal and Social Sciences"
      },
      "publicationTypes": null
    },
    {
      "paperId": "4bb47826a3cd567eb27e7daaf105683f9a2e8601",
      "title": "Domestic Humanistic Tradition and Ukrainian Vocabulary as Primary Sources for Scientific Terminology in Professional Areas of Environment Creation",
      "authors": [
        {
          "name": "S. Tsarenko",
          "authorId": "2089782291"
        }
      ],
      "year": 2022,
      "abstract": "The purpose of the article is to find domestic lexical definitions of architecture, urbanism, and environmental design. The methodology of the research is an interdisciplinary synthesis of knowledge based on dialectics (H. Hegel) and the general theory of systems (L. von Bertalanffy). Scientific novelty. For the first time, the author has analysed the problem of the completeness of the domestic terminology on environment creation to express original meanings according to the Cyrillic humanistic tradition, and specialisations of activity. It has been proposed to introduce into scientific circulation a general definition of a group of professional artistic directions for creating an environment for human life as a hierarchical environmental image creation, the purpose of which is the integral beauty of spatial forms. Conclusions. The content of the borrowed terminology requires a more careful selection, as it is intended to enrich the vocabulary and clarify relevant industry concepts and professional specialisations, in particular, according to international qualification definitions. However, lexical borrowings do not have sufficient potential for worldview, mental-cognitive compliance with the national linguistic environment. In order to ensure national philosophical goal setting, in accordance with the national Slavic-Greek-Latin tradition of a complete and true Living Word, we need, along with borrowed names and terminology, to use primarily national, including Old Slavic, vocabulary in quality of the main methodological one. The domestic humanistic tradition, the peculiarities of word formation and the lexical fund of the Ukrainian literary language make it possible to return to wider use the national name of the content and purpose of an artistic composition (leepota) and to introduce into scientific circulation the natural definition of object-spatial arts, namely \"environmental imagery\" as well as «hierarchical environmental imagery». \nKey words: architecture, harmony, design, Living Word, architectonics, architectonic urban development, composition, leepota, urban planning, creating the environment, terminology, philosophy of hierarchy of environment creation.",
      "citationCount": 0,
      "doi": "10.32461/2226-0285.2.2022.270564",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/4bb47826a3cd567eb27e7daaf105683f9a2e8601",
      "venue": "Almanac \"Culture and Contemporaneity\"",
      "journal": {
        "name": "Almanac \"Culture and Contemporaneity\""
      },
      "publicationTypes": null
    },
    {
      "paperId": "b2b7fc080f3eb84191ab6cd9a24f914783936090",
      "title": "THE PROBLEM OF REVELATION AND PHILOSOPHIZING IN GAUDIYA VEDANTA",
      "authors": [
        {
          "name": "D. N. Popov",
          "authorId": "2332100934"
        }
      ],
      "year": 2024,
      "abstract": "The research is aimed at the historical and philosophical reconstruction of the problems of Gaudiya Vedanta theory of knowledge related to philosophizing, the concept of revelation and qualification (adhīkāra), in the philosophy of India of XVI–XX centuries. Gaudiya Vedanta, the philosophy of Gaudiya Vaishnavism, is the last independent branch of Vedanta in Indian philosophy, which summarizes in its texts the problems and solutions of previous Vedanta movements in the XVI century. The specificity of this school lies in the emphasis on personalism, ethics and aesthetics. The approach of «world philosophy» (F. I. Shcherbatskoy, V. K. Shokhin, R. V. Pshu) was used for the study, according to which in the philosophy of each developed culture we can find similar philosophical problems in varying degrees of elaboration in connection with a unique historical situation. Based on this approach, a historical and philosophical reconstruction of the hermeneutics of Gaudiya Vedanta is carried out, in which philosophizing is considered as the result of the process of revelation. The historical and philosophical analysis allowed us to identify two stages of the formation of the concept of revelation (śabda, śāstra, samādhi, veda) and qualification (adhīkāra) in Gaudiya Vedanta: classical (Jiva Gosvami and Krishnadas Kaviraja, Visvanatha Chakravarti XVI–XVII centuries), modern (Bhaktivinoda, Bhaktisiddhanta, Bhaktivedanta XIX–XX centuries). The analysis of historiography shows that Gaudiya Vedanta, using the apparatus of new logic (navya-nyaya), entered the age of globalization and accepted the challenges not only of the existing tradition of Indian philosophy, but also of European philosophy. For this purpose, the school used a system of interpretation and receiving revelations both inside and outside the sacred sphere with an expanded understanding of revelation and sacredness. In addition, Gaudiya Vedanta formulated special requirements for a thinker working with revelation. These requirements were supposed to preserve the uniqueness of the school and ensure intellectual continuity. They imply the need for the philosopher to have both some academic qualification (theology of the first order): knowledge of texts, their logic of explanation, prudence and insight, and spiritual qualifications (theology of the second order): morality, detachment and, in particular, sensitivity to religious emotions in relation to God. The historical and philosophical reconstruction allowed us to explicate a special model of philosophizing of Gaudiya Vedanta, based on revelation, personalistic theology, ethics and aesthetics. The results of the research can be useful for historians of Eastern philosophy with new material, analysis of concepts, explication of the role of historical and philosophical contexts.",
      "citationCount": 0,
      "doi": "10.25198/2077-7175-2024-5-136",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/b2b7fc080f3eb84191ab6cd9a24f914783936090",
      "venue": "Intellect. Innovations. Investments",
      "journal": {
        "name": "Intellect. Innovations. Investments"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "bfeea26c3ad09f80b29f1075d5e8e4c30a6f0bd9",
      "title": "Ostrom Amongst the Machines: Blockchain as a Knowledge Commons",
      "authors": [
        {
          "name": "Herminio Bodon",
          "authorId": "108127723"
        },
        {
          "name": "Pedro J. Bustamante",
          "authorId": "32600237"
        },
        {
          "name": "Marcela M. Gomez",
          "authorId": "123760338"
        },
        {
          "name": "Prashabnt Krishnamurthy",
          "authorId": "144482423"
        },
        {
          "name": "M. J. Madison",
          "authorId": "46848228"
        },
        {
          "name": "Ilia Murtazashvili",
          "authorId": "100973288"
        },
        {
          "name": "J. Murtazashvili",
          "authorId": "107595599"
        },
        {
          "name": "Tymofiy Mylovanov",
          "authorId": "2142728"
        },
        {
          "name": "Martin Weiss",
          "authorId": "144069571"
        }
      ],
      "year": 2019,
      "abstract": "Blockchains are distributed ledger technologies that allow the recording of any data structure, including money, property titles, and contracts. In this paper, we suggest that Hayekian political economy is especially well suited to explain how blockchain emerged, but that Elinor Ostrom’s approach to commons governance is particularly useful to understand why blockchain anarchy is successful. Our central conclusions are that the blockchain can be thought of as a spontaneous order, as Hayek anticipated, as well as a knowledge commons, as Ostrom’s studies of self-governance anticipated.",
      "citationCount": 13,
      "doi": "10.2139/ssrn.3462648",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/bfeea26c3ad09f80b29f1075d5e8e4c30a6f0bd9",
      "venue": "Social Science Research Network",
      "journal": {
        "name": "ERN: Technology (Topic)"
      },
      "publicationTypes": null
    },
    {
      "paperId": "be8865426ef8a5f329fa6f10ea74a6083da8c609",
      "title": "Three Skepticisms in Cārvāka Epistemology: The Problem of Induction, Purandara’s Fallibilism, and Jayarāśi’s Skepticism about Philosophy",
      "authors": [
        {
          "name": "Ethan A Mills",
          "authorId": "113296622"
        }
      ],
      "year": 2021,
      "abstract": "\nThe classical Indian Cārvāka (“Materialist”) tradition contains three branches with regard to the means of knowledge (pramāṇas). First, the standard Cārvākas accept a single means of knowledge, perception, supporting this view with a critique of the reliability and coherence of inference (anumāna). Second, the “more educated” Cārvākas as well as Purandara endorse a form of inference limited to empirical matters. Third, radical skeptical Cārvākas like Jayarāśi attempt to undermine all accounts or technical definitions of the means of knowledge (even perception) in order to enjoy a life free from philosophical and religious speculation. These branches respectively present something akin to David Hume’s problem of induction, endorse a fallibilistic, mitigated skepticism, and embody a thoroughgoing skepticism about philosophy itself. While all three branches are skeptics about religious matters, each branch exemplifies a different variety of epistemological skepticism.",
      "citationCount": 0,
      "doi": "10.1163/22105700-bja10029",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/be8865426ef8a5f329fa6f10ea74a6083da8c609",
      "venue": "International Journal for the Study of Skepticism",
      "journal": {
        "name": "International Journal for the Study of Skepticism"
      },
      "publicationTypes": null
    },
    {
      "paperId": "6b67355e9c67a77c678007646b941d1b3b95d91d",
      "title": "Knowledge and Its Significances in African Worldview: The Case of Igbos of Chinua Achebe’s Arrow of GodIhejirika, Cardinal",
      "authors": [
        {
          "name": "Ihejirika Cardinal",
          "authorId": "1686969601"
        },
        {
          "name": "ThankGod Bekweri Amadi",
          "authorId": "116557100"
        },
        {
          "name": "Tamunosiki Markson",
          "authorId": "2219261028"
        }
      ],
      "year": 2023,
      "abstract": "An individual’s wealth of knowledge among other virtues determine his choices and in the case of a leader, how well he leads. The problem of leadership is a theme which runs through Achebe’s trilogy namely, No Longer at Ease, Things Fall Apart and our present Text. In Arrow of God, Achebe decries the wane of both Igbo customs and traditions which followed the advent of colonialists and Christian missionaries into Africa. Ezeulu (who epitomizes Igbo customs and traditions) finds his traditional authority being challenged. This constituted an affront to the spirituality, social cohesion and stability of Igbo society. Even Ezeulu lost his life despite his ready receptivity of some pertinent ideological changes demanded by the times. The worrisome problem becomes: how could the reliable and stable Igbo worldview succumb to a divisive foreign epistemology? The battle of these two worldviews and cultures culminated in violence and death. Achebe condemns such violence and creates the need for a knowledge system that will engender societal development by harmonizing the positive elements of African and European worldviews. In order to bridge this epistemological gap, our study examines the notions of knowledge among the Igbos of Arrow of God, identifies their significances and proposes the idea of cultural integrativism as a panacea for cultural and ideological conflicts. The researcher adopted the analytical and hermeneutical methods of inquiry.",
      "citationCount": 0,
      "doi": "10.47772/ijriss.2023.7534",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/6b67355e9c67a77c678007646b941d1b3b95d91d",
      "venue": "International journal of research and innovation in social science",
      "journal": {
        "name": "International Journal of Research and Innovation in Social Science"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "1ec8ef25b31eb3e4668d1dc5c354a187c7d96b7a",
      "title": "Evaluation of the Subjects Related to Alevism and Bektashism of Religious Culture and Moral Knowledge in Course Books",
      "authors": [
        {
          "name": "Fatma Şentürk",
          "authorId": "2237717157"
        }
      ],
      "year": 2023,
      "abstract": "Subject of the Study; Examining the content of Alevism and Bektashism in the Religious Culture and Moral Knowledge textbooks. The scope of work; It consists of 7th grade textbooks of Planet Publishing and 12th grade textbooks of Gün Publishing, which were prepared as a result of the curriculum created in 2018 and approved by the Ministry of Education Education and Discipline Board with the decision of 78 numbers on May 28, 2018. Likewise; Alevism and Bektashism are only covered in 7th and 12th grade DKAB textbooks. Our problem in the study is to evaluate the aspect of the content related to Alevism and Bektashism in the Religious Culture and Moral Knowledge curriculum. Alevism and Bektashism, in the 5th unit of the 7th grade Religious Culture and Moral Knowledge textbook and in the 3rd units of the 12th grade Religious Culture and Moral Knowledge textbook, under the title of Sufi Interpretations in Islamic Thought, he had a detailed knowledge area called “Alevism and Bektashism”. It has been brought together with students from many frameworks and a comprehensive content has been created. It is necessary to make the books a correct information content and to give the students the real information they will encounter in the society. For this reason, it becomes necessary to examine the information in the books.Examining how the concepts and subjects related to Alevism and Bektashism are handled in the books, understanding and explaining Alevism and Bektashism correctly reveals the importance of our study. The aim of our study is to investigate and evaluate which concepts or peoples belonging to Alevism and Bektashism are included in the Religious Culture and Moral Knowledge books. The main sources of our work; Religious Culture and Moral Education Curriculum (Primary School 4th, Secondary School 5th, 6th, 7th and 8th Grades), Religious Culture and Moral Knowledge Curriculum (High School 9th, 10th, 11th and 12th Grades), 7th and 12th Grades. class Religious Culture and Moral Knowledge textbooks. Qualitative approach and literature review method were used in our study. When we come to the conclusion of the study; The state, by addressing the members of the tradition, reflected their understanding in the curriculum. However, we could not find an expression that would include the characteristics of all the common acceptances in all groups evaluated under the roof of Alevism and Bektashism. Criticisms such as distorting the information given by using the main sources of this Alevi and Bektashi tradition, Buyruk and Maqalat, have been blocked. In addition, the concepts of Alevism and Bektashism were evaluated as 'same', their differences were not included, and this situation was not an accurate definition. It would be beneficial for the content of the subject to be researched more comprehensively by experts and for the Religious Culture and Moral Knowledge branch teachers to be subjected to seminars and trainings in order to be informed about the subject.",
      "citationCount": 0,
      "doi": "10.55709/tsbsbildirilerdergisi.522",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/1ec8ef25b31eb3e4668d1dc5c354a187c7d96b7a",
      "venue": "TSBS Bildiriler Dergisi",
      "journal": {
        "name": "TSBS Bildiriler Dergisi"
      },
      "publicationTypes": [
        "JournalArticle",
        "Review"
      ]
    },
    {
      "paperId": "6ace13ab385754ba8e719abeddce3e65256fe44a",
      "title": "Epistemologi Pendidikan Agama Islam",
      "authors": [
        {
          "name": "Abdul Muqtadir. S",
          "authorId": "2357609436"
        },
        {
          "name": "Tobroni Tobroni",
          "authorId": "2340744889"
        }
      ],
      "year": 2024,
      "abstract": "This study examines the construction and methodology of knowledge in the scope of Islamic Religious Education (PAI). This study explores five main aspects: (a) Sources of knowledge in Islamic Religious Education, (b) Scientific paradigms between revelation and reason, (c) Integrative research methodology in Islamic studies, (d) Deconstruction of the boundaries of scientific disciplines in Islamic Religious Education, and (e) Episteme of contemporary Islamic knowledge: between tradition and modernity. With this approach, Islamic Religious Education can continue to develop, be understood, and practiced in the life of society, so that a harmonious and orderly order of life is created. The study of concepts in the scope of Islamic Religious Education (PAI) must continue to be developed along with the emergence of complex problems amidst the development of globalization, as a basis for contemporary studies. This study is expected to be a reference for educators and education practitioners in developing more effective and relevant Islamic Religious Education (PAI) materials.",
      "citationCount": 1,
      "doi": "10.61132/ikhlas.v2i1.303",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/6ace13ab385754ba8e719abeddce3e65256fe44a",
      "venue": "Ikhlas : Jurnal Ilmiah Pendidikan Islam",
      "journal": {
        "name": "Ikhlas : Jurnal Ilmiah Pendidikan Islam"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "a7fe5a297684b8e9e280608fd39ba7c9fce5dd52",
      "title": "Znaczenie Heinricha Rickerta teorii poznania dla interpretacji „podstawowej rzeczy filozofii” ujętej w perspektywie myśli współczesnej",
      "authors": [
        {
          "name": "D. Sobota",
          "authorId": "112980300"
        }
      ],
      "year": 2025,
      "abstract": "The article aims to validate the historical‑philosophical significance of Heinrich Rickert’s considerations of several important themes present in the history of 20th‑century philosophy. This is achieved by interpreting selected excerpts from Rickert’s argument – contained in his major work entitled Der Gegenstand der Erkenntnis (“The Object of Knowledge”) – in order to critically expose and describe the problems and tensions presented there, as well as perspectives that make it possible to bring to light the hitherto unknown interpretations of the essential philosophical questions. The latter include, in the first place, issues that make up the triunity discovered by Parmenides – speech, thought, and being (fr. B 6). I call them collectively the fundamental subject‑matter of philosophy. The development of the Parmenidean idea of unity of speech, thought, and being in Rickert’s philosophy is associated with a triple shift in research paradigms in relation to philosophical tradition, especially the pre‑critical one: firstly, the visible pronouncement of the sense and the role of non‑propositional utterances; secondly, the emphasized meaning of the epistemic action or performance (Leistung). The former leads ultimately to the undermining of the centuries‑old hegemony of judgement in logic and epistemology, whereas the latter challenges the traditional, passive‑contemplative understanding of knowledge. Thirdly, to this we must add Rickert’s clear detachment from the traditional understanding of philosophy as a definitive, or perhaps just isolated, range of objects, conceptualised as a collection of something that exists, or even must exist in the positive sense – really or unreally. It seems that all the above‑mentioned „shifts” are crucial for contemporary thought.",
      "citationCount": 0,
      "doi": "10.24425/pfns.2024.153085",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/a7fe5a297684b8e9e280608fd39ba7c9fce5dd52",
      "venue": "Przeglad Filozoficzny - Nowa Seria",
      "journal": {
        "name": "Przegląd Filozoficzny. Nowa Seria"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "00f6ee7dd902bd8fd2181e6e5af3a6bd548aecd6",
      "title": "Athens or Rome? A New Perspective on the Political Philosophy of H. Arendt",
      "authors": [
        {
          "name": "Simas Čelutka",
          "authorId": "2098447908"
        }
      ],
      "year": 2024,
      "abstract": "Hannah Arendt is widely known as a philosopher who attempted to rehabilitate the ancient Greek conception of politics. According to established readings of The Human Condition, Arendt is generally regarded as a ‘Graecophile’ whose thought is underwritten by ‘Athenian nostalgia’. Arendt’s sympathies for the Greeks are hard to deny: she did indeed turn to the Athenian understanding of politics in an attempt to crystallise in it the core elements of authentic politics. However, this interpretation is excessively one-sided. In Arendt’s view, the greatest contribution to the understanding of politics was offered by the Romans, not the Greeks. The Romans were much better at dealing with the problem of stability, continuity and order of politics. In Arendt’s view, an exclusive focus on action, spontaneity and extraordinary deeds threatens to destabilise the life of the political community. By introducing concepts such as tradition, authority, the sacredness of foundation, the law (lex), as well as the political significance of promise and forgiveness, the Romans opened up a dimension of political sedimentation which was alien to the Greeks. Political sedimentation provides safeguards, without which a sustainable political existence would become impossible.",
      "citationCount": 0,
      "doi": "10.15388/problemos.2024.105.12",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/00f6ee7dd902bd8fd2181e6e5af3a6bd548aecd6",
      "venue": "Problemos",
      "journal": {
        "name": "Problemos"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "a6404ad3a5d26b67b0e5c264cdb975e6187e9607",
      "title": "Adam Smith’s Sympathy, Justice, ‘Das Smith Problem’ Solution, and Implication to Public Choice",
      "authors": [
        {
          "name": "Jianyi Gao",
          "authorId": "2296412127"
        },
        {
          "name": "Juhyeon Jeong",
          "authorId": "2296454944"
        }
      ],
      "year": 2024,
      "abstract": "As a variant of Political Economy deriving from Adam Smith’s Wealth of Nations(WN), Public Choice students need to add Theory of Moral Sentiment to recognize true meaning of Homo Economicus, which the discipline stands on. This article focuses on four points regarding this project. First, the meaning of Sympathy by Smith was extracted from TMS. Second, logic of Smith’s Justice theory were analyzed, Third, some persuasive explanations were tried to solve so-called ‘Das Adam Smith Problem’ between TMS and WN. Fourth, relations of TMS to Public Choice was suggested, in the context of both concord and discord. Results of this article reveal some implications as follows. First, Smithian TMS logic emerged without any transcendental components like absolute reason or revelation by god, which serves to more acceptability to ordinary individuals. Second, ‘Impartial Spectator’ plays vital role to induce more objective judgements from subjective judgements of any individuals. Without it, moral sentiments are not to form mutual sympathy. Third, situations is restricted in which sympathy can lead to social stability. Therefore, force by politics, institutions, and law is more common where sympathy is hard to emerge. Public Choice is a set of knowledge to deal with those situations(‘organizational order’, by Hayek) lacking sympathy. Fourth, even so, organizational order requires to secure sympathy of the individuals being governed, at least in long-term basis, suggesting sympathy is still important, both in the world of spontaneous and organizational order.",
      "citationCount": 0,
      "doi": "10.55795/jpc.2024.3.1.073",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/a6404ad3a5d26b67b0e5c264cdb975e6187e9607",
      "venue": "Korea Public Choice Association",
      "journal": {
        "name": "Korea Public Choice Association"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "be6f0b86ee7393a938a2379ec6ddf2f38eb0b30c",
      "title": "(Un)deliberate ignorance. Discreet charm and adaptive functions of motivated ignorance",
      "authors": [
        {
          "name": "Krzysztof Mudyń",
          "authorId": "2096302818"
        }
      ],
      "year": 2023,
      "abstract": "First, the author cites several of wilful ignorance and analyzes the concept in relation to related terms such as “voluntary blindness”, “information avoidance” and “negative knowledge”. Then he presents the six groups of motives distinguished by Engel and Hartwig, which may lead to the phenomenon of deliberate ignorance. The author proposes to reduce The author proposes to reduce this taxonomy to three more general motives, i.e. emotional, pragmatic and moral category, and characterizes their specificity. Referring to psychoanalytic tradition and the role attributed by the modern experimental psychology to unconscious processes, he notes that not every type of motivated ignorance is preceded by a “deliberate”, conscious decision. Many manifestations of ignorance are spontaneous (but not accidental) products of the activity of unconscious processes. More or less “deliberate” ignorance is a frequent reason for potential patients to avoid or delay medical examination. The practical problem is how to counteract this unfavorable tendency.",
      "citationCount": 0,
      "doi": "10.4467/18982026szl.23.009.17923",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/be6f0b86ee7393a938a2379ec6ddf2f38eb0b30c",
      "venue": "Sztuka Leczenia",
      "journal": {
        "name": "Sztuka Leczenia"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    }
  ],
  "count": 40,
  "errors": []
}
