[s2_search.py] Searching Semantic Scholar: 'conservative political theory tradition reform balance' (year=2015-2025) (field=Philosophy), limit=40
[s2_search.py] Retrieved 40/40 papers...
[s2_search.py] Cached results (cache key: s2_a372084ad4569bba)
{
  "status": "success",
  "source": "semantic_scholar",
  "query": "conservative political theory tradition reform balance",
  "results": [
    {
      "paperId": "28699fcec43eeb3c117e15e8ee424e2f9ab94fe0",
      "title": "Christian Nationalism and the Project of Christian Political Theory: A Review Essay of The Case for Christian Nationalism by Stephen Wolfe",
      "authors": [
        {
          "name": "Michael J. Demoor",
          "authorId": "115778845"
        }
      ],
      "year": 2023,
      "abstract": "\nThis review essay examines Stephen Wolfe’s The Case for Christian Nationalism, focusing on his presentation of his book as a work of Christian political theory. His claims regarding national will and agency are analyzed, and problems with them are traced to his political theology and his methodological assumptions about Christian political theory. In place of those assumptions, Kuyper’s idea of architectonic critique is recommended as a more fruitful approach to Christian political theory in the Reformed tradition.",
      "citationCount": 1,
      "doi": "10.1163/23528230-bja10076",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/28699fcec43eeb3c117e15e8ee424e2f9ab94fe0",
      "venue": "Philosophia Reformata",
      "journal": {
        "name": "Philosophia Reformata"
      },
      "publicationTypes": [
        "JournalArticle",
        "Review"
      ]
    },
    {
      "paperId": "fc33de1b748b8079c520249581429f9f4fa5b845",
      "title": "Tradition and Reform: Aristotle’s Response to Modern Alternatives",
      "authors": [
        {
          "name": "Rachel K. Alexander",
          "authorId": "144042091"
        }
      ],
      "year": 2020,
      "abstract": "Abstract This essay is an attempt to articulate an Aristotelian alternative to two prominent contemporary ways of understanding human freedom and dependence on the past, and to the implications these understandings have for political life. While a liberal tendency, following Machiavelli’s emphasis on new modes and orders, understands political life to begin with breaking from the past, the more conservative camp in modern thought, following Burke in his emphasis on tradition, understands political life to begin with laws and customs inherited from the past. Aristotle’s teaching in his Nicomachean Ethics on the freedom and responsibility that make human beginnings possible points us, I propose, to a better understanding of political founding than either modern alternative. In the Politics, he connects the city to natural beginnings in the family but also calls the first who founded a city one “responsible for the greatest of goods” (Pol. 1253a31-32). And in the Ethics, he offers his own founding of a way of inquiring about politics, which engages with his predecessors, as a model for politics itself. In this way, Aristotle offers us a deeper understanding of political founding and change, even presenting his own philosophic inquiry in the Ethics as its ground and model.",
      "citationCount": 0,
      "doi": "10.1080/10457097.2019.1710994",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/fc33de1b748b8079c520249581429f9f4fa5b845",
      "venue": "Perspectives on Political Science",
      "journal": {
        "name": "Perspectives on Political Science",
        "pages": "104 - 116",
        "volume": "49"
      },
      "publicationTypes": null
    },
    {
      "paperId": "889a79bb9ccdd2031c29c4b8101207d8d6ec136a",
      "title": "TRANSDISCIPLINARITY THEORY THROUGH PLATO PHILOSOPHY, TAOISM, ALCHEMICAL TRADITION AND JUNGIAN PSYCHOLOGY",
      "authors": [
        {
          "name": "Leonardo Da Silva Guimarães Martins da Costa",
          "authorId": "2148723484"
        }
      ],
      "year": 2022,
      "abstract": "Transdisciplinary is a paradigm based on the integration and balance of opposite points of view (dualities). This paper methodology involves transdisciplinarity applied to problem solutions, mainly from 1) Plato philosophy; 2) Taoist principle of duality Yin Yang, 3) Jungian psychology, so connected to modern physics and 4) Weil, Leloup and Crema psychological vision of holistic transdisciplinarity. Our findings in this regard involves Figure 11 for Jungian functions and Figure 12 model for problem solving through duality plus four elements. The objective is to create a comprehensive understanding of reality through Plato and Taoist philosophies, Alchemical tradition and Jungian psychology improved by the MBTI system, as tools for problem solving. Understanding the psychological types types to comprehend on how to achieve the best of each one, due to their innate strengths and capacities, so that a synergy of results can be created within the relationships. The MBTI serves both i) for self-knowledge, to make his own self-management on a day-to-day life, and ii) to understand how other people work psychologically, so that a synergy can be created in the process of relationships. The applied transdisciplinary approach is based on the principles of i) duality – interaction and integration of opposites, specially the analytical and synthetic methods and ii) four elements - rationality, feasibility, reasonableness and meaning. However, it is not a simplistic or a magical-vitalistic approach as it may seem to rationalists at first, as far as modern physics is concerned. The holistic view of reality, including holology (the study of the whole) and holopraxis (the praxis of the whole) can´t be confused with political ideology, something that happens very frequently to scientificists, who consider themselves \"exempt\" and “impartial”. Finally, the core idea is to promote transformation of the culture and personal behavior, connected to reasonableness and meaning, emotional and intuitive intelligences, mainly because of psychological sustainability and mental health. \n ",
      "citationCount": 5,
      "doi": "10.22545/2022/00162",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/889a79bb9ccdd2031c29c4b8101207d8d6ec136a",
      "venue": "Transdisciplinary Journal of Engineering & Science",
      "journal": {
        "name": "Transdisciplinary Journal of Engineering & Science"
      },
      "publicationTypes": null
    },
    {
      "paperId": "b3fb213e5ecaf3e1cbbb66458f37555f328002d5",
      "title": "Buddhist Modernism Underway in Bhutan: Gross National Happiness and Buddhist Political Theory",
      "authors": [
        {
          "name": "Jessica Locke",
          "authorId": "134182884"
        }
      ],
      "year": 2020,
      "abstract": "This article synthesizes and clarifies the significance of the last half-century’s developments in Bhutan’s politics within the frame of Buddhist political thought. During this time, Bhutan has held a curious position in the international community, both celebrated as a Buddhist Shangri-La defending its culture in the face of globalized modernity, and at times, criticized for defending its heritage too conservatively at the expense of ethnic minorities’ human rights. In other words, Bhutan is praised for being anti-modern and illiberal and denounced for being anti-modern and illiberal. As an alternative to understanding Bhutan vis-à-vis this unhelpful schema, and in order to better grasp what exactly is underway in Bhutan’s political developments, I read Bhutan’s politics from within the tradition of Buddhist political literature. I argue that the theory of governance driving Bhutan’s politics is an example of Buddhist modernism—both ancient and modern, deeply Buddhist and yet manifestly inflected by western liberalism. To elucidate Bhutan’s contiguity with (and occasional departures from) the tradition of Buddhist political thought, I read two politically-themed Buddhist texts, Nāgārjuna’s Precious Garland and Mipham’s Treatise on Ethics for Kings, drawing out their most relevant points on Buddhist governance. I then use these themes as a lens for analyzing three significant political developments in Bhutan: its recent transition to constitutional monarchy, its signature policy of Gross National Happiness, and its fraught ethnic politics. Reading Bhutan’s politics in this manner reveals the extent to which Buddhist political thought is underway in this moment. Bhutan’s Buddhist-modernist theory of governance is a hybrid political tradition that evinces a lasting commitment to the core values of Buddhist political thought while at the same time being responsive to modern geopolitical and intellectual influences.",
      "citationCount": 5,
      "doi": "10.3390/rel11060297",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/b3fb213e5ecaf3e1cbbb66458f37555f328002d5",
      "venue": "Religions",
      "journal": {
        "name": "Religions"
      },
      "publicationTypes": null
    },
    {
      "paperId": "0b5534a0341056ea8a221009eca76da8dbd0a8da",
      "title": "A Conservative Theory of Political Obligation",
      "authors": [
        {
          "name": "A. Rico",
          "authorId": "123438738"
        }
      ],
      "year": 2019,
      "abstract": null,
      "citationCount": 0,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/0b5534a0341056ea8a221009eca76da8dbd0a8da",
      "venue": "",
      "journal": {
        "name": "",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "d587a3f6e638751e82bc891832288c14e2f589ae",
      "title": "J. G. Fichte as a Post-Kantian Philosopher and His Political Theory: A Return to Romanticism",
      "authors": [
        {
          "name": "Ö. Erden",
          "authorId": "134558708"
        }
      ],
      "year": 2018,
      "abstract": "This paper fundamentally deals with J. G. Fichte’s philosophical views, which reshapes intellectual-philosophical bases of the post-Enlightenment era and makes a strong criticism of Kantian thinking. Philosophically, Fichte’s philosophy, more representing a return to romanticism, will be debated on the basis of some concepts, among of which has been reason, science, tradition, religion, state, individual, and community. From his viewpoint, it will interrogate relationships among ego, morality and moral order. Based on these relationships, it will be tried to explain what man’s moral nature is and how moral consciousness is conceptualized in Fichte’ thought. The debates between these concepts will provides basis for a political theory framed by Fichte. Also, it will indicate how a political theory there was developed, outlined by Fichte for German nation over two basic concepts, moral nature and moral consciousness. Taking account of all these discussions, in conclusion it will argue that his political theory had more liberal-conservative implications, along with nationalist ones.",
      "citationCount": 0,
      "doi": "10.22492/ijerp.4.1.02",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/d587a3f6e638751e82bc891832288c14e2f589ae",
      "venue": "IAFOR Journal of Ethics, Religion & Philosophy",
      "journal": {
        "name": "IAFOR Journal of Ethics, Religion & Philosophy"
      },
      "publicationTypes": null
    },
    {
      "paperId": "842d251ee07f91a93bf6806ba79db7fa9c74b895",
      "title": "Socio-political stability and order: Correlation of concepts and phenomena",
      "authors": [
        {
          "name": "A. N. Sulimin",
          "authorId": "2293968835"
        }
      ],
      "year": 2024,
      "abstract": "Introduction. The article examines and analyzes such social phenomena as socio-political stability and socio-political order from the point of view of ideological, legal and value parameters. Theoretical analysis. For a long time, socio-political stability has been considered as an adequate characteristic of the political structure of the state. Scientists drew attention to the change of liberal and conservative cycles and forms of government, which saw a balance between order and freedom of society and a man. In this context, Russian philosophical thought linked the socio-political order with spiritual and moral principles as regulators of the state, society and a man, and also paid attention to freedom and legal institutions. The institutionalization of the socio-political order is carried out through the mechanisms of political power and its legitimization, ideology, and law based on the value preferences of society. The system-synergetic paradigm defines these mechanisms as order parameters underlying the self-organization of any social system. Conclusion. Socio-political stability is a qualitative characteristic of the socio-political order, which is determined by the historical, geopolitical conditions of society, with its spiritual factors and traditions. The socio-political order is not universal, it is invariant, determining the variability of human development.",
      "citationCount": 0,
      "doi": "10.18500/1819-7671-2024-24-3-295-299",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/842d251ee07f91a93bf6806ba79db7fa9c74b895",
      "venue": "Izvestiya of Saratov University. Philosophy. Psychology. Pedagogy",
      "journal": {
        "name": "Izvestiya of Saratov University. Philosophy. Psychology. Pedagogy"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "92efd21edc147c4c1ea0e9d2254756118f03a40a",
      "title": "Book Review: Political Theory: American Democracy: From Tocqueville to Town Halls to Twitter",
      "authors": [
        {
          "name": "S. Michels",
          "authorId": "70030753"
        }
      ],
      "year": 2015,
      "abstract": null,
      "citationCount": 0,
      "doi": "10.1111/1478-9302.12100_24",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/92efd21edc147c4c1ea0e9d2254756118f03a40a",
      "venue": "",
      "journal": {
        "name": "Political Studies Review",
        "pages": "407 - 407",
        "volume": "13"
      },
      "publicationTypes": [
        "Review"
      ]
    },
    {
      "paperId": "9f16e1e7716632c1fe0e6eb3da75b27c27df6111",
      "title": "The Common Good Tradition from Madison to Rawls",
      "authors": [
        {
          "name": "James T. Kloppenberg",
          "authorId": "115945830"
        }
      ],
      "year": 2022,
      "abstract": "Abstract:Americans interested in community today often lament precisely what conservative Americans prize: the perceived emphasis on individual rights and absence of explicit endorsements of civic duty, collective authority, and social equality in our eighteenth-century founding documents. Many who are familiar with the influence John Rawls had on contemporary political theory likewise fault him for prioritizing liberty over equality, a preference widely criticized by communitarians insisting that the common good is the proper end and measure of government. This article challenges those understandings of our nation’s founding, and of Rawls’s work, in order to show that concerns with the common good run as deeply through American history as do celebrations of individual rights.",
      "citationCount": 1,
      "doi": "10.5325/goodsociety.31.1-2.0001",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/9f16e1e7716632c1fe0e6eb3da75b27c27df6111",
      "venue": "Good Society Journal, The",
      "journal": {
        "name": "The Good Society",
        "pages": "1 - 22",
        "volume": "31"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "fb23c635429936ac3ec263e9a44afefcc173abda",
      "title": "John Rawls and \"Our Tradition\" of Democracy",
      "authors": [
        {
          "name": "James T. Kloppenberg",
          "authorId": "115945830"
        }
      ],
      "year": 2022,
      "abstract": "Abstract:The notion of a clear distinction between Rawls's liberalism and social democracy rests on a caricatured conception of the liberal tradition and Rawls's place in it. From Rousseau, John Adams, and Madison through Tocqueville to Dewey, notable political theorists have sought to balance the two principles at the core of Rawls's A Theory of Justice. In this essay I sketch the ways in which American thinkers and activists escaped the cages in which commentators have tried to confine them, not only the false binary between liberalism and democratic socialism but also that between secularism and religious belief. As Rawls himself tried to make clear in his later writing, his ideal of justice drew from earlier theorists who understood the constitutive role of social interaction and inherited traditions, and he envisioned a society with room for people animated by comprehensive philosophical and religious ideas not shared by everyone else. Rawls's political liberalism, historicist as well as pluralist, was attuned as much to the threat inequality poses to freedom as to the endangered status of freedom in mass society. Rawls's ideas, especially as articulated in his book Justice as Fairness, remain a vital resource for social democrats who prize social and economic equality as well as individual liberty.",
      "citationCount": 2,
      "doi": "10.3138/ttr.43.1.21",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/fb23c635429936ac3ec263e9a44afefcc173abda",
      "venue": "The Tocqueville Review",
      "journal": {
        "name": "The Tocqueville Review/La revue Tocqueville",
        "pages": "21 - 50",
        "volume": "43"
      },
      "publicationTypes": null
    },
    {
      "paperId": "c45832e6987439bd2dda20182e0945194649be97",
      "title": "Reinterpreting Justice in Al-Farabi’s Political Philosophy: Relevance to Contemporary Islamic Human Rights Thought",
      "authors": [
        {
          "name": "Syukri",
          "authorId": "2369358815"
        },
        {
          "name": "Adenan",
          "authorId": "2369496748"
        },
        {
          "name": "Syahminan",
          "authorId": "2369489638"
        }
      ],
      "year": 2025,
      "abstract": "This study critically explores Al-Farabi’s conception of justice in his political philosophy and evaluates its normative potential and conceptual limitations in the context of contemporary human rights discourse. The central research question investigates the extent to which Al-Farabi’s vision of the al-Madina al-Fadila (Virtuous City) can serve as a philosophical framework for bridging classical Islamic values with modern human rights principles. Rather than assuming full compatibility, the study interrogates the tension between Al-Farabi’s virtue-based, hierarchical model of justice and contemporary demands for equality, intersectional rights, and democratic participation. Employing a qualitative, library-based method and a philosophical hermeneutic approach, the research analyzes key texts—particularly Ara’ Ahl al-Madina al-Fadila and Tahsil al-Sa‘ada—alongside contemporary literature on Islamic legal reform and human rights theory. The findings demonstrate that Al-Farabi’s emphasis on rational leadership, ethical governance, and communal well-being—while historically bounded—offers interpretive value for rethinking legal reform through maqasid al-shari‘ah and contextual ijtihad. However, the study also underscores the epistemological challenges of adapting metaphysical frameworks to rights-based paradigms. It concludes that Al-Farabi’s thought should inspire—not dictate—Islamic legal innovation by contributing ethical and rational principles that remain critically grounded within both Islamic tradition and contemporary socio-legal realities. Academically, this research contributes to the growing body of interdisciplinary scholarship at the intersection of Islamic philosophy, political theory, and human rights, offering a nuanced reappraisal of classical Islamic thought as a dynamic resource for ethical-legal reform in pluralistic modern societies.",
      "citationCount": 0,
      "doi": "10.32332/milrev.v4i1.10466",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/c45832e6987439bd2dda20182e0945194649be97",
      "venue": "MILRev: Metro Islamic Law Review",
      "journal": {
        "name": "MILRev: Metro Islamic Law Review"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "d613cff167d85646c9a3c49401b5b3b61e3dbf5e",
      "title": "Edmund Burke’s Ideas on Social Reform: An Alternative Means of Resolving the Issues Challenging Nigeria Especially Restructuring of Political and Constitutional Framework of the Country",
      "authors": [
        {
          "name": "Grace Umezurike",
          "authorId": "115848407"
        }
      ],
      "year": 2019,
      "abstract": null,
      "citationCount": 0,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/d613cff167d85646c9a3c49401b5b3b61e3dbf5e",
      "venue": "",
      "journal": null,
      "publicationTypes": null
    },
    {
      "paperId": "95f16ecfba383d937543066d2db0f58dc7a139d7",
      "title": "Liberal Islamic Theology in Conservative Russia: Taufik Ibragim’s “Qurʾānic Humanism”",
      "authors": [
        {
          "name": "M. Kemper",
          "authorId": "30134666"
        },
        {
          "name": "G. Sibgatullina",
          "authorId": "5483481"
        }
      ],
      "year": 2021,
      "abstract": "\nThis article studies the work of the Moscow-based Syrian academic scholar Taufik Ibragim. Originally a Marxist historian of Islamic philosophy and kalām, after the end of the ussr Ibragim became one of Russia’s most authoritative scholars also of the Qurʾān and the Islamic tradition more broadly. Since the mid-2000s, Ibragim has publicly propagated the concept of “Qurʾānic humanism”, which is meant to demonstrate the tolerance of the Qurʾān and the humanist character of Islam in general, against Islamic extremism and stagnation in Muslim thought. In his opposition to the dominant political “traditionalism” in Russia’s Islamic landscape, Ibragim links back to the heritage of the Tatar Muslim educational and religious reformers (Jadids) of the late nineteenth and early twentieth centuries. Without reference to any other contemporary Islamic thinker, Ibragim advocates a reform of Islam to adapt it to the conditions of modern Russia. His interpretations appeal to Russia’s academic elite, as well as to the Jadid-oriented muftiate of the Russian Federation (dumrf) in Moscow, which until recently propagated Ibragim’s concepts against the vague “traditionalism” that other muftiates in the Russian Federation claim to follow. But his insistence on a rational approach to the Qurʾān and his challenging of the authority of ḥadīth have brought Ibragim the enmity of many conservative muftis and Muslim theologians in Russia, and Islamic reformism is under increasing attack.",
      "citationCount": 7,
      "doi": "10.1163/15700607-61020002",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/95f16ecfba383d937543066d2db0f58dc7a139d7",
      "venue": "Die Welt des Islams",
      "journal": {
        "name": "Die Welt des Islams"
      },
      "publicationTypes": null
    },
    {
      "paperId": "403b8624f4a21c70ef649d4bc11c4d5a0ffcbd44",
      "title": "Between Revolution and Reaction: The Political Significance of Kant’s Doctrine of the Idea",
      "authors": [
        {
          "name": "Michael Kryluk",
          "authorId": "118849148"
        }
      ],
      "year": 2024,
      "abstract": "Abstract This essay argues that Kant’s conception of regulative ideas of practical reason introduced in the Critique of Pure Reason serves an important twofold function in his political philosophy. First, Kant’s version of the ideal, Platonic republic acts as the a priori paradigm of a rightful state to which existing regimes can and should conform. Second, Kant frames the regulative status of such practical ideas as a resolution of the conflict between the extremes of dogmatism and skepticism. In his principal political writings from the 1790s—i. e., “Theory and Practice,” “Perpetual Peace,” and the Doctrine of Right—Kant draws on his account of practical ideas in the Critique to articulate a counterfactual norm of popular sovereignty that distinguishes his political standpoint from opponents on the left and the right. Radicals repeat the error of the dogmatists by affirming that the norm of collective self-legislation is completely attainable in experience. By contrast, conservatives make the mistake of the skeptics by denying that rational political standards can be applied to reality at all. I show that Kant reconciles these extremes through his model of gradual, non-violent political reform guided by the regulative ideal of a perfectly self-legislating state.",
      "citationCount": 5,
      "doi": "10.1515/agph-2023-0093",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/403b8624f4a21c70ef649d4bc11c4d5a0ffcbd44",
      "venue": "Archiv für Geschichte der Philosophie",
      "journal": {
        "name": "Archiv für Geschichte der Philosophie",
        "pages": "293 - 330",
        "volume": "107"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "0d1fcdeb3eddfd7ae960e32f230a23896af4a552",
      "title": "Foucault in China (1989–2019)",
      "authors": [
        {
          "name": "Xu Zhang",
          "authorId": "2382346690"
        },
        {
          "name": "Yue Zhuo",
          "authorId": "2388060467"
        }
      ],
      "year": 2025,
      "abstract": "Abstract:The history of the reception of Foucault in China (1989-2019) is part of the process of China's reconstructing of its academic tradition after the reform and opening-up, when the control of Marxist ideology was loosened and when Western modern thought flowed into the Chinese academic community in large quantities. The Foucauldian reception can be best understood not so much in relation to previous domestic Marxist or conservative discourses, but in its competition with the thought of other Western thinkers who were introduced around the same time, such as Marin Heidegger, Max Weber, and Leo Strauss. This article studies on the one hand the broad influence of Heidegger in Philosophy, Weber in social theory and Strauss in political philosophy since the 1980s, and on the other hand how Foucault's reception has to be situated and viewed in relation to the reception of these other thinkers, negotiating its position and image in a competition that involves not only several disciplines of social sciences but also changing political positions such as the New Left, liberalism and culture conservatism in the history of China in the past forty years.",
      "citationCount": 0,
      "doi": "10.1353/frf.2023.a969767",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/0d1fcdeb3eddfd7ae960e32f230a23896af4a552",
      "venue": "French Forum",
      "journal": {
        "name": "French Forum",
        "pages": "431 - 447",
        "volume": "48"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "056a3a40cb89a6c8a826fbffb7c2b6059bcd5131",
      "title": "A Supplement to Bahâeddinzâde’s Political Thought: Critical Edition and Analysis of the Nasihatnâme",
      "authors": [
        {
          "name": "Enes Taş",
          "authorId": "2400020638"
        }
      ],
      "year": 2025,
      "abstract": "This article examines the political thought of Muhyiddin Mehmed b. Bahāeddin (known as Bahāeddinzāde), a sixteenth-century Ottoman scholar, through the lens of his major works: Siyasetnāme, Asl al-tashrīʿ, Risāla mutaʿalliqa bi-amr al-jihād, and Nasihatnāme. Bahāeddinzāde’s political philosophy is grounded in a metaphysical sufi framework. He conceives of the state not merely as an institution that responds to social needs. Rather, he understands it as the terrestrial manifestation of the cosmic order and an extension of humanity’s divinely ordained role of khilāfa (vicegerency). In this respect, he occupies a unique position at the intersection of Islamic philosophy and sufi thought. His political theory reflects an original synthesis that integrates sufi (Akbarī), classical (siyasetnāme–nasihatnāme) and philosophical (Fārābī, Ibn Khaldūn) traditions. Bahāeddzāde’s Nasihatnāme represents an early example of the transformation that took place in the nasihatnāme literature during the sixteenth and seventeenth centuries. While nasihatnāme texts of the sixteenth century primarily focused on individual morality and sufi training, those of the seventeenth century began to center on discourses of corruption in state order and problems of governance. Bahāeddinzāde’s work, however, combines both tendencies by offering moral advice on individual conduct alongside warnings concerning justice, politics, and social order. In this respect, the work functions as a bridge between the classical moral-religious nasihatnāme tradition and the increasingly state and order-oriented advisory literature. The political theory underlying Bahāeddinzāde’s entire corpus stands out for its system of mutual responsibility and balance. This system is structured particularly around the quartet of the sultan, the sharīʿa, the ʿulamāʾ, and the vizier. Bahāeddinzāde adopts a sharīʿa-centered approach in his works and sharply criticizes instances in which political authority violates the sharīʿa through ʿurf-based (customary) practices. By highlighting the tension between sharīʿa and ʿurf, he offers a critical reading of political transformations in the Ottoman Empire. He grounds political legitimacy in sharīʿa principles and identifies several key areas of concern: the weakening of the independence of the ʿulamāʾ, the precedence of ʿurf-based norms over the sharīʿa, and the erosion of the principle of competence and merit (ahlīyya and liyāqa). This article approaches Bahāeddinzāde’s understanding of politics within a multilayered framework that incorporates fiqh, kalām, and Sufism. It shows that he not only developed a theoretical vision of political order but also offered practical solutions to the challenges of his time. His articulation of a connection between Akbarian metaphysics and political order places him in an original position within classical Ottoman thought. In this context, Bahāeddinzāde emerges not merely as a critical voice, but rather as a constructive thinker aiming to establish a sharīʿa-based political order.",
      "citationCount": 0,
      "doi": "10.52637/kiid.1731497",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/056a3a40cb89a6c8a826fbffb7c2b6059bcd5131",
      "venue": "Kocatepe İslami İlimler Dergisi",
      "journal": {
        "name": "Kocatepe İslami İlimler Dergisi"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "f383b76e01236523cdd468fa1714c646a4c82adb",
      "title": "THE PLACE OF YU. F. SAMARIN'S VIEWS IN THE HISTORY OF POLITICAL AND LEGAL THOUGHT",
      "authors": [
        {
          "name": "E. S. Besedina",
          "authorId": "2400956803"
        }
      ],
      "year": 2025,
      "abstract": "The article is dedicated to Yuri Fedorovich Samarin, an outstanding, but largely forgotten figure ofRussian political and legal thought of the 19th century Yu.F. Samarin. The article analyzes his political and legalviews, with special attention paid to his understanding of freedom, attitude to Western civilization and therole of the peasantry in the development of Russia. The criteria allowing us to classify Samarin as a Slavophileare highlighted. The author emphasizes that, despite his Slavophile beliefs, Samarin shared some ideas withthe Westerners, and his concept of freedom was distinguished by its originality. The article questions the Soviet tradition of classifying Samarin as a liberal reformer. As part of the study, a detailed analysis of existingauthorial positions regarding the place of the doctrine of Yu.F. Samarin in the political and legal spectrumin both domestic and foreign literature is conducted. The article reveals Samarin's attitude to reforms, hissupport for communal self-government and zemstvo, as well as his rejection of constitutional restrictions onthe monarchy. Particular attention is paid to Samarin's criticism of communism and his approach to politicaland legal problems in a social context. Various definitions of Samarin's political position are analyzed, such as“revolutionary conservative”, “free conservatism” and “theorist of social equilibrium”. In conclusion, the articleemphasizes the originality of Samarin's ideas, his desire for a systematic improvement of the state throughthoughtful reforms based on the original Russian traditions.",
      "citationCount": 0,
      "doi": "10.14258/ralj(2025)4.1",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/f383b76e01236523cdd468fa1714c646a4c82adb",
      "venue": "Russian Legal Journal",
      "journal": {
        "name": "Russian-Asian Legal Journal"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "132828633a8a4e095cb9c10cd283f7ab6da0800a",
      "title": "The Anti-Enlightenment Tradition as a Common Framework of Fascism and the Contemporary Far Right",
      "authors": [
        {
          "name": "T. Ziegler",
          "authorId": "95013224"
        }
      ],
      "year": 2021,
      "abstract": "\nThe relationship between far-right political streams and fascism is a recurring topic in scientific literature. However, we find a low number of academic publications which try to create a framework for their similarities. This article uses Zeev Sternhell’s theory of fascism as a tool to measure different interpretations of fascism and the far right. According to its basic statement, there exists an anti-Enlightenment tradition in the Western world, which could serve as a substratum of these streams. This proves two points. Firstly, that there are several political groups which share a very similar political vision, even if their levels of aggression and radicalism are different. This is the reason why many neo-fascist, post-fascist, ‘populist’ and conservative parties have interchangeable rhetorical clichés and ideological patterns. Second, it shows that Western countries could successfully fight the rise of upcoming anti-democratic forces through strengthening the values of the Enlightenment-tradition.",
      "citationCount": 4,
      "doi": "10.1163/22116257-10010001",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/132828633a8a4e095cb9c10cd283f7ab6da0800a",
      "venue": "Fascism",
      "journal": {
        "name": "Fascism"
      },
      "publicationTypes": null
    },
    {
      "paperId": "0cd90b4647ac46ef814214192d114619004af276",
      "title": "Heaven on Earth: Theory and Practice. Review of The Christian Left",
      "authors": [
        {
          "name": "D. S. Gorshenyov",
          "authorId": "2308956892"
        }
      ],
      "year": 2024,
      "abstract": "It is a well-know fact that the political legacy of Christianity is diverse and contradictory. But if we put forward the thesis that the legacy is also cyclical, we will open a large room for discussion both from the historical and political-theoretical perspective. Indeed, the first followers of Christianity were among the oppressed financially and socially, howewher with the advent of the institution of the church their status changed. Gradually the Christian church transformed into political force. We can evaluate it as a conservative right-wing political force. Over the past 150 years, as Anthony A. J. Williams, a British researcher of political theory at Manchester Metropolitan University, suggests and proves in his book The Christian Left, this thesis is far from the truth, and the provisions of the Bible can be the basis of economic collectivism and social liberation in the socialists’ understanding. Starting his research with the theological foundations of Christianity, which could be adopted not only by the right but also by the left, the author immerses the reader in the hitherto unexplored world of Christian socialism with all its contradictions and distrust on the part of the church. In his research, Williams tries to trace the genesis of this phenomenon in space and time, capturing the events of the 15th-16th centuries, when peasant uprisings on the one hand and religious reformers on the other opposed the established socio-economic order, proclaiming the earth a common treasury, advocating for universal brotherhood instead of competition,  and fair distribution of income instead of thoughtless accumulation. Speaking broadly about the book we should admit that the author managed to collect, systematize and analyze both the intellectual and historical heritage of the Christian left movements. A. Williams managed to bring together both the prehistory, the philosophical, and the religious basis of left-wing Christianity. At the same time, the author does not reconsider the Christian dogmas, taking ready-made interpretations of socialist theologians without proper commentary and analysis. Furthermore the author does not develop the theory of left-wing Orthodox tradition. Nevertheless the book The Christian Left may be of interest to researchers of political theory, philosophers, theologians, sociologists and historians, as well as to anyone who doubts whether socialism is a successful attempt to build a paradise on earth.",
      "citationCount": 0,
      "doi": "10.24833/2541-8831-2024-2-30-165-168",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/0cd90b4647ac46ef814214192d114619004af276",
      "venue": "Concept: philosophy, religion, culture",
      "journal": {
        "name": "Concept: philosophy, religion, culture"
      },
      "publicationTypes": [
        "JournalArticle",
        "Review"
      ]
    },
    {
      "paperId": "7a4da30ab9d58540d4b5de6e491997750060fffa",
      "title": "Kant and the New Enlightenment: On the Balance between Duty and Utilitarian Ends",
      "authors": [
        {
          "name": "Andrey S. Zilber",
          "authorId": "2079799410"
        }
      ],
      "year": 2023,
      "abstract": "The relation between Kant’s philosophy and the “philosophy of balance” as it is described in the report Come on! Capitalism, Short-termism, Population and the Destruction of the Planet, delivered to the Club of Rome in 2018, requires some analysis. The authors of the report consider Kant to be a philosopher of European Enlightenment which laid the foundations of the modern world, but also proved to be the source of global problems. The report characterises the philosophy of the Enlightenment as lop-sided rationalism which dismisses everything that does not possess desirable properties. In exchange, the authors offer a philosophy of balance, described in several points as the balance between conflicting values. The overarching problem of the philosophy of balance is the restraining of egoism. For this reason I first examine the relationship between duty and human inclinations in Kant’s ethics. I then demonstrate that the topic of political forecasts and the recommendations which Kant prescribes both in his philosophy of history and in his reflections on politics, right and justice, essentially boils down to three points of the philosophy of balance: the balance between development and justice (Kantian republicanism), between the speed and stability of development (external policy, the Kantian peace project), and between the short-term and long-term perspectives (reform policy). I then touch upon the problem of the implementation of Kantian principles in politics in the light of the reception of Kant in the modern theories of social conflicts, the communication theory of J. Habermas and the justice theory of J. Rawls. The overall conclusion is that Kant’s philosophy is not a philosophy of exclusion, capitalist values and utilitarianism and is not their ideological basis.",
      "citationCount": 1,
      "doi": "10.5922/0207-6918-2023-2-3",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/7a4da30ab9d58540d4b5de6e491997750060fffa",
      "venue": "Kantian journal",
      "journal": {
        "name": "Kantian journal"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "9c6d712b76e0be12531ef8aacb4423df985dafe6",
      "title": "Belloc’s Anti-State Postliberal Distributism",
      "authors": [
        {
          "name": "Alex M. Plato",
          "authorId": "133648404"
        }
      ],
      "year": 2025,
      "abstract": "I examine various striking ideas in Belloc’s writings which indicate separately and jointly confirm that his distributism is a radical and far-reaching social philosophy which undergirds all-encompassing reform of the social order: religious, cultural, political, and economic. In short, Belloc seems to be an anti-state postliberal distributist. Belloc explains that the deeper reform of religion and culture are integral to achieving the oft-repeated economic goals familiar to those defending or criticizing distributism. If I’m right, then distributists can follow Belloc’s lead in opposing the embodied tradition of liberalism in both theory and practice (i.e., in being postliberals) and embark upon the distributist reform program which is designed to translate (however quickly or slowly and according to justice and prudence) the liberal order out of existence, including both the Modern State and the Market System, and into a Christian social order, a new polity.",
      "citationCount": 0,
      "doi": "10.5840/acpq2025992311",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/9c6d712b76e0be12531ef8aacb4423df985dafe6",
      "venue": "American Catholic Philosophical Quarterly",
      "journal": {
        "name": "American Catholic Philosophical Quarterly"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "ac55b10837222cec30ad0bdafe1b657020c9a211",
      "title": "Strategic justice, conventions, and game theory: introduction to a Synthese topical collection",
      "authors": [
        {
          "name": "Michael Moehler",
          "authorId": "2310360507"
        },
        {
          "name": "John Thrasher",
          "authorId": "2310363496"
        }
      ],
      "year": 2024,
      "abstract": "Evolutionary, game-theoretic approaches to justice and the social contract have become increasingly popular in contemporary moral and political philosophy. (Vanderschraaf, Strategic justice: convention and problems of balancing divergent interests, Oxford University Press, 2019) theory of strategic justice represents the most recent contribution to this tradition and, in many ways, can be viewed as a culmination of it. This article discusses some of the central features of Vanderschraaf’s theory and relates them to the contributions in this collection. Some of the contributions directly address Vanderschraaf’s work, while others explore related topics in game theory, bargaining theory, formal philosophy, rationality, equality, justice, and the theory of conventions. This collection aims to bridge a gap between disjoint but closely related literature spanning a wide range of disciplines. The contributions allow readers to systematically engage with the topic of strategic justice, advance dialogue, and more easily follow this rich and expanding field of study.",
      "citationCount": 0,
      "doi": "10.1007/s11229-024-04680-2",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/ac55b10837222cec30ad0bdafe1b657020c9a211",
      "venue": "Synthese",
      "journal": {
        "name": "Synthese",
        "volume": "204"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "58d9c5d24f614b8f13fb443c8e41f59b6d3bd60f",
      "title": "Normative anti-normativity: when Dugin reads queer theory",
      "authors": [
        {
          "name": "Trevor Wilson",
          "authorId": "2341837768"
        }
      ],
      "year": 2025,
      "abstract": "\n In line with a recent rise in anti-LGBTQ discourse within conservative Russian politics, Aleksandr Dugin has increasingly critiqued “postmodern” theories that allegedly underpin social diversity (sexual, gender, racial, etc.) within the West: queer theory, post-structuralism, and other theoretical accounts of identity and alterity. In Dugin’s argument for a political philosophy of Eurasianism, the Western endorsement of multiculturalism and pluralism is indicative of individualism and “Atlanticist” liberalism, therefore at odds with the traditional, nationalist collectivism of Eurasia. In this light, queer theory is a Western imposition whose philosophical premises directly contradict native, Russian traditions. Dugin’s attack on queer theory, however, mark a departure from the philosopher’s earlier career within the National Bolshevik movement. Throughout the nineties, Dugin was relatively sympathetic with the nascent LGBT movement in Russia: specifically within the political and philosophical circles of National Bolshevism, in which such figures as Eduard Limonov and Slava Mogutin coalesced with fascists and communists around a broad critique of Western capitalism and openly embraced homoeroticism and countercultural, queer dissidence. Dugin’s links to the LGBT movement are even relatively mainstream: his first wife, Evgeniia Debrianskaia, was a prominent gay activist, and both Debrianskaia and Dugin for a time viewed the Eurasianism’s goals as aligned with that of LGBT activism in Russia. This article examines the development of Dugin’s political philosophy in the context of his reading of queer theory. It first discusses the link in historical terms, in the connections between Dugin’s early post-Soviet career and post-Soviet Russian gay activism. The article then focuses on Dugin’s philosophy of “multipolarity,” as a form of resistance to universalist, American hegemony, in order to illustrate how Dugin’s Eurasianist account of political “anti-normativity” both aligns and contradicts with his reading of queer theory. The article concludes with comments on the globalization of queer theory, cultural imperialism, and its relationship to Dugin’s geopolitics.",
      "citationCount": 0,
      "doi": "10.1007/s11212-024-09695-6",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/58d9c5d24f614b8f13fb443c8e41f59b6d3bd60f",
      "venue": "Studies in East European thought",
      "journal": {
        "name": "Studies in East European Thought"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "72c7f8efc62c0d61106c6e0d068ca464d84b2032",
      "title": "Academic freedom and knowledge tradition of the Arab heritage",
      "authors": [
        {
          "name": "Mabruk Derbesh",
          "authorId": "1485921699"
        }
      ],
      "year": 2023,
      "abstract": "\nPurpose\nThis paper aims to confront some of the many facets of academic freedom as a whole, including the shared concerns with Western academia, its relationship to the politics of Arab society and the relevance of these issues within local political domains. It attempts to profile the problems hindering societal progress beyond the seemingly defined truth. While this subject has many facets, this article only examines academic freedom within the scope of knowledge and inquiry derived from the revered text of the Qur'ãn, including its relation to democracy and radicalism. It is an effort to refocus Arab intellectual dialogue on its ailing academia. It also argues for Arab society to reclaim its core culture of Islam as an enabler of learning aside from the Eurocentric perspective of academic freedom.\n\n\nDesign/methodology/approach\nThis paper uses an expository and persuasive format in its novel perspective. This expository form sets out the argument of academic freedom as being indigenous to Arab-Islamic heritage and pursues a persuasive statement for its resolution. This format outlines the main familiar aspects of academic freedom and lays out its components within Arab-Islamic history.\n\n\nFindings\nThis paper provides insights and arguments supporting its main theory. It suggests that Arabs must judiciously consider what their education will look like and accomplish in the next 100 years, considering the sociopolitical status quo and the chances of changing it. It argues that academic freedom is indigenous to Arab-Islamic early history, academia and knowledge governance. Therefore, Arab academia must not ignore its heritage to examine what hinders education and intellectualism. It concludes with the point that reinstalling a culture of knowledge will create a relevant democracy.\n\n\nResearch limitations/implications\nThe implications for research, practice and society are vast. Further academic freedom research would redefine terms of processes, change the role of academic leadership, debunk locally dominated politics, introduce learning-first policies, balance inequalities in gender, abolish academic tribalism and move past colonialist ideas and predominance. For researchers, this point of view would open doors for new scholastic approaches.\n\n\nPractical implications\nThis paper includes practical implications that stem from an approach that would provoke practical possibilities and call for more academic conversations. Further conversations should explore and debate the gaps in Arab-Islamic knowledge history. The Global South of the Arab World or the Middle East and Northern Africa/Southwest Asia North Africa region could consider drafting a contemporary MENA account of a Magna Charta Libertatis Academicae or a Magna Charta Universitatum that is galvanized by Arab revivable heritage. Moreover, It would be productive if Western universities that operate in the Arab World would also take an active role in denouncing undemocratic practices and not merely operate as commercial enterprises.\n\n\nSocial implications\nRealizing academic freedom in Arab institutions will have a positive spillover effect on Arab society, including thriving and free media, freedom of speech and gender issues. Academic freedom is one of the main elements in structuring free political culture that adhere to the principles of tolerance. Academic freedom is necessary for showing all contesting ideas in a better light and, ultimately, achieving a form of intellectual equipoise.\n\n\nOriginality/value\nThis paper concerns academic freedom in the Arab-Islamic World. The majority of academic freedom scholarship today assumes a Western democratic context in discussing or even arguing against it. The paper's focus is a novel expansion of that literature.\n",
      "citationCount": 4,
      "doi": "10.1108/oth-11-2022-0071",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/72c7f8efc62c0d61106c6e0d068ca464d84b2032",
      "venue": "HORIZONS A",
      "journal": {
        "name": "On the Horizon: The International Journal of Learning Futures"
      },
      "publicationTypes": null
    },
    {
      "paperId": "3c15ba529f825130fdb4dc7553a3d0a81d87be48",
      "title": "Echoes of T. S. Eliot’s Political Ideas in Contemporary Political Thought",
      "authors": [
        {
          "name": "Sameer Harshad Pande",
          "authorId": "2280253563"
        },
        {
          "name": "Nidhi h Sing",
          "authorId": "2280255430"
        }
      ],
      "year": 2023,
      "abstract": "As a distinguished poet, essayist, and literary critic, T. S. Eliot’s works delve into intricate societal quandaries, cultural decline, and the trials of modern civilization. This research paper endeavours to identify and analyse the core political concepts and philosophical perspectives expounded by Eliot throughout his poetry, essays, and other literary compositions on contemporary political thought. Key areas of investigation encompasses Eliot’s notion of tradition and its impact on individual character and how it resonates with political institutions and governance, influencing stability and continuity; his critical examination of modern society, rapid industrialization, and urbanization, and its alignment or divergence from other political thinkers of his time; the intersection of Eliot’s religious beliefs, particularly his conversion to Anglicanism, with his political views, moral principles, and notions of governance; his perspectives on authority, power structures, and the role of government, exploring the responsibilities vested in those in positions of power; his scepticism towards democratic governance and preference for an elite ruling class, relevant to contemporary debates on democracy and meritocracy; his writings on nationalism and cosmopolitanism, unveiling his views on balancing national identity and global cooperation; his conservative inclinations and cautious approach towards societal change, with implications for present-day political movements and debates on progress. The study reveals profound insights into tradition, religion, authority, and governance, providing valuable perspectives for contemporary political discourse. Eliot’s works continue to resonate as a thought-provoking and influential force in shaping the understanding of politics in the present day.",
      "citationCount": 0,
      "doi": "10.62106/blc2023v5i2e13",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/3c15ba529f825130fdb4dc7553a3d0a81d87be48",
      "venue": "BL College Journal",
      "journal": {
        "name": "BL College Journal"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "993eb423058cb1a0fedc27b98c89efd1761c348e",
      "title": "Kant’s anthropology and political realism",
      "authors": [
        {
          "name": "Andrey S. Zilber",
          "authorId": "2079799410"
        }
      ],
      "year": 2023,
      "abstract": "An upholder of liberal political values, Kant opposed the tradition of political realism on several levels, one of them the anthropological foundations of politics. Kant’s position was moderate: like liberals, he believed in the evolution of freedom; like conservatives, he underscored the difficulties confronting a person on that way and dissuaded from taking hasty action. Realists deem these difficulties either insurmountable or surmountable to such a modest degree that they will not allow the overcoming of anarchy, uncertainty and the conflict-prone nature of international relations. Some of Kant’s contemporaries criticised his philosophy of politics and law from positions close to political realism and conservatism in the broadest sense. I analyse and compare the arguments on both sides of this controversy. Kant pictured “practitional politicians” who point out the weakness of human nature to justify the wilfulness of rulers’ breach of agreements whilst denying the need for liberal reforms. I demonstrate that the obscurantist and pessimistic views of “practising politicians”, described by Kant, are very close to the arguments put forward by Friedrich von Gentz and August Wilhelm Rehberg, who had openly criticised Kant’s idea that political practice should be orientated towards an abstract theory and optimistic assumptions. Thus Kant responded to their criticism implicitly. Yet, both parties to the debate are universalists: Kant, on the one hand, with his concept of respect for right common to all people, and realists, on the other, with their idea of the moral weakness of humans.",
      "citationCount": 0,
      "doi": "10.1051/shsconf/202316106005",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/993eb423058cb1a0fedc27b98c89efd1761c348e",
      "venue": "SHS Web of Conferences",
      "journal": {
        "name": "SHS Web of Conferences"
      },
      "publicationTypes": [
        "Conference"
      ]
    },
    {
      "paperId": "245c494430c2c853d48fe88c257b78482575f1d5",
      "title": "Metaphors We Politicize By: The Conceptual Metaphor Theory and Political Discourse and Though",
      "authors": [
        {
          "name": "Alvariño Gabeiras",
          "authorId": "1485781327"
        },
        {
          "name": "L. Andrea",
          "authorId": "2075208720"
        }
      ],
      "year": 2018,
      "abstract": null,
      "citationCount": 1,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/245c494430c2c853d48fe88c257b78482575f1d5",
      "venue": "",
      "journal": {
        "name": "",
        "volume": ""
      },
      "publicationTypes": [
        "Review"
      ]
    },
    {
      "paperId": "9ead4944905f2540a5b9e184c6f225a4044e9799",
      "title": "I. Kant’s conservative liberalism from the standpoint of E. Burke’s liberal conservatism",
      "authors": [
        {
          "name": "Andrey S. Zilber",
          "authorId": "2079799410"
        },
        {
          "name": "S. Lugovoy",
          "authorId": "151212758"
        }
      ],
      "year": 2021,
      "abstract": "I. Kant and E. Burke both presented and developed their political views in 1790s in the common context of the French Revolution. We compare their views in two aspects. First, we consider the question whether Kant in his writings has implicitly referred to Burke’s pamphlet “Reflections on the Revolution in France”. In our view, it remains unproven and doubtful that Kant had read this book (in German translation). Second, we consider Kant’s political views as liberal and Burke’s ones as conservative. We rely on those scholars who distinguish liberalism and conservatism building on the anthropological foundations of political philosophy. Some scholars define Kant’s moderate liberalism as a variation of conservatism, although Kant explicitly criticizes a number of ultra-conser­vative views. Burke is widely known as the founder of modern conservatism but also has substantial liberal points in his views. Both philosophers sought to find balance between stability and improvement of a political order, but they propose completely different cri­teria for a reform policy. For Kant, all reforms should aim to realize the abstract ideal of universal law. Alongside, Kant recommends only moderate and prudent reforms in or­der to preserve the freedom and safety of states as political organisms. Burke views re­forms as a means of reconciling traditions and customs with changing circumstances. Our conclusion is that Burke cannot be named among the prototypes of those ultra-con­servatives whom Kant describes as the most implacable opponents of his views. We sup­port the assessment of Kant’s position as conservative liberalism and Burke's position as liberal conservatism. This perspective reveals a certain similarity of their views despite their fundamental differences.",
      "citationCount": 2,
      "doi": "10.21146/2072-0726-2021-14-3-50-64",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/9ead4944905f2540a5b9e184c6f225a4044e9799",
      "venue": "Philosophy Journal",
      "journal": {
        "name": "Philosophy Journal"
      },
      "publicationTypes": null
    },
    {
      "paperId": "474c6a4e5c20567888dffa054ae486a298c3f102",
      "title": "Key Philosophical and Legal Principles of Different Political Ideologies",
      "authors": [
        {
          "name": "Mikhail Kudashev",
          "authorId": "2274172185"
        }
      ],
      "year": 2025,
      "abstract": "Forms of public consciousness are not characterized by political neutrality. Natural scientists put forward and describe their theories based on life experience gained in society. This is no less true for judgments about law and state. We identify four main political ideologies of our time. They are conservatism, liberalism, anarchism and Marxism. Ideologically colored complexes correspond to these worldviews. The statutory text is interpreted through the prism of them. The complexes are designated as the key philosophical and legal principles in this article. Conservatism corresponds to the principle of continuity; liberalism corresponds to the priority of human rights and freedoms; anarchism – to the primacy of the interests of society over the interests of the state; the class character of law and state is a presupposition of Marxism. The structural situation in the system of labor division forces some social groups to lean towards one or another principle of reading the statutory norm. Pensioners gravitate towards the conservative initial. Entrepreneurs, politicians and capitalist-oriented intellectuals gravitate towards the liberal one. Freelancers gravitate towards the anarchic one. The organized industrial proletariat tends towards the communist principle. Each presupposition is able to contribute to the diversity and wealth of Russian society. However, due to the objective processes taking place in the economy, the movements of owners of production and beneficiaries of state paternalism often turn into an idealess support of the established balance of power. The workers’ movement, on the contrary, is characterized by a pre-chosen position of sacrifice. Against this background, the heuristic potential of anarchism is traditionally underestimated. The displacement of the administrative and command influence of the sovereign by the spontaneous market connection of individuals can be the key to overcoming the contradictions of capitalism without openly clashing with it. The means of legal technique were developed by legal practitioners during centuries of resistance to state pressure. From the point of view of philosophizing anarchists, principles of law will eventually lead legal scholars beyond the tabular model of truth proposed by the Enlightenment. A well thought-out theoretical and legal approach will save disciplinary research from the complimentary tone that almost inevitably accompanies a special legal study of the status quo.",
      "citationCount": 0,
      "doi": "10.17150/1819-0928.2025.26(1).150-163",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/474c6a4e5c20567888dffa054ae486a298c3f102",
      "venue": "Academic Law Journal",
      "journal": {
        "name": "Academic Law Journal"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "d55256ec53d4fd03b943f2259b490ae7d4ec6b6f",
      "title": "Creation, Fall and Political Order — Prussian Conservatism and the Old Testament",
      "authors": [
        {
          "name": "Laura C. Achtelstetter",
          "authorId": "2101001385"
        }
      ],
      "year": 2021,
      "abstract": "Abstract This article examines differences within the theological basis of early nineteenth-century Prussian conservatism. By exploring the usage of the Old Testament in the writings of conservative thought leaders Ernst Wilhelm Hengstenberg, Ernst Ludwig von Gerlach, and Friedrich Julius Stahl, this article contributes to scholarship of both traditions of biblical interpretation and that of the relation of theology and political theory. The focus of this article centers on three concepts of the Old Testament and their implementation in conservative political doctrine. I will discuss Hengstenberg’s concept of biblical historicity and unity of Scripture, Gerlach’s use of the Old Testament as the source of a role model for just religious wars and a theocratic concept of law, as well as Stahl’s bible-based political philosophy of history and the resulting model of political order. Thus, the basis for different, resulting concepts of church, state, and nation that were merged into an overall religion-based political conservative doctrine in pre-1848 Prussia are analyzed.",
      "citationCount": 0,
      "doi": "10.1515/jbr-2021-0009",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/d55256ec53d4fd03b943f2259b490ae7d4ec6b6f",
      "venue": "Journal of the Bible and its Reception",
      "journal": {
        "name": "Journal of the Bible and its Reception",
        "pages": "163 - 181",
        "volume": "8"
      },
      "publicationTypes": null
    },
    {
      "paperId": "2219581a638f35941b4bdc9b27a80aec80d358a9",
      "title": "The philosophy of the economy. Moral Economics",
      "authors": [
        {
          "name": "Nikolay Privalov",
          "authorId": "2329580636"
        }
      ],
      "year": 2024,
      "abstract": "The textbook systematically combines topical issues of methodological and philosophical foundations of economics, taking into account the achievements of classical political economy, the German historical school, institutionalism and non-economic disciplines (history, political science, sociology, cybernetics, biology, psychology, law, etc.). The main methodological principles of interdisciplinary communication are consistency, focus on achieving social balance and morality. The instruments of scientific research are adapted to the cultural traditions of Russia by taking into account the institutional factors affecting the economy. Russian Russian cosmism The concept of philosophy of economy presented in the textbook (philosophy of the third way, or moral and religious neo-institutionalism) is in line with the tradition of Russian existentialism (Russian cosmism). The traditions of the university textbook are complemented by elements of monographic research, in particular, on the creation of a new model of man — the \"traditional man\" (homo traditium). The paper attempts to return to the roots of classical economic theories — the works of ancient Greek authors, A. Smith, A. Marshall and others, who combined their scientific methodological principles with morality and other non-traditional disciplines for modern economic theory, for example biology. \nMeets the requirements of the federal state educational standards of higher education of the latest generation. \nIt is intended for students studying economics and anyone interested in the problems of the modern economy and Russia's place in world geopolitics.",
      "citationCount": 1,
      "doi": "10.12737/1946203",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/2219581a638f35941b4bdc9b27a80aec80d358a9",
      "venue": "",
      "journal": null,
      "publicationTypes": [
        "Book"
      ]
    },
    {
      "paperId": "53f270c4025424dff1438212a9e98a2ac32fe938",
      "title": "Postcolonial Historical Materialism",
      "authors": [
        {
          "name": "Filippo Menozzi",
          "authorId": "2341812618"
        }
      ],
      "year": 2025,
      "abstract": "Through a reappraisal of the work of four major figures in critical theory – Ernst Bloch, Georg Lukács, Theodor Adorno, and Walter Benjamin – Filippo Menozzi rethinks the tradition of critical theory in relation to pressing concerns in postcolonial studies.\n Revealing these authors’ continued relevance to urgent issues in the 21st century, from struggles against racism to social movements and the transmutations of global capitalism, Menozzi reimagines them as central to an alternative genealogy of critical theory that moves beyond their European provenance and the limitations of “Western Marxism”. In doing so, this book challenges, more broadly, the view of critical theory as steeped in Eurocentrism, culturally conservative, and politically defeatist. Contesting this in four chapters,Postcolonial Historical Materialisminserts Adorno, Lukács, Bloch, and Benjamin into key contemporary sites of militancy and debate.\n Engaging with a wide range of European and non-European sources, Menozzi proposes a new concept of “postcolonial historical materialism”, indicating how the heritage of critical theory can reopen global possibilities of utopia and revolution in a non-utopian age of global emergencies, social unrest, and the unfinished history of decolonisation.",
      "citationCount": 0,
      "doi": "10.5040/9781350410169",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/53f270c4025424dff1438212a9e98a2ac32fe938",
      "venue": "",
      "journal": null,
      "publicationTypes": [
        "Book"
      ]
    },
    {
      "paperId": "c77f20d6682609af0ab3c2e0f2de68203e90643b",
      "title": "Revisiting Pragmatism in Governance and Administration in Education: A Systematic Review in the Modern Era",
      "authors": [
        {
          "name": "R. Ms",
          "authorId": "2396339989"
        },
        {
          "name": "J. Ms",
          "authorId": "2396060739"
        },
        {
          "name": "Gladys S. Escarlos, PhD",
          "authorId": "2392804433"
        }
      ],
      "year": 2025,
      "abstract": "Pragmatism, rooted in the works of Charles Sanders Peirce, William James, and John Dewey, is a philosophical tradition that emphasizes the practical consequences of ideas and the evolving nature of truth. This paper examines the background of Pragmatism and its applicability in governance and administration within education, emphasizing its value as a flexible and results-oriented framework for policy and decision-making. Pragmatism promotes adaptability, collaboration, and evidence-based practices that prioritize real-world outcomes over rigid ideological or theoretical positions. Examples from the Philippines, such as participatory budgeting and the K–12 education reform, illustrate how pragmatic governance supports inclusivity, continuous learning, and policy relevance. However, the study also acknowledges key criticisms of Pragmatism, including its tendency toward relativism, moral inconsistency, and overemphasis on efficiency at the expense of justice. In the Philippine context, frequent policy shifts tied to political transitions reveal the risks of excessive flexibility and short-term focus. The paper concludes that while Pragmatism offers a valuable guide for responsive and innovative governance, it must be anchored in enduring ethical principles such as accountability, equity, and transparency. Balancing practicality with moral responsibility ensures that pragmatic governance and education remain both effective and just in promoting long-term societal development.",
      "citationCount": 0,
      "doi": "10.47772/ijriss.2025.91100098",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/c77f20d6682609af0ab3c2e0f2de68203e90643b",
      "venue": "International journal of research and innovation in social science",
      "journal": {
        "name": "International Journal of Research and Innovation in Social Science"
      },
      "publicationTypes": [
        "JournalArticle",
        "Review"
      ]
    },
    {
      "paperId": "05ac237be23b376a51344df52ce6faa8c4f8a858",
      "title": "The Moral Politician: Kant and the Kantian Conservatives in ‘Perpetual Peace’",
      "authors": [
        {
          "name": "Michael Kryluk",
          "authorId": "118849148"
        }
      ],
      "year": 2025,
      "abstract": "\n Kant’s description of the moral politician in ‘Perpetual Peace’ is the most detailed statement of his template for legislative reform. I argue that the moral politician responds to criticisms of Kant’s earlier ‘Theory and Practice’ essay by Friedrich Gentz and August Wilhelm Rehberg. Gentz and Rehberg objected to: Kant’s treatment of the relationship between theory and practice in politics, his conception of popular sovereignty, and his account of political transformation. By showing that Kant used the moral politician to rebut Gentz and Rehberg, I highlight an underappreciated dimension of ‘Perpetual Peace’ while situating Kant’s political stance in its historical context.",
      "citationCount": 0,
      "doi": "10.1017/s1369415425100824",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/05ac237be23b376a51344df52ce6faa8c4f8a858",
      "venue": "Kantian Review",
      "journal": {
        "name": "Kantian Review"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "271a174351047677506a20874f77b8813e240eb8",
      "title": "Time and the Everyday in Slow Cinema",
      "authors": [
        {
          "name": "Rosa Barotsi",
          "authorId": "2365816380"
        }
      ],
      "year": 2025,
      "abstract": "This book examines the European component of Slow cinema, a strand of contemporary cinema that makes extensive use of distended durations and the ‘dead time’ of quotidian activities. I trace the development of the two notions that form its core — time and the everyday — in order to situate it both in film history and contemporary culture. My aim is to interpret the momentum that this particular approach to filmmaking has gained in recent decades, by examining it in relation to developments in philosophical thought, film theory, technology, the film industry, and the specificity of the contemporary socio-political situation of late capitalism. I conclude that the phenomenon is aided, on the one hand, by its ties to an established tradition in durational filmmaking. Since duration is a quality adopted by both realist and modernist discourses, the trend’s consolidation in criticism has been aided by its alignment with both categories in recent work. On the other hand, the tendency towards slowness in cinema coincides with a contemporary social movement opting for deceleration, and a concomitant politics of time in which representations of alternative temporalities and the quotidian become political gestures. At the same time, Slow cinema has to be understood in relation to the institutional field of forces that sustain and promote it, such as the festival circuit and discourses around art cinema and cinephilia. In this light, the trend is seen as being immediately reappropriated by the temporalities of late capitalism and subject to conservative notions regarding quality and taste. Twenty-first-century durational cinema is thus shown to be an amalgam of retrogressive and radical qualities, both reacting against the dominant socio-political structures as well as participating in and perpetuating them.",
      "citationCount": 0,
      "doi": "10.37050/ci-34",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/271a174351047677506a20874f77b8813e240eb8",
      "venue": "Cultural Inquiry",
      "journal": {
        "name": "Cultural Inquiry"
      },
      "publicationTypes": null
    },
    {
      "paperId": "b4d52d69ebce251ed56b6283b0f9e54f36ddbf63",
      "title": "Rethinking ethics in policymaking: Dharma, reversibility and the imperatives of environmental policymaking",
      "authors": [
        {
          "name": "Divyali Mehrotra",
          "authorId": "2345971049"
        }
      ],
      "year": 2025,
      "abstract": "Since the age of Enlightenment, some philosophical traditions have assumed that human actions are ethically neutral, based on the belief that the non-human world is self-regulating and capable of maintaining balance regardless of human impact. However, with increasing human interference in the climate system and the accelerating rate of species extinction driven by human activity, this assumption appears to be flawed. Given the current environmental realities, the consequences of these actions are becoming increasingly difficult to manage, which demonstrates the need to challenge these frameworks. This paper outlines a framework for analysing political action by shifting the focus away from a solely human-centred perspective in ethics and decision-making, drawing on the concepts of reversibility and dharma. Reversibility integrates normative theory, political practice and policymaking, offering a way to address contemporary political challenges in a complex and pluralistic world. It emphasises that the human and non-human worlds are deeply interconnected and cannot be treated as separate. This perspective aligns with the principles of dharma, which advocate for the maintenance and preservation of cosmic order. Both reversibility and dharma highlight the responsibility humans have towards both the human and non-human realms, emphasising our interconnectedness. By bringing these approaches together, this paper proposes a novel framework for critically assessing the ethical dimensions of policies in today's uncertain and contingent world.",
      "citationCount": 0,
      "doi": "10.1177/19427786251318356",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/b4d52d69ebce251ed56b6283b0f9e54f36ddbf63",
      "venue": "Human Geography",
      "journal": {
        "name": "Human Geography",
        "pages": "422 - 428",
        "volume": "18"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "f724d55b76d0b5633d0b766ae4ae2170c6ef0e55",
      "title": "THEORETICAL AND METHODOLOGICAL APPROACHES TO THE RESEARCH OF SOCIAL COHESION: AN ANALYTICAL REVIEW",
      "authors": [
        {
          "name": "Vozniuk Serhii",
          "authorId": "2402323145"
        },
        {
          "name": "Solianyk Maryna",
          "authorId": "2402318163"
        }
      ],
      "year": 2025,
      "abstract": "The scientific review article offers a comprehensive theoretical analysis of social cohesion as a strategic resource for the development of society in the context of modern transformations. Based on an interdisciplinary approach, the study examines the evolution of the concept of cohesion and its methodological interpretations in sociology, philosophy, political science and social theory. The study systematizes key theoretical foundations: classical functionalism, social capital theory, theories of social integration and inclusion, philosophical and value approaches, as well as critical and postmodern perspectives.\nThe authors emphasize that social cohesion is not a spontaneous result of interpersonal interaction, but is the result of multidimensional social mechanisms that encompass normative, institutional and communicative dimensions. Cohesion arises through shared values, social trust, civic engagement, inclusiveness and tolerance for diversity, which reflects the balance between individual autonomy and collective unity.\nClassical functionalism (E. Durkheim, T. Parsons) views cohesion as social stability, supported by shared norms and values. Social capital theory (P. Bourdieu, J. Coleman, R. Putnam) conceptualizes social ties as resources that facilitate cooperation and trust. Integrative and inclusive approaches emphasize equal access to social resources, while philosophical and axiological perspectives interpret cohesion as a moral and spiritual unity based on justice, solidarity, and shared ethical principles. Critical theory (J. Habermas, Frankfurt School) views cohesion as a product of rational discourse and the pursuit of equality, while postmodern thought (Z. Bauman, J.-F. Lyotard) emphasizes its fluid, pluralistic, and networked nature in a globalized world.\nThe study concludes that strengthening social cohesion is essential for Ukraine’s post-war reconstruction, democratic stability, and building an inclusive society. This requires institutional reforms, educational strategies, civic initiatives, and the development of empirical indicators adapted to the Ukrainian context. The article lays a theoretical foundation for future empirical research, offering conceptual and methodological recommendations for measuring and strengthening social cohesion as a fundamental factor for sustainable social development.",
      "citationCount": 0,
      "doi": "10.51706/2707-3076-2025-13-15",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/f724d55b76d0b5633d0b766ae4ae2170c6ef0e55",
      "venue": "Scientific journal of Khortytsia National Academy",
      "journal": {
        "name": "Scientific journal of Khortytsia National Academy"
      },
      "publicationTypes": [
        "JournalArticle",
        "Review"
      ]
    },
    {
      "paperId": "9451f7ef1bae8d984cbb8ddd93ebab06d79f1876",
      "title": "On the belief that beliefs should change according to evidence: Implications for conspiratorial, moral, paranormal, political, religious, and science beliefs",
      "authors": [
        {
          "name": "Gordon Pennycook",
          "authorId": "2998138"
        }
      ],
      "year": 2019,
      "abstract": "Does one’s stance toward evidence evaluation and belief revision have relevance for actual beliefs? We investigate the role of having an actively open-minded thinking style about evidence (AOT-E) on a wide range of beliefs, values, and opinions. Participants indicated the extent to which they think beliefs (Study 1) or opinions (Studies 2 and 3) ought to change according to evidence on an 8-item scale. Across three studies with 1,692 participants from two different sources (Mechanical Turk and Lucid for Academics), we find that our short AOT-E scale correlates negatively with beliefs about topics ranging from extrasensory perception, to respect for tradition, to abortion, to God; and positively with topics ranging from anthropogenic global warming to support for free speech on college campuses. More broadly, the belief that beliefs should change according to evidence was robustly associated with political liberalism, the rejection of traditional moral values, the acceptance of science, and skepticism about religious, paranormal, and conspiratorial claims. However, we also find that AOT-E is more strongly predictive for political liberals (Democrats) than conservatives (Republicans). We conclude that socio-cognitive theories of belief (both specific and general) should take into account people’s beliefs about when and how beliefs should change – that is, meta-beliefs – but that further work is required to understand how meta-beliefs about evidence interact with political ideology.",
      "citationCount": 99,
      "doi": "10.31234/osf.io/a7k96",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/9451f7ef1bae8d984cbb8ddd93ebab06d79f1876",
      "venue": "Judgment and Decision Making",
      "journal": {
        "name": "Judgment and Decision Making"
      },
      "publicationTypes": null
    },
    {
      "paperId": "8a9517ad9fb20f952dc50d6e40cacde891a61c8e",
      "title": "Aristotle on constitutional and legal reform",
      "authors": [
        {
          "name": "George Duke",
          "authorId": "50014139"
        }
      ],
      "year": 2019,
      "abstract": null,
      "citationCount": 0,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/8a9517ad9fb20f952dc50d6e40cacde891a61c8e",
      "venue": "",
      "journal": {
        "name": "History of Political Thought",
        "pages": "381-404",
        "volume": "40"
      },
      "publicationTypes": null
    },
    {
      "paperId": "42ddb749bc9fb2a8e739bbfee6080ad5d90def7e",
      "title": "Planning in the Public Domain: From Knowledge to Action",
      "authors": [
        {
          "name": "J. Friedmann",
          "authorId": "97831958"
        }
      ],
      "year": 2020,
      "abstract": null,
      "citationCount": 477,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/42ddb749bc9fb2a8e739bbfee6080ad5d90def7e",
      "venue": "",
      "journal": {
        "name": "",
        "volume": ""
      },
      "publicationTypes": null
    }
  ],
  "count": 40,
  "errors": []
}
