[s2_search.py] Searching Semantic Scholar: 'Oakeshott practical knowledge rationalism conservatism' (year=2015-2025) (field=Philosophy), limit=40
[s2_search.py] Retrieved 3/3 papers...
[s2_search.py] Search complete: 3 papers found
[s2_search.py] Cached results (cache key: s2_1ebcb73c07d09aa5)
{
  "status": "success",
  "source": "semantic_scholar",
  "query": "Oakeshott practical knowledge rationalism conservatism",
  "results": [
    {
      "paperId": "a5408a441b6c4ab10964d89655063565cd9eca0c",
      "title": "Rationalism and Relativism: An Essay on John Rawls and Michael Oakeshott",
      "authors": [
        {
          "name": "A. J. Wendland",
          "authorId": "115048966"
        }
      ],
      "year": 2023,
      "abstract": "This essay creates an unlikely conversation between two 20th century thinkers: John Rawls and Michael Oakeshott. I say “unlikely” because apart from a few scant remarks in the writing of each the two did not directly engage each other. The essay begins by examining Oakeshott’s explication of “The Rationalist” and her tradition in the history of political thought. Specifically, the essay shows that rationalism in politics involves the belief that reason is an infallible guide to political activity and that the Rationalist seeks certainty and perfection in political affairs. The essay goes on to tease out the rationalistic tendencies in Rawls’ A Theory of Justice, and then it analyzes Oakeshott’s critique of rationalism and applies these criticisms to Rawls. Briefly, Oakeshott marks a distinction between technical and practical knowledge, and he argues that the principles that make up technical manuals like A Theory of Justice are abridgments of and no substitute for the understanding we gain through our practical experience and our participation in a given political tradition. While explaining Oakeshott’s critique of rationalism and Rawls, the essay indicates some of the relativistic proclivities in Oakeshott’s appeal to political practices and traditions, and then it entertains objections to Oakeshott that a Rawlsian might offer. Here Rawls’ commitment to the liberal tradition and the relativity implicit in his explanations of “reflective equilibrium” and “reasonableness” are examined and Rawls’ similarities to Oakeshott are noted. Ultimately, this essay argues that the strength of Rawls’ work lay not in the fact that his principles of justice are established by rational agents in an original position, but in the fact that they are principles that emerge from and cohere with ideas deeply rooted in the Western tradition itself.",
      "citationCount": 0,
      "doi": "10.18523/2617-1678.2022.9-10.107-118",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/a5408a441b6c4ab10964d89655063565cd9eca0c",
      "venue": "NaUKMA Research Papers in Philosophy and Religious Studies",
      "journal": {
        "name": "NaUKMA Research Papers in Philosophy and Religious Studies"
      },
      "publicationTypes": null
    },
    {
      "paperId": "09f16a13e7460ca707a6827a76f8e987d75b2eee",
      "title": "Competencies as ‘Know-how’ and Self-contradiction of Competency-Based Education Theory －Based on the Discussions of Ryle, Oakeshott, and Polyani",
      "authors": [
        {
          "name": "Jerome Chang",
          "authorId": "2116242715"
        }
      ],
      "year": 2022,
      "abstract": "The (core) competency-based education theory presented through the OECD’s DeSeCo project and its follow-up project (OECD Education 2030), stems from the motivation to pay appropriate attention to practical knowledge beyond cultivating theoretical knowledge that has been traditionally emphasized. The main theoretical sources constituting the epistemology of competency-based education theory can be presented as follows: analytical philosopher Gilbert Ryle's distinction between ‘know-how’ and ‘know-that’, political scientist Michael Oakshott's criticism of technological rationalism and his distinction between the politics of faith and that of skepticism, and physical chemist, historian of science, and philosopher of science Michael Polanyi's concepts of tacit knowledge and personal knowledge. However, discrepancy between what the OECD's competency-based education theory originally intended and its actual realization is first found in the program of the OECD projects itself; and this problem is much more seriously revealed in the process and appearance of introducing and applying competency-based education theory into the Korean higher education system. This self-contradiction that ‘betrays’ the original theoretical request of competency-based education theory is identified in the following areas: the OECD projects’ reduction of competences as ‘know-how’ to the form of propositional knowledge, in the situation in Korea, in the state's status that claims to be a rule maker, in the future discourse based on simple logic of technological determinism, and in the making of propositions and the quantification of competencies. Such problems are resolved by abolishing measures of forcibly introducing and applying a specific educational discourse by the state, and making the competency-based education theory a subject of free choice through deliberation at individual educational units.",
      "citationCount": 1,
      "doi": "10.46392/kjge.2022.16.6.103",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/09f16a13e7460ca707a6827a76f8e987d75b2eee",
      "venue": "The Korean Association of General Education",
      "journal": {
        "name": "The Korean Association of General Education"
      },
      "publicationTypes": null
    },
    {
      "paperId": "80a681c20edf8671063176dd51491a86235ef83c",
      "title": "Epistemological Schools of Thought and Risk Management Research",
      "authors": [
        {
          "name": "Uduakobong Inyang",
          "authorId": "2099735728"
        }
      ],
      "year": 2024,
      "abstract": "The main objective of the study was to provide knowledge on the epistemological schools of thoughts that most appropriately suits risk management research. The researcher then laid out the steps involved in managing risk, like identifying potential dangers, analyzing how likely the researcher are, figuring out how to control them, and then checking how well your plan worked. Next, the researcher looked at specific schools of thought like naturalism (focusing on the physical world), rationalism (using logic and reason), empiricism (based on evidence), idealism (emphasizing ideas), and existentialism (individual experience). By comparing these schools, the researcher showed how each has its strengths and weaknesses. The key takeaway? Don't just stick to one way of thinking about risk! Mix and match different approaches depending on the situation. This will help practitioners and researchers to make risk management research more reliable, accurate, and widely accepted. So, in a nutshell, this research is like a guide for choosing the right tools to navigate the tricky terrain of risk. By understanding different ways of knowing and using them strategically, practitioners and researchers can make better decisions and avoid getting caught off guard.\nReferences\nAsif, M., Pasha, M. A., Mumtaz, A., & Sabir, B. (2023). Causes of Youth Unemployment in Pakistan. Inverge Journal of Social Sciences, 2(1), 41-50.\nAsif, M., & Shaheen, A. (2022). Creating a High-Performance Workplace by the determination of Importance of Job Satisfaction, Employee Engagement, and Leadership. Journal of Business Insight and Innovation, 1(2), 9-15.\nAurangzeb, M. (2021). Influence of administrative expertise on human resources practitioners on the job performance: Mediating role of achievement motivation. International Journal of Management, 12(4), 408-421.\nBarrow, R. (2010). Schools of thought in philosophy of education. The SAGE handbook of the philosophy of education, 21-36.\nBull, J. J., & Lauring, A. S. (2014). Theory and empiricism in virulence evolution. PLoS pathogens, 10(10), e1004387.\nCelestino, T. (2023). High School Sustainable and Green Chemistry: Historical–Epistemological and Pedagogical Considerations. Sustainable Chemistry, 4(3), 304-320.\nClark, K. J. (Ed.). (2016). The Blackwell companion to naturalism. John Wiley & Sons.\nDunham, J., Grant, I. H., & Watson, S. (2014). Idealism: The history of a philosophy. Routledge.\nEwing, A. C. (2013). Idealism: A critical survey. Routledge.\nGardner, S. (2011). Idealism and naturalism in nineteenth-century philosophy (pp. 89-110). Edinburgh University Press.\nGatens, M. (2017). Modern rationalism. A companion to feminist philosophy, 21-29.\nHassan, N. R., Mingers, J., & Stahl, B. (2018). Philosophy and information systems: where are we and where should we go?. European Journal of Information Systems, 27(3), 263-277.\nHossain, F. A. (2014). A critical analysis of empiricism. Open journal of philosophy, 2014.\nIshfaq, U., Imran, A., Joseph, V., Haqdad, U., & Asif, M. (2022). MEDIATING ROLE OF TRUST BETWEEN EMOTIONAL INTELLIGENCE AND PROJECT TEAM PERFORMANCE IN TELECOMMUNICATION SECTOR. PalArch's Journal of Archaeology of Egypt/Egyptology, 19(4), 988-1005.\nJohnson, M. H. (2011). On the nature of empiricism in archaeology. Journal of the Royal Anthropological Institute, 17(4), 764-787.\nKhin, E. W. S., Ying, C. W., Meng, W. Y., & Fatt, C. K. (2011). A coherent epistemological theory in management philosophy research. Australian Journal of Basic and Applied Sciences, 5(10), 874-880.\nKojonen, E. V. R. (2017). Methodological naturalism and the truth seeking objection. International Journal for Philosophy of Religion, 81(3), 335-355.\nMaddy, P. (2011). Naturalism and common sense. Analytic Philosophy, 52(1), 2-34.\nMartinez-Vargas, C., Walker, M., Melis Cin, F., & Boni, A. (2022). A capabilitarian participatory paradigm: Methods, methodologies and cosmological issues and possibilities. Journal of Human Development and Capabilities, 23(1), 8-29.\nMeyers, R. G. (2014). Understanding empiricism. Routledge.\nMichelman, S. (2010). The A to Z of Existentialism (No. 162). Rowman & Littlefield.\nMorard, S., Sanchez, E., & Bonnat, C. (2023). Museum Games and Personal Epistemology: A Study on Students’ Critical Thinking with a Mixed Reality Game. International Journal of Serious Games, 10(4), 131-151.\nMuller, J. (2014). Every picture tells a story: Epistemological access and knowledge. Education as change, 18(2), 255-269.\nOlson, R. G. (2012). An introduction to existentialism. Courier Corporation.\nReynolds, J. (2014). Understanding existentialism. Routledge.\nSchulting, D., & Verburgt, J. (Eds.). (2010). Kant's idealism: new interpretations of a controversial doctrine (Vol. 66). Springer Science & Business Media.\nShapere, D. (2012). Reason and the Search for Knowledge: Investigations in the Philosophy of Science (Vol. 78). Springer Science & Business Media.\nSlomp, G. (2016). The Origins of Realism Revisited. In The Ashgate Research Companion to Ethics and International Relations (pp. 25-38). Routledge.\nSmith, S. B. (2012). Practical life and the critique of Rationalism. The Cambridge Companion to Oakeshott, 131-152.\nStock, T. (2020). Beyond the Myth of Idealism: North Korea's Marxist-Leninist Materialism and Its Place in the Global Intellectual History of the Cold War. Seoul Journal of Korean Studies, 33(1), 215-242.\nTahko, T. E. (2017). Empirically-informed modal rationalism. In Modal epistemology after rationalism (pp. 29-45). Springer, Cham.\nWelch, I. V., Szostak, R., & Repko, A. (2011). The emergence of interdisciplinarity from epistemological thought. Issues in Interdisciplinary Studies.\nWestphal, K. R. (2012). Hegel’s epistemological realism: a study of the aim and method of Hegel’s Phenomenology of Spirit (Vol. 43). Springer Science & Business Media.",
      "citationCount": 0,
      "doi": "10.63544/ijss.v3i1.74",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/80a681c20edf8671063176dd51491a86235ef83c",
      "venue": "Inverge Journal of Social Sciences",
      "journal": {
        "name": "Inverge Journal of Social Sciences"
      },
      "publicationTypes": [
        "JournalArticle",
        "Review"
      ]
    }
  ],
  "count": 3,
  "errors": []
}
