[s2_search.py] Searching Semantic Scholar: 'political legitimacy tradition constitutional' (year=2015-2025) (field=Philosophy), limit=35
[s2_search.py] Retrieved 35/35 papers...
[s2_search.py] Cached results (cache key: s2_662a767d0f5a1d07)
{
  "status": "success",
  "source": "semantic_scholar",
  "query": "political legitimacy tradition constitutional",
  "results": [
    {
      "paperId": "2329f88d4c02ad06bcd3599e25fcb97a758e9b16",
      "title": "Colonial Roots",
      "authors": [],
      "year": 2020,
      "abstract": null,
      "citationCount": 0,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/2329f88d4c02ad06bcd3599e25fcb97a758e9b16",
      "venue": "",
      "journal": null,
      "publicationTypes": null
    },
    {
      "paperId": "16dcace2845ba41f7114c8db45f3930d1ac6e6e8",
      "title": "Colonial Roots NATURAL LAW and the COLONIAL ROOTS of AMERICAN CONSTITUTIONALISM",
      "authors": [],
      "year": 2019,
      "abstract": null,
      "citationCount": 2,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/16dcace2845ba41f7114c8db45f3930d1ac6e6e8",
      "venue": "",
      "journal": null,
      "publicationTypes": null
    },
    {
      "paperId": "196b0c7cc6ea56f0baaf171a4371d8a23ce8917f",
      "title": "Colonial Roots",
      "authors": [],
      "year": 2019,
      "abstract": null,
      "citationCount": 0,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/196b0c7cc6ea56f0baaf171a4371d8a23ce8917f",
      "venue": "",
      "journal": null,
      "publicationTypes": null
    },
    {
      "paperId": "1937676f0a3896910b520e197c5262901e831ade",
      "title": "Colonial Roots",
      "authors": [],
      "year": 2019,
      "abstract": null,
      "citationCount": 0,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/1937676f0a3896910b520e197c5262901e831ade",
      "venue": "",
      "journal": null,
      "publicationTypes": null
    },
    {
      "paperId": "05c79b4408bd8db6c56baf5987e1395e4144f747",
      "title": "Political legitimacy in Rawls’ early and late political liberalism – Two diverging interpretations",
      "authors": [
        {
          "name": "Silje A. Langvatn",
          "authorId": "114039384"
        }
      ],
      "year": 2024,
      "abstract": "This article assesses Frank I. Michelman’s constitution-centered and proceduralist interpretation of Rawls’ conception of political legitimacy and argues that it merits attention because it highlights the institutional aspects of Rawls’ understanding of political legitimacy for constitutional democracies. However, the article also questions Michelman’s interpretation of Rawls’ ‘liberal principle of legitimacy’ (LPL) and the later ‘idea of political legitimacy based on the criterion of reciprocity’ (ILBR). As Michelman rightly points out, for the exercise of political power to be legitimate in a constitutional democracy, it must be in accordance with a constitution that is itself legitimate or reasonably acceptable to free and equal citizens. Yet, the article argues that Rawls’ two legitimacy formulations are attempts to make an additional point: Namely that when democratic citizens exercise political power in ‘the fundamental political issues’, or in issues that shape the basic justice of society or the essentials of the constitution itself, they must respect the ideal of public reason – or ensure themselves and other citizens that their exercise of political power is in accordance with the underlying basic political-moral ideas of persons and society that make the constitution itself acceptable to them. The LPL and the ILBR are conceptions of political legitimacy, not in the sense of setting up a criterion for when a specific law is legitimate, but in the sense of outlining civic or “office-specific” constraints that citizens and public officials must put on their reasoning and exercise of political power in the fundamental political issues for the practice of a constitutional democracy to be legitimate, or well-ordered, reasonably just, and stable for the right reasons – in the long run. The article also discusses why Rawls saw the need to reformulate the LPL, and how the later ILBR assigns a new significance to citizens’ actual use of public reason and their intersubjective deliberation.",
      "citationCount": 0,
      "doi": "10.1177/01914537241263324",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/05c79b4408bd8db6c56baf5987e1395e4144f747",
      "venue": "Philosophy &amp; Social Criticism",
      "journal": {
        "name": "Philosophy & Social Criticism",
        "pages": "1138 - 1154",
        "volume": "50"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "1b0ce44c27d0b76382044cb86273235780035ff7",
      "title": "Confucian meritocracy, political legitimacy and constitutional democracy",
      "authors": [
        {
          "name": "Zhuoyao Li",
          "authorId": "51255171"
        }
      ],
      "year": 2020,
      "abstract": "The article will argue that neither what may be called ‘multiple legitimacies’ nor what Leigh Jenco refers to as the hybrid view of legitimacy provides substantial guidance in reconceiving legitimacy in the increasingly pluralistic region of East Asia. Instead, a more helpful view of political legitimacy can be drawn from John Rawls’s liberal principle of legitimacy. I will demonstrate that Rawls’s classic formulation can be deprived of its liberal connotation by taking constitutional essentials as the source of legitimation for political authority. On the basis of this principle of pluralistic legitimacy, it will become clear that a pluralistic understanding of political legitimacy does not rule out Confucian meritocracy, but it does make a strong case for an antiperfectionist state, even if it might be nondemocratic.",
      "citationCount": 3,
      "doi": "10.1177/0191453720948403",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/1b0ce44c27d0b76382044cb86273235780035ff7",
      "venue": "",
      "journal": {
        "name": "Philosophy & Social Criticism",
        "pages": "1076 - 1092",
        "volume": "46"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "dbd3a65dd0ac6fd481d833ddc5aba13488b826b9",
      "title": "THE PHENOMENON OF IMPOSTURE. TRANSCENDENTAL LEGITIMACY OF POWER IN POLITICAL MODERNITY",
      "authors": [
        {
          "name": "Claudio Ingerflom",
          "authorId": "113077207"
        }
      ],
      "year": 2024,
      "abstract": "The article deals with the theoretical problem of studying imposture as a phenomenon of history, which is often seen only as an event frame\nrelating to a certain time. But imposture is recurrent, becomes chronic, and\ntherefore needs to be conceptualized not only as an event phenomenon, but also\nas a peculiar constant of Russian reality, in which together with the “present”\ncoexist the so-called “sediments”, testifying to the deeper nature of the “past in\nthe present”. The author comes to the idea that a peculiar constant of Russian\nhistory was the informalized power, initially asserting its transcendent rather\nthan legal (civil) function. It was determined by both religious postulates and\nthe political specifics of the region itself. The phenomenon of imposture can\nbe extended to the limits of the history of the autocracy itself. In any case, the\nproposed model of including imposture in the history of the autocracy poses a\nnew question to the researcher – about the nature of legitimacy in the informal\nlegal tradition of Russia throughout the centuries.",
      "citationCount": 0,
      "doi": "10.28995/2686-7249-2024-9-30-41",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/dbd3a65dd0ac6fd481d833ddc5aba13488b826b9",
      "venue": "RSUH/RGGU Bulletin. \"Literary Theory. Linguistics. Cultural Studies\" Series",
      "journal": {
        "name": "RSUH/RGGU Bulletin. \"Literary Theory. Linguistics. Cultural Studies\" Series"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "78e40dc03caa4873473173bc183f843061405bbc",
      "title": "The Economic Tradition and the Problem of Social Order: Hans Albert’s Critique of Welfare Economics and the Perspective of Constitutional Political Economy",
      "authors": [
        {
          "name": "V. Vanberg",
          "authorId": "118763109"
        }
      ],
      "year": 2021,
      "abstract": null,
      "citationCount": 4,
      "doi": "10.1007/s41412-021-00106-3",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/78e40dc03caa4873473173bc183f843061405bbc",
      "venue": "Homo Oeconomicus",
      "journal": {
        "name": "Homo Oeconomicus",
        "pages": "83-111",
        "volume": "39"
      },
      "publicationTypes": null
    },
    {
      "paperId": "b8b83cb740ab7f23da11c91866a4500c49f5542a",
      "title": "Moral disagreement and the limits of AI value alignment: a dual challenge of epistemic justification and political legitimacy",
      "authors": [
        {
          "name": "Nick Schuster",
          "authorId": "2367802017"
        },
        {
          "name": "Daniel Kilov",
          "authorId": "2367802615"
        }
      ],
      "year": 2025,
      "abstract": "AI systems are increasingly in a position to have deep and systemic impacts on human wellbeing. Projects in value alignment, a critical area of AI safety research, must ultimately aim to ensure that all those who stand to be affected by such systems have good reason to accept their outputs. This is especially challenging where AI systems are involved in making morally controversial decisions. In this paper, we consider three current approaches to value alignment: crowdsourcing, reinforcement learning from human feedback, and constitutional AI. We argue that all three fail to accommodate reasonable moral disagreement, since they provide neither good epistemic reasons nor good political reasons for accepting AI systems’ morally controversial outputs. Since these appear to be the most promising approaches to value alignment currently on offer, we conclude that accommodating reasonable moral disagreement remains an open problem for AI safety, and we offer guidance for future research.",
      "citationCount": 4,
      "doi": "10.1007/s00146-025-02427-2",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/b8b83cb740ab7f23da11c91866a4500c49f5542a",
      "venue": "Ai & Society",
      "journal": {
        "name": "Ai & Society",
        "pages": "6073 - 6087",
        "volume": "40"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "0276a182b279d8a58c325b043d62d9ba1d0905de",
      "title": "Modern Constitutional Legitimacy and Political Theology: Schmitt, Peterson and Blumenberg",
      "authors": [
        {
          "name": "Nathan Gibbs",
          "authorId": "4074467"
        }
      ],
      "year": 2018,
      "abstract": "In this article, an important set of general themes will be examined in relation to the ongoing problematization of the legitimacy of modern constitutionalism within a body of work that largely draws on Carl Schmitt’s political theology. In particular, however, the themes discussed in this article will focus on the later, post-war stages of his work contained in the brief, but dense volume entitled, Political Theology II. This work involves a sustained confrontation with the theologian Erik Peterson and the historian of ideas Hans Blumenberg, a confrontation which helps to shed light on the broader significance of Schmitt’s work.",
      "citationCount": 1,
      "doi": "10.1007/S10978-018-9228-9",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/0276a182b279d8a58c325b043d62d9ba1d0905de",
      "venue": "Law and Critique",
      "journal": {
        "name": "Law and Critique",
        "pages": "67-89",
        "volume": "30"
      },
      "publicationTypes": null
    },
    {
      "paperId": "8d93fe7980a0fe0d89bb209fc6a07d82467df766",
      "title": "Ferrara’s Principles of Constitutional Legitimacy: From Plato to Rawls, and Backwards?",
      "authors": [
        {
          "name": "Greta Favara",
          "authorId": "2338304319"
        },
        {
          "name": "Roberta Sala",
          "authorId": "2369934216"
        }
      ],
      "year": 2025,
      "abstract": "In his latest book, Sovereignty Across Generations: Constituent Power and Political Liberalism, Alessandro Ferrara explores the grounds, norms and scope of liberal constitutions’ legitimacy. Specifically, Ferrara develops Rawls’s political liberalism by exploring liberal legitimacy in a constitutional direction. Indeed, while the grounds of constitutions’ legitimacy were not the primary focus of Rawls’s own investigations, Ferrara believes that political liberalism must now be extended in this direction – for both theoretical and political reasons. In this review, we examine Ferrara’s proposal, bearing in mind his project’s Rawlsian roots. Specifically, we examine the relationship between reasonableness and constitutional legitimacy; we suggest that some of Ferrara’s conclusions – especially his intergenerational conception of the people as sovereign – might stand in tension with the Rawlsian framework within which he has drawn them.",
      "citationCount": 0,
      "doi": "10.17473/2240-7987-2025-1-2",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/8d93fe7980a0fe0d89bb209fc6a07d82467df766",
      "venue": "Filosofia e questioni pubbliche",
      "journal": {
        "name": "Filosofia e questioni pubbliche"
      },
      "publicationTypes": [
        "JournalArticle",
        "Review"
      ]
    },
    {
      "paperId": "5d2c2d36c024251e661c6aebcd9f7391a035b229",
      "title": "Whose Realism? Which Legitimacy? Ideologies of Domination and Post-Rawlsian Political Theory",
      "authors": [
        {
          "name": "W. Roberts",
          "authorId": "117687227"
        }
      ],
      "year": 2022,
      "abstract": null,
      "citationCount": 5,
      "doi": "10.1515/auk-2022-2028",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/5d2c2d36c024251e661c6aebcd9f7391a035b229",
      "venue": "",
      "journal": {
        "name": "Analyse & Kritik",
        "pages": "41 - 60",
        "volume": "44"
      },
      "publicationTypes": null
    },
    {
      "paperId": "4d3e07b3d7ca22a8ae4e1857c24f0943db201f7d",
      "title": "Legitimacy, the Social Turn, and Constitutional Review: What Political Liberalism Suggests",
      "authors": [
        {
          "name": "Frank I. Michelman",
          "authorId": "15390042"
        }
      ],
      "year": 2015,
      "abstract": null,
      "citationCount": 9,
      "doi": "10.5771/2193-7869-2015-3-183",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/4d3e07b3d7ca22a8ae4e1857c24f0943db201f7d",
      "venue": "",
      "journal": {
        "name": "Comparative & Non-U.S. Constitutional Law eJournal"
      },
      "publicationTypes": [
        "Review"
      ]
    },
    {
      "paperId": "63849d3ac7c25f582a25f99a15d4c5ba3005929f",
      "title": "Republican Auctoritas: Harrington’s dual theory of political legitimacy",
      "authors": [
        {
          "name": "C. Trojan",
          "authorId": "116122185"
        }
      ],
      "year": 2019,
      "abstract": "Neo-republicans position James Harrington (1611–1677) as a seminal figure in a tradition that asks what set of institutions grant the individual freedom from domination. This article argues that the signal emphasis on freedom diverts us from the broader question of legitimacy motivating Harrington’s republicanism. Harrington contends that the liberty property confers is a necessary but insufficient condition for de jure government. The popular liberty that a broad distribution of wealth secures must be supplemented by a Roman concept of authority in order for the regime to become legitimate. Republican legitimacy requires the marriage of popular power and aristocratic virtue; it demands both the wide distribution of property and the integration of authority as auctoritas into the political constitution. The elucidation of Harrington’s dual theory of legitimacy makes it possible to reassess the distance separating a republicanism that follows Harrington from a liberalism that follows Hobbes.",
      "citationCount": 1,
      "doi": "10.1177/1474885118806677",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/63849d3ac7c25f582a25f99a15d4c5ba3005929f",
      "venue": "European Journal of Political Theory",
      "journal": {
        "name": "European Journal of Political Theory",
        "pages": "398 - 420",
        "volume": "20"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "03ce5df556ba11e22e9afe3f3e784e7bc84c97df",
      "title": "Political Legitimacy",
      "authors": [
        {
          "name": "Paul D. Sheeran",
          "authorId": "2270851694"
        }
      ],
      "year": 2019,
      "abstract": "In Political Legitimacy, a distinguished interdisciplinary group of scholars in political science, law, and philosophy examine one of the most challenging and important concepts in contemporary politics: legitimacy. The twelve essays in this volume, the latest installment in the NOMOS series, take up fundamental philosophical questions about the appropriate scope and domain of legitimacy and the justified exercise of political power, as well as empirical questions about the structure of citizens’ beliefs about compliance and justice. The essays also speak to urgent concerns for contemporary politics, including whether “animus” should matter for the legitimacy of political decisions and the range of institutions (international institutions, labor unions, and so forth) for which legitimacy is relevant. The volume is in three parts. The first third addresses basic questions of the legitimacy of the state and its regime, drawing on competing traditions in the history of political thought (Kant, Hobbes, and Aristotle). The second takes up the reasons according to which institutional authority may be exercised. The final part turns to the empirical study of legitimacy and compliance, and to the relationship between what the authors describe as moral or normative accounts of legitimacy and sociological or descriptive legitimacy.",
      "citationCount": 181,
      "doi": "10.4135/9781483381503.n923",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/03ce5df556ba11e22e9afe3f3e784e7bc84c97df",
      "venue": "",
      "journal": null,
      "publicationTypes": null
    },
    {
      "paperId": "4b2711b435d363246df313d5d2d5bb965032218f",
      "title": "Political Liberalism and Legitimacy",
      "authors": [
        {
          "name": "Charles E. Larmore",
          "authorId": "67007167"
        }
      ],
      "year": 2020,
      "abstract": "This chapter explores the phenomenon of reasonable disagreement, which is an idea that can seem paradoxical because of the philosophical tradition that leads inevitably to the convergence of opinion. It analyzes the conception of political legitimacy that follows the fundamental principles of political society as they are coercive in nature. It discusses liberalism that is seen more clearly than past conceptions about the true task of political philosophy due to the reflective culture imbued with historical self-awareness. The chapter also provides a clear view of the fundamental problems confronting political society. It reviews political liberalism, which is understood as a form of liberal theory that is different from classical liberalism and becomes a vigorous area of philosophical reflection.",
      "citationCount": 0,
      "doi": "10.2307/j.ctvs32r7c.7",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/4b2711b435d363246df313d5d2d5bb965032218f",
      "venue": "What Is Political Philosophy?",
      "journal": {
        "name": "What Is Political Philosophy?"
      },
      "publicationTypes": [
        "Review"
      ]
    },
    {
      "paperId": "4e64d9dd39c35462df428e01c76b016bee43423f",
      "title": "Engaging the later Rawls on legitimacy",
      "authors": [
        {
          "name": "Alessandro Ferrara",
          "authorId": "2275233737"
        }
      ],
      "year": 2024,
      "abstract": "Frank Michelman’s recent book Constitutional Essentials. On the Constitutional Theory of Political Liberalism is discussed from a specific angle, related to how Rawls’s ‘deflection procedure’ – called by Michelman ‘justification by constitution’ – is affected by two recent innovations in the paradigm of political liberalism: first, the extension of reasonable pluralism to a family of liberal political conceptions of justice that coexist in a liberal-democratic society; second, the idea of legitimation based on the criterion of reciprocity, aimed at supplementing the liberal principle of legitimacy. In the attempt to probe Michelman’s assessment of the impact of these two innovations, three critical points are mentioned, for each of them, that suggest a somewhat more sceptical attitude than Michelman’s about the capacity of ‘justification by constitution’ to remain substantially unaltered, once these innovations are in place.",
      "citationCount": 1,
      "doi": "10.1177/01914537241263267",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/4e64d9dd39c35462df428e01c76b016bee43423f",
      "venue": "Philosophy &amp; Social Criticism",
      "journal": {
        "name": "Philosophy & Social Criticism",
        "pages": "1076 - 1084",
        "volume": "50"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "8c180f6bdac15d39c2cbb4bf22f189f5f18be592",
      "title": "Human Rights Between Universality and Islamic Legitimacy",
      "authors": [
        {
          "name": "Mahmoud Bassiouni",
          "authorId": "2317401655"
        }
      ],
      "year": 2024,
      "abstract": "\n Human rights are stuck in a normative dilemma in contemporary Islamic human rights discourses. On the one hand, they have to be Islamically legitimate, that is, anchored in the Islamic legal and intellectual tradition in order not to be considered externally imposed. On the other hand, human rights must also be secular, that is, justifiable independently of Islamic faith in order to live up to their universal character. The aim of the book is to formulate a conception of human rights that is able to satisfy the normative requirements of universality and Islamic legitimacy to the same extent. In a double dialogue with the Islamic legal tradition and contemporary human rights philosophy, it conceptualizes human rights as institutions for the protection of human needs based on the theory of Islamic legal purposes (maqāṣid al-sharīʿa). It thereby aims to contribute to contemporary human rights debates in the field of political theory and provide coherent answers to open and controversial questions, such as why human beings should have rights, how the content of those rights should be determined, and whether there is a hierarchy among human rights.",
      "citationCount": 2,
      "doi": "10.1093/oso/9780197753897.001.0001",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/8c180f6bdac15d39c2cbb4bf22f189f5f18be592",
      "venue": "",
      "journal": null,
      "publicationTypes": [
        "Book"
      ]
    },
    {
      "paperId": "d230aa51ea343dbffd6d4c9406ccfd902866c377",
      "title": "Political Legitimacy and Ethnocultural Justice. Essays on Public Reason, Democratic Citizenship, and the Rights of Cultural Minorities",
      "authors": [
        {
          "name": "Daniel Weyermann",
          "authorId": "94834652"
        }
      ],
      "year": 2016,
      "abstract": null,
      "citationCount": 0,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/d230aa51ea343dbffd6d4c9406ccfd902866c377",
      "venue": "",
      "journal": {
        "name": "",
        "volume": ""
      },
      "publicationTypes": null
    },
    {
      "paperId": "93748f3a633eba99594b2ae9adb90ee565950c77",
      "title": "ALEXANDRE KOJÈVE’S NOTION OF AUTHORITY AND THE CONSTRUCTION OF POLITICAL LEGITIMACY",
      "authors": [
        {
          "name": "Alexandru-Vasile Sava",
          "authorId": "122460399"
        }
      ],
      "year": 2016,
      "abstract": null,
      "citationCount": 0,
      "doi": null,
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/93748f3a633eba99594b2ae9adb90ee565950c77",
      "venue": "",
      "journal": {
        "name": "",
        "pages": "65-84",
        "volume": "10"
      },
      "publicationTypes": null
    },
    {
      "paperId": "8466b9c5776ce4e3170c928064b07ff4d5eeda23",
      "title": "Personal dignity as a constitutional value: concept, practice, technique",
      "authors": [
        {
          "name": "Vladimir Baranov",
          "authorId": "2298800779"
        },
        {
          "name": "R. Romashov",
          "authorId": "2298800492"
        }
      ],
      "year": 2024,
      "abstract": "The construction of the dignity of the individual is considered in the context of the cyclical politogenesis of the Russian state-legal system. Based on a comparative analysis of the concepts of ‘‘man’’, ‘‘citizen’’, ‘‘personality’’ in the Russian language and the domestic political and legal tradition, a hypothesis of the semantic transformation of these categories in the context of cultural and historical discreteness is put forward. It is noted that the current Constitution of the Russian Federation presents both normative and natural-legal types of legal understanding, which allows us to talk about the dual nature of personal dignity, including both natural (personal self-respect) and positive (respect for the human personality on the part of the state) components. \nA comparison is made of the “highest value” of a person declared at the constitutional level, his rights and freedoms, regardless of the individual socio-legal status and the actual situation that presupposes an attitude both to the individual himself and to his personal dignity, taking into account the place occupied in the social structure of society and appropriately assessed by the state (state rights). \nProposals and recommendations are formulated concerning the consolidation of the system of constitutional guarantees for the realization and protection of the right of personal dignity, as well as the legal technique of its limitation.",
      "citationCount": 0,
      "doi": "10.36511/2078-5356-2024-1-14-31",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/8466b9c5776ce4e3170c928064b07ff4d5eeda23",
      "venue": "Legal Science and Practice: Journal of Nizhny Novgorod Academy of the Ministry of Internal Affairs of Russia",
      "journal": {
        "name": "Legal Science and Practice: Journal of Nizhny Novgorod Academy of the Ministry of Internal Affairs of Russia"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "894ffb8f60fbe41fee916e4ae64a570fd97f9119",
      "title": "“Religion and the Commonweal in the Tradition of Political Philosophy”: An Unpublished Lecture by Leo Strauss",
      "authors": [
        {
          "name": "Svetozar Minkov",
          "authorId": "117505510"
        },
        {
          "name": "Rasoul Namazi",
          "authorId": "113271342"
        }
      ],
      "year": 2021,
      "abstract": "The transcript published here for the first time is of Leo Strauss’s 1963 lecture on, and discussion of, the relation of religion to the commonweal in the tradition of political philosophy. In this lecture, Strauss considers the question of the establishment of religion, the relation of freedom of religion to freedom from religion, and the question of the truth of religion. The lecture has implications for American constitutional jurisprudence, especially concerning the First Amendment, which Strauss situates within the development of modern political philosophy.",
      "citationCount": 1,
      "doi": "10.1086/711844",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/894ffb8f60fbe41fee916e4ae64a570fd97f9119",
      "venue": "American Political Thought",
      "journal": {
        "name": "American Political Thought",
        "pages": "86 - 120",
        "volume": "10"
      },
      "publicationTypes": null
    },
    {
      "paperId": "463b47677a1948ee89d4a1907d12f2238d9256dd",
      "title": "Natural law, human dignity and tradition of Böckenförde’s catholic political theology, from a conservative viewpoint",
      "authors": [
        {
          "name": "Ferenc Hörcher",
          "authorId": "74023504"
        }
      ],
      "year": 2021,
      "abstract": "This paper aims to show the connection between ideas on natural law, human dignity and tradition in the legal-political thought of Ernst-Wolfgang Böckenförde, an influential earlier judge of Germany’s Federal Constitutional Court. It starts out from the Catholic background of the legal theorist, and his close connection to Carl Schmitt, probably the most charismatic legal thinker of the age, who, however, burnt himself by his support of the Nazi regime. Böckenförde was politically closest to the Social Democrats, yet political theology remained crucial for his legal thought. His interpretation of the German Grundgesetz was founded on a very strong, universalist interpretation of the concept of human dignity, which he took as the most important, founding value in the value catalogue of the Basic Law. Although not a conservative, Böckenförde also claimed that in a specific legal sense, tradition also plays a major role in legal interpretation. He took over from the writings of his brother, the theologian Werner, the idea that tradition and reception can serve as checks on the way natural law is interpreted. All in all, as Böckenförde points out, the three concepts (natural law, human dignity and tradition) provide a strong foundation for legal and constitutional interpretation.",
      "citationCount": 0,
      "doi": "10.32575/ppb.2021.2.5",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/463b47677a1948ee89d4a1907d12f2238d9256dd",
      "venue": "Pro Publico Bono - Magyar Közigazgatás",
      "journal": {
        "name": "Pro Publico Bono - Magyar Közigazgatás"
      },
      "publicationTypes": null
    },
    {
      "paperId": "55fb08c192e5600f56f63d1f2f563905f041042b",
      "title": "Political liberalism, dualist democracy and the call to constituent power",
      "authors": [
        {
          "name": "Frank I. Michelman",
          "authorId": "15390042"
        }
      ],
      "year": 2024,
      "abstract": "Alessandro Ferrara’s argument in Sovereignty Across Generations takes shape within a broadly Rawlsian ‘political liberal’ framework of thought about moral underpinnings for a constitutional-democratic practice of politics. Where, exactly (I ask here), is the place within that thought for concern about occurrences in a country’s past of popular constituent power? If the country’s currently established constitutional regime is fully democratic (and is otherwise morally in order) by whatever operational measures you and I might think to apply, why should we or anyone care about how or by whose authority the regime got set up and running in the first place? By Ferrara’s Rawls-inspired teaching in Sovereignty Across Generations, the answer to that question will come from a certain conception of political legitimacy. But then a potent objection comes from those who press the question of how to reconcile a democratic conception of legitimacy with a subjection of current (say) deliberative-majoritarian rule to antecedently imposed terms of constraint. Under Rawlsian and Ferrarian stimulus, I look into the possible relevance here of H.L.A. Hart’s proposition of a complementarity or fusion, in our concept of law, of an ‘internal’ with an ‘external’ perspective that those involved may adopt toward the coercive social practice in question. Underlying the Rawlsian constitutional proposition on legitimacy, I end by suggesting, is the thought that, in order for a person to live in freedom under law, that person will have to sustain simultaneously an internal attitude of bonding to their society’s own ongoing project of legality and an external attitude of critical judgemental of that project as reasonably and rationally acceptable to free and equal citizens in conditions of reasonable pluralism.",
      "citationCount": 2,
      "doi": "10.1177/01914537241293372",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/55fb08c192e5600f56f63d1f2f563905f041042b",
      "venue": "Philosophy &amp; Social Criticism",
      "journal": {
        "name": "Philosophy & Social Criticism",
        "pages": "1419 - 1431",
        "volume": "50"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "1b7a2c29da8197f552ebd2ba34586387a70de072",
      "title": "Can democracy save children’s lives? Addressing the constitutional problem of expertise",
      "authors": [
        {
          "name": "Brice Laurent",
          "authorId": "2290536357"
        }
      ],
      "year": 2025,
      "abstract": "This comment critically examines Collins, Evans, and Reyes-Galindo’s (CE&RG) concept of ‘virtual diversity’, proposed as a norm to safeguard scientific expertise in policy-making. CE&RG argue that scientists should acquire ‘interactional expertise’ in relevant ‘non-scientific domains’, enabling informed policy advice while preserving scientific integrity. This comment describes CE&RG’s dualist approach, which separates epistemic and political concerns, and discusses its implications. It shows that for virtual diversity to contribute to the quality of and trust in expertise, this approach needs to be radically re-worked to include legitimacy-building processes. Using examples such as South Africa’s AIDS policy and the COVID-19 pandemic, the comment argues that defending expertise requires ensuring the robustness of both scientific and political representations, of, in other terms, addressing expertise as a constitutional problem. Without a broader critical constitutional analysis, CE&RG’s proposal risks reinforcing the crisis of expertise it seeks to remedy.",
      "citationCount": 3,
      "doi": "10.1177/03063127241310461",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/1b7a2c29da8197f552ebd2ba34586387a70de072",
      "venue": "Social Studies of Science",
      "journal": {
        "name": "Social Studies of Science",
        "pages": "288 - 294",
        "volume": "55"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "2ece9aea05942bc6295721f60b59ef43331f3705",
      "title": "Legitimacy and the Moral Imagination of Power: A Historical–Philosophical Inquiry from Weber to Contemporary Humanistic Thought",
      "authors": [
        {
          "name": "Bożena Iwanowska",
          "authorId": "2259000854"
        }
      ],
      "year": 2025,
      "abstract": "This article offers a historical–philosophical inquiry into political legitimacy as a phenomenon that exceeds formal legality and institutional performance, locating legitimacy within the moral imagination through which societies interpret and justify power. Re-reading Weber’s typology of domination as a humanistic problem of meaning, trust, and binding recognition, the study traces how legitimacy shifts across modern thought from inherited tradition and charismatic belief to rational-legal justification and democratic consent. The analysis integrates classical and contemporary perspectives by treating legitimacy as multidimensional: it rests on lawful acquisition and exercise of power, normative justification of governing rules, and the consent of the governed, while remaining continuously vulnerable to symbolic contestation and ethical evaluation. Special attention is given to the conceptual distinction between legitimacy as a state of recognised authority and legitimisation as an ongoing process of justification, clarification, and public confirmation. The article argues that modern legitimacy is sustained not only by procedures and outcomes but also by the capacity of power to appear morally intelligible—credible in conscience, resonant with shared values, and responsive to demands for dignity and fairness. By framing legitimacy as a moral language and interpretive practice, the study provides an integrative lens for analysing contemporary challenges, including the reconfiguration of authority under digital governance, and shifting regimes of trust.",
      "citationCount": 0,
      "doi": "10.5709/ah-03.03.2025-05",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/2ece9aea05942bc6295721f60b59ef43331f3705",
      "venue": "Acta Humanitatis",
      "journal": {
        "name": "Acta Humanitatis"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "43b246509586bd4930368d912198079b9d33070d",
      "title": "The Shortcomings of Just War Theories and the Legitimacy of Just Peace",
      "authors": [
        {
          "name": "Oliver Hidalgo",
          "authorId": "2380044434"
        }
      ],
      "year": 2025,
      "abstract": "In theory, the just war tradition claims to provide an appropriate standard for distinguishing legitimate military intervention from illegitimate aggression, which reduces the incidence of state and international violence. In practice, however, the concept of just war helps to morally embellish military action and obscure the political interests behind it. The article provides both a moral and political critique of just war theories, without in turn advocating a pacifist ostracism of war or denying the need for a normative justification of wars in terms of political realism. The argument is not that war cannot be justified in individual cases, but rather that the attempt to legitimise war as a general instrument of law and justice fails both in moral philosophy and political theory. As a last resort, war requires a theory of just peace as a supplement in order to present a coherent conception of the justification of war and of peace.",
      "citationCount": 1,
      "doi": "10.17645/pag.10159",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/43b246509586bd4930368d912198079b9d33070d",
      "venue": "Politics and Governance",
      "journal": {
        "name": "Politics and Governance"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "bb8e2b5ad3d97e3e32b247f3400dd63d1b9affe2",
      "title": "John Marshall, Marbury v. Madison, and the Construction of Constitutional Legitimacy",
      "authors": [
        {
          "name": "C. Ray",
          "authorId": "117205102"
        }
      ],
      "year": 2016,
      "abstract": null,
      "citationCount": 1,
      "doi": "10.1177/1743872116650867",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/bb8e2b5ad3d97e3e32b247f3400dd63d1b9affe2",
      "venue": "",
      "journal": {
        "name": "Law, Culture and the Humanities",
        "pages": "205 - 226",
        "volume": "15"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "fc03754f33ce89eec5aa704514e4a37ac11e9154",
      "title": "History, Markets, and Revolutions: Reviewing Foucault’s Contribution to the Analysis of Political Temporality",
      "authors": [
        {
          "name": "Alessandro Volpi",
          "authorId": "2280480990"
        },
        {
          "name": "Alessio Porrino",
          "authorId": "2331125833"
        }
      ],
      "year": 2024,
      "abstract": "ABSTRACT:This article explores the Foucauldian analysis of the linkage between temporality and politics, addressing mainly two loci of Foucault’s production: the assessment of the post-WWII ordoliberal experience in The Birth of Biopolitics and the Iran reportage for “Corriere Della Sera”. The article emphasizes the relevance of Foucault’s assessment of ordoliberal Germany for contemporary studies on neoliberalism and inscribes Foucault in a wider tradition of thought on the relevance of history and temporality for the comprehension of political dynamics. In TBoB, Foucault offered a prescient analysis of neoliberal temporality and its de-politicizing effects. In his view, ordoliberal theorists and politicians sought to ground political legitimacy in the economy itself, giving birth to a political-economic “double circuit” which did away with history and made political consensus “permanent” and automatic. The connection between neoliberalism, the restructuring of state sovereignty, and temporality will be highlighted. Furthermore, by analyzing the almost-coeval Iranian reportages and the eulogy for Clavel, the article further investigates Foucault’s reflection on the link between temporality, politics, and subjectivation processes. If the analysis of ordoliberal temporality in TBoB describes a linkage between de-temporalization and depoliticization, the reportages will be highlighted as a possible “pars construens” – as a way to reinstate the possibility of political action through the appeal to different ways to experience temporality. The article concludes that Foucault’s sparse comments on temporality can be read as an attempt, albeit not fully developed, not only to envision the de-politicizing effects of marketization but also to envisage new, re-politicizing modes of experiencing temporality and history.",
      "citationCount": 0,
      "doi": "10.1353/fou.2024.a940825",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/fc03754f33ce89eec5aa704514e4a37ac11e9154",
      "venue": "Foucault Studies",
      "journal": {
        "name": "Foucault Studies",
        "pages": "350 - 376",
        "volume": "36"
      },
      "publicationTypes": [
        "JournalArticle",
        "Review"
      ]
    },
    {
      "paperId": "300284c6dfe1c0031331a51636d002dbb0514529",
      "title": "Scale Invariance in Constitutional Political Economy (CPE)",
      "authors": [
        {
          "name": "B. Gussen",
          "authorId": "107980873"
        }
      ],
      "year": 2019,
      "abstract": null,
      "citationCount": 0,
      "doi": "10.1007/978-981-13-6950-6_3",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/300284c6dfe1c0031331a51636d002dbb0514529",
      "venue": "Axial Shift",
      "journal": {
        "name": "Axial Shift"
      },
      "publicationTypes": null
    },
    {
      "paperId": "d426fcafe6d9ecdae248e80605b79ee331712d7e",
      "title": "Government, rights and legitimacy: Foucault and liberal political normativity",
      "authors": [
        {
          "name": "P. Patton",
          "authorId": "117015477"
        }
      ],
      "year": 2016,
      "abstract": null,
      "citationCount": 9,
      "doi": "10.1177/1474885115582077",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/d426fcafe6d9ecdae248e80605b79ee331712d7e",
      "venue": "",
      "journal": {
        "name": "European Journal of Political Theory",
        "pages": "223 - 239",
        "volume": "15"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "4a291ca1a8701aa2eedf97fd30e765b50dda3b51",
      "title": "Neo-Elyian theory, therapeutic jurisprudence and the constitutional judgment",
      "authors": [
        {
          "name": "Sarah Murray",
          "authorId": "2298171711"
        }
      ],
      "year": 2025,
      "abstract": "\n This paper seeks to understand modern comparative reflections on John Hart Ely’s work through Comparative Political Process Theory or Comparative Representation-Reinforcing Theory, and how such approaches can be augmented through the lens of therapeutic jurisprudence. It argues that the legitimacy of courts’ actions (or inactions) in such settings can be understood through their potential to strengthen democratic institutions rather than do them harm, acting as a re-set or recalibration of the democratic landscape. By buttressing representation-reinforcing approaches with therapeutic understandings, curial interventions designed to shift longstanding democratic impasses or blind spots are likely to carry much greater institutional legitimacy. By applying this lens to a series of case studies, the paper highlights the normative contribution that therapeutic jurisprudence can provide to representation-reinforcing action and to the design of such approaches.",
      "citationCount": 0,
      "doi": "10.1017/s2045381724000236",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/4a291ca1a8701aa2eedf97fd30e765b50dda3b51",
      "venue": "Global Constitutionalism",
      "journal": {
        "name": "Global Constitutionalism"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    },
    {
      "paperId": "44dd6b2b359523e3ab636565a26355e99de9a864",
      "title": "Justifying constitutional review in the legitimacy register",
      "authors": [
        {
          "name": "D. Kyritsis",
          "authorId": "50395603"
        }
      ],
      "year": 2020,
      "abstract": "In this article I restate and sharpen key claims of my book Where Our Protection Lies, responding to the reviews written by Donald Bello Hutt, Alon Harel, and Matthias Klatt for this symposium. I first explicate the role that practice plays in my argument against critics of constitutional review and, more broadly, in my account of the value of democratic representation. This allows me to clarify and defend the general methodology I employ in the book, which I label moralised constitutional theory (MCT). Against Bello Hutt I argue that MCT does not merely rationalise existing practice; it heeds existing practice only to the extent that it can morally legitimate state power in the special way that constitutional law is meant to do. I then go on to evaluate Harel’s suggestion that constitutional review evinces the proper attitude towards rights; it expresses the idea that certain activities are off limits to government regulation. By contrast, legislative protection of our rights puts at the majority’s mercy. I contend that this suggestion has a problematic fit with contemporary constitutional practice. More importantly, it does not take into account that being subject to the authority of a judge also raises concerns about domination, and those concerns must be balanced against the expressive benefits of constitutional review, if there are any. Finally, I register a worry concerning the rapprochement that Klatt urges between our respective theories. Although both theories subscribe to the view that the content of our constitutional rights and duties is determined by the proper balance of moral considerations pertaining to the content of political decisions, on the one hand, and the features of the institutional structure that has produced them, on the other, I am sceptical that these considerations operate as optimisation requirements.",
      "citationCount": 1,
      "doi": "10.4000/revus.5706",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/44dd6b2b359523e3ab636565a26355e99de9a864",
      "venue": "",
      "journal": {
        "name": "",
        "volume": ""
      },
      "publicationTypes": [
        "Review"
      ]
    },
    {
      "paperId": "a3baed92c8ef9a1b8656d848f0142d1def02b0f7",
      "title": "Constitutional patriotism in the context of Habermas’s political philosophy",
      "authors": [
        {
          "name": "Predrag Zenović",
          "authorId": "122077092"
        }
      ],
      "year": 2021,
      "abstract": null,
      "citationCount": 0,
      "doi": "10.26362/20210106",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/a3baed92c8ef9a1b8656d848f0142d1def02b0f7",
      "venue": "",
      "journal": {
        "name": "",
        "pages": "119-136",
        "volume": "20"
      },
      "publicationTypes": null
    },
    {
      "paperId": "cea3f566bd2bd33f828b9c0ccd244d4d25a34068",
      "title": "ROUSSEAU AND HO CHI MINH'S VIEWS ON THE CONSTITUTIONAL AND LAWFUL STATE – FROM THEORY TO PRACTICE IN VIETNAM",
      "authors": [
        {
          "name": "Nguyễn Trung Hiểu",
          "authorId": "2260466122"
        },
        {
          "name": "Nguyễn Anh Thường",
          "authorId": "2260456117"
        }
      ],
      "year": 2023,
      "abstract": "Inheriting the humanistic and revolutionary spirit of the French Enlightenment, especially from Rousseau, in the twentieth century, President Ho Chi Minh, on the foundation of Marxism-Leninism, solved the problem of the liberated nation, human rights, and civil rights with realistic social revolutions, contributing to the common progress of humanity according to the ideals of freedom and equality for all people and peoples. The socialist state of Vietnam, from the first days of its founding, has been a constitutional and legal state in accordance with all principles of a legitimate state. Thanks to its legitimacy, the Vietnamese state had gained the strength and legitimacy needed in the struggle to protect national independence from hostile forces. Facing the requirements of socio-political reality, Vietnam, on the theoretical basis of Ho Chi Minh's thoughts, has made efforts to consolidate and perfect the state to ensure civil and human rights in the country, contributing to promoting peace, cooperation, and progress of the world. Researching a variety of thoughts from Rousseau's views on the legal and constitutional state to Ho Chi Minh's thoughts and drawing out the core values and orientations for building the administrative system in Vietnam today is the purpose of the article.  Article visualizations:",
      "citationCount": 0,
      "doi": "10.46827/ejsss.v9i3.1591",
      "arxivId": null,
      "url": "https://www.semanticscholar.org/paper/cea3f566bd2bd33f828b9c0ccd244d4d25a34068",
      "venue": "European Journal of Social Sciences Studies",
      "journal": {
        "name": "European Journal of Social Sciences Studies"
      },
      "publicationTypes": [
        "JournalArticle"
      ]
    }
  ],
  "count": 35,
  "errors": []
}
